-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/jared/WageReturnsRepo/Analysis/y97_logits_all_binned_t0_16.l
> og
  log type:  text
 opened on:  18 Mar 2019, 10:47:25

. set matsize 4000

. 
. *****************************************************************************
. * Perform mlogits on data to use at starting points for V++
. *  Race Interactions Model
. *****************************************************************************
. *============================================================================
. * Import data, define macros, call constraints
. *============================================================================
. 
. if "`c(username)'"=="jared"  global secretdir [REDACTED]

. if "`c(username)'"=="ransom" global secretdir [REDACTED]nl
> sy/"

. 
. use if cohortFlag==1997 & ~female using ${secretdir}/yCombined_scaled_t0_16.d
> ta, clear

. * drop if inlist(birthYear,1957,1958)
. 
. * local Pvars79O black hispanic born1957 born1958 born1959          foreignBo
> rn
. * local Pvars79Y black hispanic born1961 born1962 born1963          foreignBo
> rn
. local Pvars79  black hispanic born1959 born1960 born1961 born1962 born1963 fo
> reignBorn

. local Pvars97  black hispanic born1980 born1981 born1982 born1983          fo
> reignBorn

. local Mvars    empPct incPerCapita

. local Fvars    hgcMoth hgcMothSq m_hgcMoth hgcFath hgcFathSq m_hgcFath famInc
>  famIncSq m_famInc femaleHeadHH14 liveWithMom14

. local Cvars    numBAzero numBAperCapita tuitionFlagship

. 
. local Svars1    schoolOnlyBlack schoolOnlyHisp

. local Zvars1    workK12Black workK12Hisp

. local Evars1    workPTBlack workPTHisp workFTBlack workFTHisp otherBlack othe
> rHisp

. 
. local Svars2    schoolOnlyBlack schoolOnlyHisp

. local Zvars2    workK12Black workK12Hisp workCollegeBlack workCollegeHisp 

. local Evars2    workPTBlack workPTHisp workFTBlack workFTHisp militaryBlack m
> ilitaryHisp otherBlack otherHisp

. 
. local Svars3    schoolOnlyBlack schoolOnlyHisp

. local Zvars3    workK12Black workK12Hisp workCollegeBlack workCollegeHisp 

. local Evars3    workPTBlack workPTHisp workFTBlack workFTHisp militaryBlack m
> ilitaryHisp otherBlack otherHisp

. 
. local Svars    schoolOnlyt schoolOnlyBlack schoolOnlyHisp schoolOnlySq

. local Zvars    workK12t workK12Black workK12Hisp workK12Sq workColleget workC
> ollegeBlack workCollegeHisp workCollegeSq

. local Evars    workPTonlyt workPTBlack workPTHisp workPTSq workFTonlyt workFT
> Black workFTHisp workFTSq militaryt militaryBlack militaryHisp militarySq oth
> ert otherBlack otherHisp otherSq

. 
. 
. table activity, c(p5 anySchoolt   p25 anySchoolt   median anySchoolt   p75 an
> ySchoolt   p95 anySchoolt  )

--------------------------------------------------------------------
                                activity | p5(anySch~t) p25(anySc~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0     .3333333
    Work in school, no HS Diploma or GED |     .0833333     .5833333
    Part-time Work, no HS Diploma or GED |            0     .5833333
    Full-time Work, no HS Diploma or GED |            0     .6666667
          Military, no HS Diploma or GED |     1.166667     1.666667
  Other Activities, no HS Diploma or GED |            0           .5
HS Grad this month, regardless of work/m |     .9166667     1.666667
      School Only, HS Grad or GED Holder |     1.833333     2.666667
   Work in school, HS Grad or GED Holder |     1.916667            3
   Part-time Work, HS Grad or GED Holder |     .8333333     1.833333
   Full-time Work, HS Grad or GED Holder |     1.083333            2
         Military, HS Grad or GED Holder |     1.416667     1.916667
 Other Activities, HS Grad or GED Holder |           .5     1.666667
4yr Grad this month, regardless of work/ |     5.083333     5.791667
           School Only, 4yr College Grad |     5.583333     6.666667
        Work in school, 4yr College Grad |     5.583333         6.75
        Part-time Work, 4yr College Grad |     5.083333     5.833333
        Full-time Work, 4yr College Grad |     5.333333            6
              Military, 4yr College Grad |     5.416667     6.166667
      Other Activities, 4yr College Grad |     5.333333     6.083333
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(anySc~t) p75(anySc~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |     .8333333     1.416667
    Work in school, no HS Diploma or GED |     1.166667     1.666667
    Part-time Work, no HS Diploma or GED |         1.25     1.916667
    Full-time Work, no HS Diploma or GED |          1.5     2.166667
          Military, no HS Diploma or GED |     2.916667          5.5
  Other Activities, no HS Diploma or GED |     1.166667     1.833333
HS Grad this month, regardless of work/m |            2     2.416667
      School Only, HS Grad or GED Holder |         3.75     5.166667
   Work in school, HS Grad or GED Holder |     4.166667     5.583333
   Part-time Work, HS Grad or GED Holder |          2.5     3.416667
   Full-time Work, HS Grad or GED Holder |     2.583333     3.583333
         Military, HS Grad or GED Holder |     2.333333     3.083333
 Other Activities, HS Grad or GED Holder |     2.416667     3.333333
4yr Grad this month, regardless of work/ |     6.416667          7.5
           School Only, 4yr College Grad |     7.666667            9
        Work in school, 4yr College Grad |     7.833333     9.166667
        Part-time Work, 4yr College Grad |     6.666667         7.75
        Full-time Work, 4yr College Grad |     6.833333     7.916667
              Military, 4yr College Grad |     6.583333     7.833333
      Other Activities, 4yr College Grad |     6.916667     8.166667
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(anySc~t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |     2.333333
    Work in school, no HS Diploma or GED |     2.583333
    Part-time Work, no HS Diploma or GED |     3.166667
    Full-time Work, no HS Diploma or GED |     3.333333
          Military, no HS Diploma or GED |          5.5
  Other Activities, no HS Diploma or GED |     3.166667
HS Grad this month, regardless of work/m |     3.083333
      School Only, HS Grad or GED Holder |         7.75
   Work in school, HS Grad or GED Holder |     8.083333
   Part-time Work, HS Grad or GED Holder |            6
   Full-time Work, HS Grad or GED Holder |     6.333333
         Military, HS Grad or GED Holder |     5.583333
 Other Activities, HS Grad or GED Holder |            6
4yr Grad this month, regardless of work/ |     9.833333
           School Only, 4yr College Grad |     12.16667
        Work in school, 4yr College Grad |           12
        Part-time Work, 4yr College Grad |     10.16667
        Full-time Work, 4yr College Grad |     9.916667
              Military, 4yr College Grad |     10.33333
      Other Activities, 4yr College Grad |     9.916667
-------------------------------------------------------

. table activity, c(p5 schoolOnlyt  p25 schoolOnlyt  median schoolOnlyt  p75 sc
> hoolOnlyt  p95 schoolOnlyt )

--------------------------------------------------------------------
                                activity | p5(school~t) p25(schoo~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0          .25
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0     .1666667
    Full-time Work, no HS Diploma or GED |            0          .25
          Military, no HS Diploma or GED |     .1666667     .9166667
  Other Activities, no HS Diploma or GED |            0     .3333333
HS Grad this month, regardless of work/m |            0     .4166667
      School Only, HS Grad or GED Holder |           .5          1.5
   Work in school, HS Grad or GED Holder |            0     .5833333
   Part-time Work, HS Grad or GED Holder |            0     .5833333
   Full-time Work, HS Grad or GED Holder |            0     .4166667
         Military, HS Grad or GED Holder |            0     .4166667
 Other Activities, HS Grad or GED Holder |            0          .75
4yr Grad this month, regardless of work/ |     .3333333        1.375
           School Only, 4yr College Grad |          1.5     3.166667
        Work in school, 4yr College Grad |          .25     1.333333
        Part-time Work, 4yr College Grad |     .4166667     1.583333
        Full-time Work, 4yr College Grad |     .3333333     1.416667
              Military, 4yr College Grad |     .8333333            3
      Other Activities, 4yr College Grad |     .3333333          1.5
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(schoo~t) p75(schoo~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |     .6666667     1.166667
    Work in school, no HS Diploma or GED |          .25          .75
    Part-time Work, no HS Diploma or GED |     .6666667     1.333333
    Full-time Work, no HS Diploma or GED |     .8333333          1.5
          Military, no HS Diploma or GED |     1.083333     2.833333
  Other Activities, no HS Diploma or GED |          .75     1.416667
HS Grad this month, regardless of work/m |     1.083333     1.666667
      School Only, HS Grad or GED Holder |     2.333333     3.416667
   Work in school, HS Grad or GED Holder |     1.333333     2.166667
   Part-time Work, HS Grad or GED Holder |     1.333333            2
   Full-time Work, HS Grad or GED Holder |     1.166667     1.916667
         Military, HS Grad or GED Holder |     1.166667     1.833333
 Other Activities, HS Grad or GED Holder |          1.5         2.25
4yr Grad this month, regardless of work/ |          2.5            4
           School Only, 4yr College Grad |         4.75         6.25
        Work in school, 4yr College Grad |     2.166667         3.75
        Part-time Work, 4yr College Grad |     2.833333     4.416667
        Full-time Work, 4yr College Grad |          2.5     3.916667
              Military, 4yr College Grad |     4.333333     5.833333
      Other Activities, 4yr College Grad |     2.916667     5.083333
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(schoo~t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |            2
    Work in school, no HS Diploma or GED |     1.666667
    Part-time Work, no HS Diploma or GED |     2.333333
    Full-time Work, no HS Diploma or GED |     2.333333
          Military, no HS Diploma or GED |     2.833333
  Other Activities, no HS Diploma or GED |     2.583333
HS Grad this month, regardless of work/m |     2.416667
      School Only, HS Grad or GED Holder |          5.5
   Work in school, HS Grad or GED Holder |         3.75
   Part-time Work, HS Grad or GED Holder |     3.416667
   Full-time Work, HS Grad or GED Holder |     3.166667
         Military, HS Grad or GED Holder |     3.416667
 Other Activities, HS Grad or GED Holder |            4
4yr Grad this month, regardless of work/ |     5.916667
           School Only, 4yr College Grad |     9.583333
        Work in school, 4yr College Grad |     5.833333
        Part-time Work, 4yr College Grad |     6.416667
        Full-time Work, 4yr College Grad |            6
              Military, 4yr College Grad |     8.083333
      Other Activities, 4yr College Grad |     7.083333
-------------------------------------------------------

. table activity, c(p5 workK12t     p25 workK12t     median workK12t     p75 wo
> rkK12t     p95 workK12t    )

--------------------------------------------------------------------
                                activity | p5(workK12t) p25(wor~12t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0          .25
    Part-time Work, no HS Diploma or GED |            0            0
    Full-time Work, no HS Diploma or GED |            0            0
          Military, no HS Diploma or GED |     .6666667          .75
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0          .25
      School Only, HS Grad or GED Holder |            0     .1666667
   Work in school, HS Grad or GED Holder |            0     .3333333
   Part-time Work, HS Grad or GED Holder |            0     .1666667
   Full-time Work, HS Grad or GED Holder |            0          .25
         Military, HS Grad or GED Holder |            0     .4166667
 Other Activities, HS Grad or GED Holder |            0     .0833333
4yr Grad this month, regardless of work/ |            0          .25
           School Only, 4yr College Grad |            0     .1666667
        Work in school, 4yr College Grad |            0          .25
        Part-time Work, 4yr College Grad |            0     .1666667
        Full-time Work, 4yr College Grad |            0          .25
              Military, 4yr College Grad |            0     .1666667
      Other Activities, 4yr College Grad |            0     .1666667
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(wor~12t) p75(wor~12t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0     .1666667
    Work in school, no HS Diploma or GED |     .5833333     1.083333
    Part-time Work, no HS Diploma or GED |          .25     .8333333
    Full-time Work, no HS Diploma or GED |          .25     .9166667
          Military, no HS Diploma or GED |     1.833333     2.666667
  Other Activities, no HS Diploma or GED |            0     .4166667
HS Grad this month, regardless of work/m |     .8333333     1.583333
      School Only, HS Grad or GED Holder |     .6666667     1.333333
   Work in school, HS Grad or GED Holder |            1     1.583333
   Part-time Work, HS Grad or GED Holder |          .75     1.416667
   Full-time Work, HS Grad or GED Holder |     .9166667     1.583333
         Military, HS Grad or GED Holder |     1.166667     1.666667
 Other Activities, HS Grad or GED Holder |           .5     1.083333
4yr Grad this month, regardless of work/ |     .9166667     1.583333
           School Only, 4yr College Grad |          .75         1.25
        Work in school, 4yr College Grad |     .9166667     1.583333
        Part-time Work, 4yr College Grad |     .8333333          1.5
        Full-time Work, 4yr College Grad |     .9166667     1.583333
              Military, 4yr College Grad |     .6666667     1.583333
      Other Activities, 4yr College Grad |     .8333333     1.583333
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(wor~12t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |     .9166667
    Work in school, no HS Diploma or GED |     1.833333
    Part-time Work, no HS Diploma or GED |     1.666667
    Full-time Work, no HS Diploma or GED |     2.083333
          Military, no HS Diploma or GED |     2.666667
  Other Activities, no HS Diploma or GED |     1.333333
HS Grad this month, regardless of work/m |         2.25
      School Only, HS Grad or GED Holder |     2.083333
   Work in school, HS Grad or GED Holder |         2.25
   Part-time Work, HS Grad or GED Holder |         2.25
   Full-time Work, HS Grad or GED Holder |     2.416667
         Military, HS Grad or GED Holder |         2.25
 Other Activities, HS Grad or GED Holder |     2.083333
4yr Grad this month, regardless of work/ |     2.166667
           School Only, 4yr College Grad |     2.166667
        Work in school, 4yr College Grad |         2.25
        Part-time Work, 4yr College Grad |     2.083333
        Full-time Work, 4yr College Grad |     2.166667
              Military, 4yr College Grad |     1.666667
      Other Activities, 4yr College Grad |     2.333333
-------------------------------------------------------

. table activity, c(p5 workColleget p25 workColleget median workColleget p75 wo
> rkColleget p95 workColleget)

--------------------------------------------------------------------
                                activity | p5(workCo~t) p25(workC~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0            0
    Full-time Work, no HS Diploma or GED |            0            0
          Military, no HS Diploma or GED |            0            0
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0            0
      School Only, HS Grad or GED Holder |            0            0
   Work in school, HS Grad or GED Holder |     .0833333     .5833333
   Part-time Work, HS Grad or GED Holder |            0            0
   Full-time Work, HS Grad or GED Holder |            0            0
         Military, HS Grad or GED Holder |            0            0
 Other Activities, HS Grad or GED Holder |            0            0
4yr Grad this month, regardless of work/ |     .3333333     1.833333
           School Only, 4yr College Grad |            0            1
        Work in school, 4yr College Grad |     1.333333     3.083333
        Part-time Work, 4yr College Grad |     .3333333         1.75
        Full-time Work, 4yr College Grad |     .6666667     2.166667
              Military, 4yr College Grad |            0     .5833333
      Other Activities, 4yr College Grad |     .0833333     1.333333
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(workC~t) p75(workC~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0            0
    Full-time Work, no HS Diploma or GED |            0            0
          Military, no HS Diploma or GED |            0            0
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0            0
      School Only, HS Grad or GED Holder |          .25            1
   Work in school, HS Grad or GED Holder |          1.5         2.75
   Part-time Work, HS Grad or GED Holder |            0     .5833333
   Full-time Work, HS Grad or GED Holder |            0            1
         Military, HS Grad or GED Holder |            0     .0833333
 Other Activities, HS Grad or GED Holder |            0     .3333333
4yr Grad this month, regardless of work/ |            3     4.083333
           School Only, 4yr College Grad |            2         3.25
        Work in school, 4yr College Grad |     4.416667            6
        Part-time Work, 4yr College Grad |     2.916667            4
        Full-time Work, 4yr College Grad |         3.25     4.416667
              Military, 4yr College Grad |     1.833333     2.916667
      Other Activities, 4yr College Grad |     2.916667     4.333333
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(workC~t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |            0
    Work in school, no HS Diploma or GED |            0
    Part-time Work, no HS Diploma or GED |            0
    Full-time Work, no HS Diploma or GED |            0
          Military, no HS Diploma or GED |            0
  Other Activities, no HS Diploma or GED |            0
HS Grad this month, regardless of work/m |            0
      School Only, HS Grad or GED Holder |     2.833333
   Work in school, HS Grad or GED Holder |         5.25
   Part-time Work, HS Grad or GED Holder |     2.666667
   Full-time Work, HS Grad or GED Holder |          3.5
         Military, HS Grad or GED Holder |          1.5
 Other Activities, HS Grad or GED Holder |     2.083333
4yr Grad this month, regardless of work/ |     6.416667
           School Only, 4yr College Grad |     5.583333
        Work in school, 4yr College Grad |     8.916667
        Part-time Work, 4yr College Grad |     6.416667
        Full-time Work, 4yr College Grad |     6.583333
              Military, 4yr College Grad |     3.833333
      Other Activities, 4yr College Grad |         6.25
-------------------------------------------------------

. table activity, c(p5 workPTonlyt  p25 workPTonlyt  median workPTonlyt  p75 wo
> rkPTonlyt  p95 workPTonlyt )

--------------------------------------------------------------------
                                activity | p5(workPT~t) p25(workP~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0     .0833333
    Full-time Work, no HS Diploma or GED |            0          .25
          Military, no HS Diploma or GED |     .1666667     .1666667
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0            0
      School Only, HS Grad or GED Holder |            0     .0833333
   Work in school, HS Grad or GED Holder |            0     .1666667
   Part-time Work, HS Grad or GED Holder |     .1666667     .5833333
   Full-time Work, HS Grad or GED Holder |     .0833333     .3333333
         Military, HS Grad or GED Holder |            0     .1666667
 Other Activities, HS Grad or GED Holder |            0     .3333333
4yr Grad this month, regardless of work/ |            0     .1666667
           School Only, 4yr College Grad |            0          .25
        Work in school, 4yr College Grad |            0     .1666667
        Part-time Work, 4yr College Grad |     .1666667     .5833333
        Full-time Work, 4yr College Grad |     .0833333          .25
              Military, 4yr College Grad |            0     .1666667
      Other Activities, 4yr College Grad |     .0833333     .3333333
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(workP~t) p75(workP~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |     .0833333     .1666667
    Part-time Work, no HS Diploma or GED |     .5833333     1.666667
    Full-time Work, no HS Diploma or GED |     .6666667     1.416667
          Military, no HS Diploma or GED |     .8333333     1.416667
  Other Activities, no HS Diploma or GED |     .3333333     1.166667
HS Grad this month, regardless of work/m |     .1666667          .25
      School Only, HS Grad or GED Holder |          .25           .5
   Work in school, HS Grad or GED Holder |     .3333333     .6666667
   Part-time Work, HS Grad or GED Holder |     1.333333     2.583333
   Full-time Work, HS Grad or GED Holder |          .75          1.5
         Military, HS Grad or GED Holder |     .3333333     .6666667
 Other Activities, HS Grad or GED Holder |     .9166667         1.75
4yr Grad this month, regardless of work/ |          .25           .5
           School Only, 4yr College Grad |     .4166667     .8333333
        Work in school, 4yr College Grad |     .4166667          .75
        Part-time Work, 4yr College Grad |     1.333333     2.666667
        Full-time Work, 4yr College Grad |           .5     .9166667
              Military, 4yr College Grad |     .3333333     .5833333
      Other Activities, 4yr College Grad |     .5833333     1.083333
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(workP~t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |     .1666667
    Work in school, no HS Diploma or GED |     .3333333
    Part-time Work, no HS Diploma or GED |     4.166667
    Full-time Work, no HS Diploma or GED |     3.166667
          Military, no HS Diploma or GED |     1.416667
  Other Activities, no HS Diploma or GED |         3.25
HS Grad this month, regardless of work/m |     .7083334
      School Only, HS Grad or GED Holder |     1.916667
   Work in school, HS Grad or GED Holder |     2.166667
   Part-time Work, HS Grad or GED Holder |         5.75
   Full-time Work, HS Grad or GED Holder |         3.25
         Military, HS Grad or GED Holder |     1.583333
 Other Activities, HS Grad or GED Holder |         3.75
4yr Grad this month, regardless of work/ |         1.75
           School Only, 4yr College Grad |     2.416667
        Work in school, 4yr College Grad |         2.25
        Part-time Work, 4yr College Grad |     5.666667
        Full-time Work, 4yr College Grad |         2.25
              Military, 4yr College Grad |          1.5
      Other Activities, 4yr College Grad |     2.833333
-------------------------------------------------------

. table activity, c(p5 workFTonlyt  p25 workFTonlyt  median workFTonlyt  p75 wo
> rkFTonlyt  p95 workFTonlyt )

--------------------------------------------------------------------
                                activity | p5(workFT~t) p25(workF~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0            0
    Full-time Work, no HS Diploma or GED |     .0833333            1
          Military, no HS Diploma or GED |            0            0
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0            0
      School Only, HS Grad or GED Holder |            0            0
   Work in school, HS Grad or GED Holder |            0            0
   Part-time Work, HS Grad or GED Holder |            0          .25
   Full-time Work, HS Grad or GED Holder |     .3333333            2
         Military, HS Grad or GED Holder |            0            0
 Other Activities, HS Grad or GED Holder |            0          .25
4yr Grad this month, regardless of work/ |            0            0
           School Only, 4yr College Grad |            0            0
        Work in school, 4yr College Grad |            0     .3333333
        Part-time Work, 4yr College Grad |            0          .25
        Full-time Work, 4yr College Grad |     .4166667            2
              Military, 4yr College Grad |            0            0
      Other Activities, 4yr College Grad |            0     .4166667
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(workF~t) p75(workF~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |          .25            2
    Full-time Work, no HS Diploma or GED |            3         6.25
          Military, no HS Diploma or GED |     1.583333     2.666667
  Other Activities, no HS Diploma or GED |     .1666667     1.666667
HS Grad this month, regardless of work/m |            0     .0833333
      School Only, HS Grad or GED Holder |            0     .3333333
   Work in school, HS Grad or GED Holder |     .1666667     1.083333
   Part-time Work, HS Grad or GED Holder |     1.416667         3.75
   Full-time Work, HS Grad or GED Holder |     4.416667     7.416667
         Military, HS Grad or GED Holder |     .3333333     1.166667
 Other Activities, HS Grad or GED Holder |     1.583333     4.166667
4yr Grad this month, regardless of work/ |     .0833333     .3333333
           School Only, 4yr College Grad |     .3333333          1.5
        Work in school, 4yr College Grad |         1.75     3.083333
        Part-time Work, 4yr College Grad |     1.166667            3
        Full-time Work, 4yr College Grad |     3.916667     6.166667
              Military, 4yr College Grad |     .3333333     .8333333
      Other Activities, 4yr College Grad |     1.916667            4
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(workF~t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |     .1666667
    Work in school, no HS Diploma or GED |     .1666667
    Part-time Work, no HS Diploma or GED |     6.583333
    Full-time Work, no HS Diploma or GED |     11.33333
          Military, no HS Diploma or GED |     2.666667
  Other Activities, no HS Diploma or GED |     5.916667
HS Grad this month, regardless of work/m |     1.083333
      School Only, HS Grad or GED Holder |     3.416667
   Work in school, HS Grad or GED Holder |     5.083333
   Part-time Work, HS Grad or GED Holder |     7.916667
   Full-time Work, HS Grad or GED Holder |     11.58333
         Military, HS Grad or GED Holder |         3.75
 Other Activities, HS Grad or GED Holder |          8.5
4yr Grad this month, regardless of work/ |         2.75
           School Only, 4yr College Grad |     4.666667
        Work in school, 4yr College Grad |     6.166667
        Part-time Work, 4yr College Grad |     6.333333
        Full-time Work, 4yr College Grad |     9.416667
              Military, 4yr College Grad |     2.916667
      Other Activities, 4yr College Grad |     7.083333
-------------------------------------------------------

. table activity, c(p5 militaryt    p25 militaryt    median militaryt    p75 mi
> litaryt    p95 militaryt   )

--------------------------------------------------------------------
                                activity | p5(milita~t) p25(milit~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0            0
    Full-time Work, no HS Diploma or GED |            0            0
          Military, no HS Diploma or GED |            0     .6666667
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0            0
      School Only, HS Grad or GED Holder |            0            0
   Work in school, HS Grad or GED Holder |            0            0
   Part-time Work, HS Grad or GED Holder |            0            0
   Full-time Work, HS Grad or GED Holder |            0            0
         Military, HS Grad or GED Holder |     .1666667     1.083333
 Other Activities, HS Grad or GED Holder |            0            0
4yr Grad this month, regardless of work/ |            0            0
           School Only, 4yr College Grad |            0            0
        Work in school, 4yr College Grad |            0            0
        Part-time Work, 4yr College Grad |            0            0
        Full-time Work, 4yr College Grad |            0            0
              Military, 4yr College Grad |          .25     1.583333
      Other Activities, 4yr College Grad |            0            0
--------------------------------------------------------------------

--------------------------------------------------------------------
                                activity | med(milit~t) p75(milit~t)
-----------------------------------------+--------------------------
       School Only, no HS Diploma or GED |            0            0
    Work in school, no HS Diploma or GED |            0            0
    Part-time Work, no HS Diploma or GED |            0            0
    Full-time Work, no HS Diploma or GED |            0            0
          Military, no HS Diploma or GED |         2.25            4
  Other Activities, no HS Diploma or GED |            0            0
HS Grad this month, regardless of work/m |            0            0
      School Only, HS Grad or GED Holder |            0            0
   Work in school, HS Grad or GED Holder |            0            0
   Part-time Work, HS Grad or GED Holder |            0            0
   Full-time Work, HS Grad or GED Holder |            0            0
         Military, HS Grad or GED Holder |     2.583333     5.083333
 Other Activities, HS Grad or GED Holder |            0            0
4yr Grad this month, regardless of work/ |            0            0
           School Only, 4yr College Grad |            0            0
        Work in school, 4yr College Grad |            0            0
        Part-time Work, 4yr College Grad |            0            0
        Full-time Work, 4yr College Grad |            0            0
              Military, 4yr College Grad |     3.208333     5.166667
      Other Activities, 4yr College Grad |            0            0
--------------------------------------------------------------------

-------------------------------------------------------
                                activity | p95(milit~t)
-----------------------------------------+-------------
       School Only, no HS Diploma or GED |            0
    Work in school, no HS Diploma or GED |            0
    Part-time Work, no HS Diploma or GED |            0
    Full-time Work, no HS Diploma or GED |            0
          Military, no HS Diploma or GED |         6.25
  Other Activities, no HS Diploma or GED |            0
HS Grad this month, regardless of work/m |            0
      School Only, HS Grad or GED Holder |     4.416667
   Work in school, HS Grad or GED Holder |     1.416667
   Part-time Work, HS Grad or GED Holder |     .1666667
   Full-time Work, HS Grad or GED Holder |            1
         Military, HS Grad or GED Holder |     9.833333
 Other Activities, HS Grad or GED Holder |     .8333333
4yr Grad this month, regardless of work/ |         1.25
           School Only, 4yr College Grad |            5
        Work in school, 4yr College Grad |          .75
        Part-time Work, 4yr College Grad |            0
        Full-time Work, 4yr College Grad |            0
              Military, 4yr College Grad |            8
      Other Activities, 4yr College Grad |            0
-------------------------------------------------------

. table activity, c(p5 othert       p25 othert       median othert       p75 ot
> hert       p95 othert      )

------------------------------------------------------------------------------
                                activity |  p5(othert) p25(othert) med(othert)
-----------------------------------------+------------------------------------
       School Only, no HS Diploma or GED |           0           0    .0833333
    Work in school, no HS Diploma or GED |           0           0           0
    Part-time Work, no HS Diploma or GED |           0    .0833333         .75
    Full-time Work, no HS Diploma or GED |           0    .3333333    1.083333
          Military, no HS Diploma or GED |           0    .3333333    .5833333
  Other Activities, no HS Diploma or GED |           0    .5833333        2.25
HS Grad this month, regardless of work/m |           0           0    .1666667
      School Only, HS Grad or GED Holder |           0    .0833333         .25
   Work in school, HS Grad or GED Holder |           0           0    .1666667
   Part-time Work, HS Grad or GED Holder |           0         .25         .75
   Full-time Work, HS Grad or GED Holder |           0    .1666667          .5
         Military, HS Grad or GED Holder |           0    .0833333         .25
 Other Activities, HS Grad or GED Holder |         .25    1.083333    2.583333
4yr Grad this month, regardless of work/ |           0           0    .1666667
           School Only, 4yr College Grad |           0         .25    .4166667
        Work in school, 4yr College Grad |           0    .0833333         .25
        Part-time Work, 4yr College Grad |           0    .1666667    .4166667
        Full-time Work, 4yr College Grad |           0    .0833333         .25
              Military, 4yr College Grad |           0           0    .3333333
      Other Activities, 4yr College Grad |    .1666667    .5833333    1.333333
------------------------------------------------------------------------------

------------------------------------------------------------------
                                activity | p75(othert) p95(othert)
-----------------------------------------+------------------------
       School Only, no HS Diploma or GED |    .1666667    .4166667
    Work in school, no HS Diploma or GED |    .1666667    .3333333
    Part-time Work, no HS Diploma or GED |    2.833333    7.083333
    Full-time Work, no HS Diploma or GED |    2.333333         5.5
          Military, no HS Diploma or GED |        1.75        1.75
  Other Activities, no HS Diploma or GED |    5.333333    11.16667
HS Grad this month, regardless of work/m |    .3333333    1.666667
      School Only, HS Grad or GED Holder |    .5833333    2.833333
   Work in school, HS Grad or GED Holder |    .4166667    1.916667
   Part-time Work, HS Grad or GED Holder |    2.083333    5.333333
   Full-time Work, HS Grad or GED Holder |    1.333333        3.75
         Military, HS Grad or GED Holder |    .6666667    1.416667
 Other Activities, HS Grad or GED Holder |           5    9.666667
4yr Grad this month, regardless of work/ |    .3333333        1.25
           School Only, 4yr College Grad |    .9166667    1.916667
        Work in school, 4yr College Grad |    .5833333         1.5
        Part-time Work, 4yr College Grad |    .9166667    2.583333
        Full-time Work, 4yr College Grad |    .5833333    1.583333
              Military, 4yr College Grad |    .9166667    1.666667
      Other Activities, 4yr College Grad |        2.75    5.083333
------------------------------------------------------------------

. 
. * table activity if inrange(activity,11,17), c(p5 anySchoolt   p25 anySchoolt
>    median anySchoolt   p75 anySchoolt   p95 anySchoolt  )
. * table activity if inrange(activity,11,17), c(p5 schoolOnlyt  p25 schoolOnly
> t  median schoolOnlyt  p75 schoolOnlyt  p95 schoolOnlyt )
. * table activity if inrange(activity,11,17), c(p5 workK12t     p25 workK12t  
>    median workK12t     p75 workK12t     p95 workK12t    )
. * table activity if inrange(activity,11,17), c(p5 workColleget p25 workColleg
> et median workColleget p75 workColleget p95 workColleget)
. * table activity if inrange(activity,11,17), c(p5 workPTonlyt  p25 workPTonly
> t  median workPTonlyt  p75 workPTonlyt  p95 workPTonlyt )
. * table activity if inrange(activity,11,17), c(p5 workFTonlyt  p25 workFTonly
> t  median workFTonlyt  p75 workFTonlyt  p95 workFTonlyt )
. * table activity if inrange(activity,11,17), c(p5 militaryt    p25 militaryt 
>    median militaryt    p75 militaryt    p95 militaryt   )
. * table activity if inrange(activity,11,17), c(p5 othert       p25 othert    
>    median othert       p75 othert       p95 othert      )
. 
. * table activity if inrange(activity,21,26), c(p5 anySchoolt   p25 anySchoolt
>    median anySchoolt   p75 anySchoolt   p95 anySchoolt  )
. * table activity if inrange(activity,21,26), c(p5 schoolOnlyt  p25 schoolOnly
> t  median schoolOnlyt  p75 schoolOnlyt  p95 schoolOnlyt )
. * table activity if inrange(activity,21,26), c(p5 workK12t     p25 workK12t  
>    median workK12t     p75 workK12t     p95 workK12t    )
. * table activity if inrange(activity,21,26), c(p5 workColleget p25 workColleg
> et median workColleget p75 workColleget p95 workColleget)
. * table activity if inrange(activity,21,26), c(p5 workPTonlyt  p25 workPTonly
> t  median workPTonlyt  p75 workPTonlyt  p95 workPTonlyt )
. * table activity if inrange(activity,21,26), c(p5 workFTonlyt  p25 workFTonly
> t  median workFTonlyt  p75 workFTonlyt  p95 workFTonlyt )
. * table activity if inrange(activity,21,26), c(p5 militaryt    p25 militaryt 
>    median militaryt    p75 militaryt    p95 militaryt   )
. * table activity if inrange(activity,21,26), c(p5 othert       p25 othert    
>    median othert       p75 othert       p95 othert      )
. 
. * Generate some bin variables based on schooling experience
. *  Could great as bin variables, and do i.anySchoolBin, but that's not how we
>  roll
. * gen   anySchoolt = schoolOnlyt==1 | workK12t==1 | workColleget==1 // in cas
> e it's not there
. * gen   anySchool1 = anySchoolt>=0 & anySchoolt<1
. * gen   anySchool2 = anySchoolt>=1 & anySchoolt<2
. * gen   anySchool3 = anySchoolt>=2 & anySchoolt<3
. * gen   anySchool4 = anySchoolt>=3 & anySchoolt<4
. * gen   anySchool5 = anySchoolt>=4 & anySchoolt<5
. * gen   anySchool6 = anySchoolt>=5 & anySchoolt<6
. * gen   anySchool7 = anySchoolt>=6 & anySchoolt<7
. * gen   anySchool8 = anySchoolt>=7 & anySchoolt<8
. * gen   anySchool9 = anySchoolt>=8 & anySchoolt<.
. 
. 
. 
. generat schoolOnlyBin = . 
(792,631 missing values generated)

. replace schoolOnlyBin = 1 if schoolOnlyt>=0   & schoolOnlyt<0.5
(198,172 real changes made)

. replace schoolOnlyBin = 2 if schoolOnlyt>=0.5 & schoolOnlyt<1
(140,910 real changes made)

. replace schoolOnlyBin = 3 if schoolOnlyt>=1   & schoolOnlyt<1.5
(128,486 real changes made)

. replace schoolOnlyBin = 4 if schoolOnlyt>=1.5 & schoolOnlyt<2
(110,346 real changes made)

. replace schoolOnlyBin = 5 if schoolOnlyt>=2   & schoolOnlyt<3
(123,435 real changes made)

. replace schoolOnlyBin = 6 if schoolOnlyt>=3   & schoolOnlyt<4
(45,021 real changes made)

. replace schoolOnlyBin = 7 if schoolOnlyt>=4   & schoolOnlyt<5
(23,056 real changes made)

. replace schoolOnlyBin = 8 if schoolOnlyt>=5   & schoolOnlyt<6
(13,284 real changes made)

. replace schoolOnlyBin = 9 if schoolOnlyt>=6   & schoolOnlyt<.
(9,921 real changes made)

. 
. generat workK12Bin = . 
(792,631 missing values generated)

. replace workK12Bin = 1 if workK12t>=0    & workK12t<0.20
(253,126 real changes made)

. replace workK12Bin = 2 if workK12t>=0.20 & workK12t<0.40
(62,696 real changes made)

. replace workK12Bin = 3 if workK12t>=0.40 & workK12t<0.60
(80,436 real changes made)

. replace workK12Bin = 4 if workK12t>=0.60 & workK12t<0.80
(49,077 real changes made)

. replace workK12Bin = 5 if workK12t>=0.80 & workK12t<1.00
(52,430 real changes made)

. replace workK12Bin = 6 if workK12t>=1.00 & workK12t<1.20
(62,907 real changes made)

. replace workK12Bin = 7 if workK12t>=1.20 & workK12t<1.40
(36,761 real changes made)

. replace workK12Bin = 8 if workK12t>=1.40 & workK12t<1.60
(62,474 real changes made)

. replace workK12Bin = 9 if workK12t>=1.60 & workK12t<.
(132,724 real changes made)

. 
. generat workCollegeBin = . 
(792,631 missing values generated)

. replace workCollegeBin = 1 if workColleget>=0   & workColleget<0.5
(522,152 real changes made)

. replace workCollegeBin = 2 if workColleget>=0.5 & workColleget<1.0
(55,570 real changes made)

. replace workCollegeBin = 3 if workColleget>=1.0 & workColleget<1.5
(40,030 real changes made)

. replace workCollegeBin = 4 if workColleget>=1.5 & workColleget<2.0
(32,398 real changes made)

. replace workCollegeBin = 5 if workColleget>=2.0 & workColleget<2.5
(28,823 real changes made)

. replace workCollegeBin = 6 if workColleget>=2.5 & workColleget<3.0
(22,850 real changes made)

. replace workCollegeBin = 7 if workColleget>=3.0 & workColleget<4.0
(39,708 real changes made)

. replace workCollegeBin = 8 if workColleget>=4.0 & workColleget<5.0
(25,786 real changes made)

. replace workCollegeBin = 9 if workColleget>=5.0 & workColleget<.
(25,314 real changes made)

. 
. generat workPTonlyBin = . 
(792,631 missing values generated)

. replace workPTonlyBin = 1 if workPTonlyt>=(0/3) & workPTonlyt<(1/3)
(297,436 real changes made)

. replace workPTonlyBin = 2 if workPTonlyt>=(1/3) & workPTonlyt<(2/3)
(157,548 real changes made)

. replace workPTonlyBin = 3 if workPTonlyt>=(2/3) & workPTonlyt<(3/3)
(88,997 real changes made)

. replace workPTonlyBin = 4 if workPTonlyt>=(3/3) & workPTonlyt<(4/3)
(64,305 real changes made)

. replace workPTonlyBin = 5 if workPTonlyt>=(4/3) & workPTonlyt<(5/3)
(54,375 real changes made)

. replace workPTonlyBin = 6 if workPTonlyt>=(5/3) & workPTonlyt<(6/3)
(25,110 real changes made)

. replace workPTonlyBin = 7 if workPTonlyt>=(6/3) & workPTonlyt<(7/3)
(28,299 real changes made)

. replace workPTonlyBin = 8 if workPTonlyt>=(7/3) & workPTonlyt<(8/3)
(14,414 real changes made)

. replace workPTonlyBin = 9 if workPTonlyt>=(8/3) & workPTonlyt<.
(62,147 real changes made)

. 
. generat workFTonlyBin = . 
(792,631 missing values generated)

. replace workFTonlyBin = 1 if workFTonlyt>=0 & workFTonlyt<1
(357,792 real changes made)

. replace workFTonlyBin = 2 if workFTonlyt>=1 & workFTonlyt<2
(84,634 real changes made)

. replace workFTonlyBin = 3 if workFTonlyt>=2 & workFTonlyt<3
(68,914 real changes made)

. replace workFTonlyBin = 4 if workFTonlyt>=3 & workFTonlyt<4
(55,719 real changes made)

. replace workFTonlyBin = 5 if workFTonlyt>=4 & workFTonlyt<5
(47,958 real changes made)

. replace workFTonlyBin = 6 if workFTonlyt>=5 & workFTonlyt<6
(41,314 real changes made)

. replace workFTonlyBin = 7 if workFTonlyt>=6 & workFTonlyt<7
(33,657 real changes made)

. replace workFTonlyBin = 8 if workFTonlyt>=7 & workFTonlyt<8
(28,399 real changes made)

. replace workFTonlyBin = 9 if workFTonlyt>=8 & workFTonlyt<.
(74,244 real changes made)

. 
. generat militaryBin = . 
(792,631 missing values generated)

. replace militaryBin = 1 if militaryt>=0   & militaryt<1.0
(748,162 real changes made)

. replace militaryBin = 2 if militaryt>=1.0 & militaryt<1.5
(5,900 real changes made)

. replace militaryBin = 3 if militaryt>=1.5 & militaryt<2.0
(4,744 real changes made)

. replace militaryBin = 4 if militaryt>=2.0 & militaryt<3.0
(9,341 real changes made)

. replace militaryBin = 5 if militaryt>=3.0 & militaryt<.
(24,484 real changes made)

. 
. generat otherBin = . 
(792,631 missing values generated)

. replace otherBin = 1 if othert>=0    & othert<0.25
(301,836 real changes made)

. replace otherBin = 2 if othert>=0.25 & othert<0.50
(118,604 real changes made)

. replace otherBin = 3 if othert>=0.50 & othert<1.00
(110,409 real changes made)

. replace otherBin = 4 if othert>=1.00 & othert<1.50
(62,861 real changes made)

. replace otherBin = 5 if othert>=1.50 & othert<2.00
(41,545 real changes made)

. replace otherBin = 6 if othert>=2.00 & othert<3.00
(54,610 real changes made)

. replace otherBin = 7 if othert>=3.00 & othert<4.00
(32,571 real changes made)

. replace otherBin = 8 if othert>=4.00 & othert<5.00
(20,861 real changes made)

. replace otherBin = 9 if othert>=5.00 & othert<.
(49,334 real changes made)

. 
. 
. foreach var in schoolOnly workK12 workCollege workPTonly workFTonly military 
> other {
  2.         qui tab `var'Bin, gen(`var')
  3. }

. 
. local Bvars  b4.schoolOnlyBin b3.workK12Bin b3.workCollegeBin b4.workPTonlyBi
> n b3.workFTonlyBin b3.militaryBin b4.otherBin

. local Bvars1 b4.schoolOnlyBin b3.workK12Bin                   b4.workPTonlyBi
> n b3.workFTonlyBin                b4.otherBin

. local Bvars2 b4.schoolOnlyBin b3.workK12Bin b3.workCollegeBin b4.workPTonlyBi
> n b3.workFTonlyBin b3.militaryBin b4.otherBin

. local Bvars3 b4.schoolOnlyBin b3.workK12Bin b3.workCollegeBin b4.workPTonlyBi
> n b3.workFTonlyBin b3.militaryBin b4.otherBin

. 
. local BvarsSum schoolOnly? workK12? workCollege? workPTonly? workFTonly? mili
> tary? other? 

. 
. * Constraints 
. constraint drop _all

. * do y97_constraints.do
. do y97_constraints_all_binned.do

. constraint  101 [2]7.workPTonlyBin   = [2]6.workPTonlyBin

. constraint  102 [2]8.workPTonlyBin   = [2]6.workPTonlyBin

. constraint  103 [2]9.workPTonlyBin   = [2]6.workPTonlyBin

. constraint  104 [2]7.workFTonlyBin   = [2]6.workFTonlyBin

. constraint  105 [2]8.workFTonlyBin   = [2]6.workFTonlyBin

. constraint  106 [2]9.workFTonlyBin   = [2]6.workFTonlyBin

. constraint  107 [2]9.otherBin        = [2]8.otherBin

. constraint  108 [3]7.workPTonlyBin   = [3]6.workPTonlyBin

. constraint  109 [3]8.workPTonlyBin   = [3]6.workPTonlyBin

. constraint  110 [3]9.workPTonlyBin   = [3]6.workPTonlyBin

. constraint  111 [3]7.workFTonlyBin   = [3]6.workFTonlyBin

. constraint  112 [3]8.workFTonlyBin   = [3]6.workFTonlyBin

. constraint  113 [3]9.workFTonlyBin   = [3]6.workFTonlyBin

. constraint  114 [4]7.workPTonlyBin   = [4]6.workPTonlyBin

. constraint  115 [4]8.workPTonlyBin   = [4]6.workPTonlyBin

. constraint  116 [4]9.workPTonlyBin   = [4]6.workPTonlyBin

. constraint  117 [4]7.workFTonlyBin   = [4]6.workFTonlyBin

. constraint  118 [4]8.workFTonlyBin   = [4]6.workFTonlyBin

. constraint  119 [4]9.workFTonlyBin   = [4]6.workFTonlyBin

. constraint  120 [5]1.schoolOnlyBin

. constraint  121 [5]2.schoolOnlyBin

. constraint  122 [5]3.schoolOnlyBin

. constraint  123 [5]4.schoolOnlyBin

. constraint  124 [5]5.schoolOnlyBin

. constraint  125 [5]6.schoolOnlyBin

. constraint  126 [5]7.schoolOnlyBin

. constraint  127 [5]8.schoolOnlyBin

. constraint  128 [5]1.workK12Bin

. constraint  129 [5]2.workK12Bin

. constraint  130 [5]3.workK12Bin

. constraint  131 [5]4.workK12Bin

. constraint  132 [5]5.workK12Bin

. constraint  133 [5]6.workK12Bin

. constraint  134 [5]7.workK12Bin

. constraint  135 [5]8.workK12Bin

. constraint  136 [5]9.workK12Bin

. constraint  137 [5]foreignBorn

. constraint  138 [5]empPct

. constraint  139 [5]incPerCapita

. constraint  140 [5]numBAzero

. constraint  141 [5]numBAperCapita

. constraint  142 [5]tuitionFlagship

. constraint  143 [5]schoolOnlyBlack

. constraint  144 [5]schoolOnlyHisp

. constraint  145 [5]workK12Black

. constraint  146 [5]workK12Hisp

. constraint  147 [5]workPTBlack

. constraint  148 [5]workPTHisp

. constraint  149 [5]workFTBlack

. constraint  150 [5]workFTHisp

. constraint  151 [5]otherBlack

. constraint  152 [5]otherHisp

. constraint  153 [5]hgcMoth

. constraint  154 [5]hgcMothSq

. constraint  155 [5]m_hgcMoth

. constraint  156 [5]hgcFath

. constraint  157 [5]hgcFathSq

. constraint  158 [5]m_hgcFath

. constraint  159 [5]famInc

. constraint  160 [5]famIncSq

. constraint  161 [5]m_famInc

. constraint  162 [5]femaleHeadHH14

. constraint  163 [5]liveWithMom14

. constraint  164 [5]1.workPTonlyBin

. constraint  165 [5]2.workPTonlyBin

. constraint  166 [5]3.workPTonlyBin

. constraint  167 [5]4.workPTonlyBin

. constraint  168 [5]5.workPTonlyBin

. constraint  169 [5]6.workPTonlyBin

. constraint  170 [5]7.workPTonlyBin

. constraint  171 [5]8.workPTonlyBin

. constraint  172 [5]9.workPTonlyBin

. constraint  173 [5]1.workFTonlyBin

. constraint  174 [5]2.workFTonlyBin

. constraint  175 [5]3.workFTonlyBin

. constraint  176 [5]4.workFTonlyBin

. constraint  177 [5]5.workFTonlyBin

. constraint  178 [5]6.workFTonlyBin

. constraint  179 [5]7.workFTonlyBin

. constraint  180 [5]8.workFTonlyBin

. constraint  181 [5]9.workFTonlyBin

. constraint  182 [5]1.otherBin

. constraint  183 [5]2.otherBin

. constraint  184 [5]3.otherBin

. constraint  185 [5]4.otherBin

. constraint  186 [5]5.otherBin

. constraint  187 [5]6.otherBin

. constraint  188 [5]7.otherBin

. constraint  189 [5]8.otherBin

. constraint  190 [5]9.otherBin

. constraint  191 [6]7.workPTonlyBin   = [6]6.workPTonlyBin

. constraint  192 [6]8.workPTonlyBin   = [6]6.workPTonlyBin

. constraint  193 [6]9.workPTonlyBin   = [6]6.workPTonlyBin

. constraint  194 [6]7.workFTonlyBin   = [6]6.workFTonlyBin

. constraint  195 [6]8.workFTonlyBin   = [6]6.workFTonlyBin

. constraint  196 [6]9.workFTonlyBin   = [6]6.workFTonlyBin

. constraint  197 [7]7.workPTonlyBin   = [7]6.workPTonlyBin

. constraint  198 [7]8.workPTonlyBin   = [7]6.workPTonlyBin

. constraint  199 [7]9.workPTonlyBin   = [7]6.workPTonlyBin

. constraint  200 [7]7.workFTonlyBin   = [7]6.workFTonlyBin

. constraint  201 [7]8.workFTonlyBin   = [7]6.workFTonlyBin

. constraint  202 [7]9.workFTonlyBin   = [7]6.workFTonlyBin

. 
. constraint  221 [15]9.workCollegeBin = [15]8.workCollegeBin

. constraint  222 [15]8.workPTonlyBin  = [15]7.workPTonlyBin

. constraint  223 [15]9.workPTonlyBin  = [15]7.workPTonlyBin

. constraint  224 [15]7.workFTonlyBin  = [15]6.workFTonlyBin

. constraint  225 [15]8.workFTonlyBin  = [15]6.workFTonlyBin

. constraint  226 [15]9.workFTonlyBin  = [15]6.workFTonlyBin

. constraint  227 [15]9.otherBin       = [15]8.otherBin

. constraint  228 [17]5.workFTonlyBin  = [17]4.workFTonlyBin

. constraint  229 [17]6.workFTonlyBin  = [17]4.workFTonlyBin

. constraint  230 [17]7.workFTonlyBin  = [17]4.workFTonlyBin

. constraint  231 [17]8.workFTonlyBin  = [17]4.workFTonlyBin

. constraint  232 [17]9.workFTonlyBin  = [17]4.workFTonlyBin

. constraint  233 [17]1.militaryBin

. constraint  234 [17]2.militaryBin

. constraint  235 [17]4.militaryBin

. constraint  236 [17]5.militaryBin

. constraint  237 [17]militaryBlack

. constraint  238 [17]militaryHisp

. constraint  239 [17]8.otherBin       = [17]7.otherBin

. constraint  240 [17]9.otherBin       = [17]7.otherBin

. 
. constraint  301 [22]militaryBlack

. constraint  302 [22]militaryHisp

. constraint  303 [22]6.workFTonlyBin  = [22]5.workFTonlyBin

. constraint  304 [22]7.workFTonlyBin  = [22]5.workFTonlyBin

. constraint  305 [22]8.workFTonlyBin  = [22]5.workFTonlyBin

. constraint  306 [22]9.workFTonlyBin  = [22]5.workFTonlyBin

. constraint  307 [22]1.militaryBin

. constraint  308 [22]2.militaryBin

. constraint  309 [22]4.militaryBin

. constraint  310 [22]5.militaryBin

. constraint  311 [22]7.otherBin  = [22]6.otherBin

. constraint  312 [22]8.otherBin  = [22]6.otherBin

. constraint  313 [22]9.otherBin  = [22]6.otherBin

. constraint  314 [23]militaryBlack

. constraint  315 [23]militaryHisp

. constraint  316 [23]8.workFTonlyBin  = [23]7.workFTonlyBin

. constraint  317 [23]9.workFTonlyBin  = [23]7.workFTonlyBin

. constraint  318 [23]1.militaryBin

. constraint  319 [23]2.militaryBin

. constraint  320 [23]4.militaryBin

. constraint  321 [23]5.militaryBin

. constraint  322 [23]6.otherBin  = [23]5.otherBin

. constraint  323 [23]7.otherBin  = [23]6.otherBin

. constraint  324 [23]8.otherBin  = [23]6.otherBin

. constraint  325 [23]9.otherBin  = [23]6.otherBin

. constraint  326 [24]militaryBlack

. constraint  327 [24]militaryHisp

. constraint  328 [24]6.workFTonlyBin  = [24]5.workFTonlyBin

. constraint  329 [24]7.workFTonlyBin  = [24]5.workFTonlyBin

. constraint  330 [24]8.workFTonlyBin  = [24]5.workFTonlyBin

. constraint  331 [24]9.workFTonlyBin  = [24]5.workFTonlyBin

. constraint  332 [24]1.militaryBin

. constraint  333 [24]2.militaryBin

. constraint  334 [24]4.militaryBin

. constraint  335 [24]5.militaryBin

. constraint  336 [24]7.otherBin  = [24]6.otherBin

. constraint  337 [24]8.otherBin  = [24]6.otherBin

. constraint  338 [24]9.otherBin  = [24]6.otherBin

. constraint  339 [25]1.schoolOnlyBin

. constraint  340 [25]2.schoolOnlyBin

. constraint  341 [25]3.schoolOnlyBin

. constraint  342 [25]4.schoolOnlyBin

. constraint  343 [25]5.schoolOnlyBin

. constraint  344 [25]6.schoolOnlyBin

. constraint  345 [25]7.schoolOnlyBin

. constraint  346 [25]8.schoolOnlyBin

. constraint  347 [25]9.schoolOnlyBin

. constraint  348 [25]1.workK12Bin

. constraint  349 [25]2.workK12Bin

. constraint  350 [25]3.workK12Bin

. constraint  351 [25]4.workK12Bin

. constraint  352 [25]5.workK12Bin

. constraint  353 [25]6.workK12Bin

. constraint  354 [25]7.workK12Bin

. constraint  355 [25]8.workK12Bin

. constraint  356 [25]9.workK12Bin

. constraint  357 [25]1.workCollegeBin

. constraint  358 [25]2.workCollegeBin

. constraint  359 [25]3.workCollegeBin

. constraint  360 [25]4.workCollegeBin

. constraint  361 [25]5.workCollegeBin

. constraint  362 [25]6.workCollegeBin

. constraint  363 [25]7.workCollegeBin

. constraint  364 [25]8.workCollegeBin

. constraint  365 [25]9.workCollegeBin

. constraint  366 [25]hispanic

. constraint  367 [25]foreignBorn

. constraint  368 [25]empPct

. constraint  369 [25]incPerCapita

. constraint  370 [25]numBAzero

. constraint  371 [25]numBAperCapita

. constraint  372 [25]tuitionFlagship

. constraint  373 [25]schoolOnlyBlack

. constraint  374 [25]schoolOnlyHisp

. constraint  375 [25]workK12Black

. constraint  376 [25]workK12Hisp

. constraint  377 [25]workCollegeBlack

. constraint  378 [25]workCollegeHisp

. constraint  379 [25]workPTBlack

. constraint  380 [25]workPTHisp

. constraint  381 [25]workFTBlack

. constraint  382 [25]workFTHisp

. constraint  383 [25]militaryBlack

. constraint  384 [25]militaryHisp

. constraint  385 [25]otherBlack

. constraint  386 [25]otherHisp

. constraint  387 [25]hgcMoth

. constraint  388 [25]hgcMothSq

. constraint  389 [25]m_hgcMoth

. constraint  390 [25]hgcFath

. constraint  391 [25]hgcFathSq

. constraint  392 [25]m_hgcFath

. constraint  393 [25]famInc

. constraint  394 [25]famIncSq

. constraint  395 [25]m_famInc

. constraint  396 [25]femaleHeadHH14

. constraint  397 [25]liveWithMom14

. constraint  398 [25]1.workPTonlyBin

. constraint  399 [25]2.workPTonlyBin

. constraint  400 [25]3.workPTonlyBin

. constraint  401 [25]4.workPTonlyBin

. constraint  402 [25]5.workPTonlyBin

. constraint  403 [25]6.workPTonlyBin

. constraint  404 [25]7.workPTonlyBin

. constraint  405 [25]8.workPTonlyBin

. constraint  406 [25]9.workPTonlyBin

. constraint  407 [25]1.workFTonlyBin

. constraint  408 [25]2.workFTonlyBin

. constraint  409 [25]3.workFTonlyBin

. constraint  410 [25]4.workFTonlyBin

. constraint  411 [25]5.workFTonlyBin

. constraint  412 [25]6.workFTonlyBin

. constraint  413 [25]7.workFTonlyBin

. constraint  414 [25]8.workFTonlyBin

. constraint  415 [25]9.workFTonlyBin

. constraint  416 [25]1.militaryBin

. constraint  417 [25]2.militaryBin

. constraint  418 [25]4.militaryBin

. constraint  419 [25]5.militaryBin

. constraint  420 [25]1.otherBin

. constraint  421 [25]2.otherBin

. constraint  422 [25]3.otherBin

. constraint  423 [25]4.otherBin

. constraint  424 [25]5.otherBin

. constraint  425 [25]6.otherBin

. constraint  426 [25]7.otherBin

. constraint  427 [25]8.otherBin

. constraint  428 [25]9.otherBin

. constraint  429 [26]militaryBlack

. constraint  430 [26]militaryHisp

. constraint  431 [26]6.workFTonlyBin  = [26]5.workFTonlyBin

. constraint  432 [26]7.workFTonlyBin  = [26]5.workFTonlyBin

. constraint  433 [26]8.workFTonlyBin  = [26]5.workFTonlyBin

. constraint  434 [26]9.workFTonlyBin  = [26]5.workFTonlyBin

. constraint  435 [26]1.militaryBin

. constraint  436 [26]2.militaryBin

. constraint  437 [26]4.militaryBin

. constraint  438 [26]5.militaryBin

. constraint  439 [26]7.otherBin       = [26]6.otherBin

. constraint  440 [26]8.otherBin       = [26]6.otherBin

. constraint  441 [26]9.otherBin       = [26]6.otherBin

. 
end of do-file

. label val activity .

. label val activity_simple .

. 
. *============================================================================
. * Summary statistics (for comparison with V++ data read-in)
. *============================================================================
. recode lnWage lnWageAlt lnWageNoSelf lnWageAltNoSelf lnWageJobMain  (-999=.)
(lnWage: 345373 changes made)
(lnWageAlt: 346086 changes made)
(lnWageNoSelf: 370517 changes made)
(lnWageAltNoSelf: 370537 changes made)
(lnWageJobMain: 763644 changes made)

. 
. sum lnWageNoSelf `Pvars97' `Mvars' `Svars' `Zvars' `Evars' `Fvars' `Cvars' `B
> vars' if inlist(activity,1,2,3,4,5,6,7,11,12,13,14,15,16,17,21,22,23,24,25,26
> ), sep(0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
lnWageNoSelf |    422,114    1.809259     .481873   .6934183   3.906742
       black |    792,631    .2623402    .4399069          0          1
    hispanic |    792,631    .2134095    .4097147          0          1
    born1980 |    792,631    .2004993    .4003743          0          1
    born1981 |    792,631    .2150547    .4108605          0          1
    born1982 |    792,631     .205995    .4044271          0          1
    born1983 |    792,631    .1968861    .3976458          0          1
 foreignBorn |    792,631    .0634608    .2437901          0          1
      empPct |    792,631    .8709134    .2322757   .3332505   2.593753
incPerCapita |    792,631    18.10652    5.368396   7.641173    65.0181
 schoolOnlyt |    792,631    1.465161    1.357304          0   14.16667
schoo~yBlack |    792,631    .4170476    .9823535          0   14.16667
school~yHisp |    792,631    .3081014    .8200642          0   9.916667
schoolOnlySq |    792,631    .3988967    .7914101          0   20.06944
    workK12t |    792,631    .7985354    .7563631          0   7.666667
workK12Black |    792,631     .165243    .4521391          0        3.5
 workK12Hisp |    792,631    .1498218    .4490064          0   4.416667
   workK12Sq |    792,631    .1209743    .1867418          0   5.877778
workColleget |    792,631    .8753246    1.557689          0   14.08333
workC~eBlack |    792,631    .1472362    .6971287          0   10.33333
workCo~eHisp |    792,631    .1711126    .7847131          0      11.75
workColleg~q |    792,631    .3192585    .9048724          0   19.83403
 workPTonlyt |    792,631    .8966078    1.163036          0         16
 workPTBlack |    792,631    .2559408    .7605946          0   11.16667
  workPTHisp |    792,631    .1825196    .6387278          0         16
    workPTSq |    792,631    .2156558    .6644892          0       25.6
 workFTonlyt |    792,631    2.727738    3.263891          0   17.83333
 workFTBlack |    792,631    .5923832     1.77675          0      16.75
  workFTHisp |    792,631    .6364777    1.991799          0      17.75
    workFTSq |    792,631    1.809353     3.37724          0   31.80278
   militaryt |    792,631     .220586    1.048595          0   16.08333
militaryBl~k |    792,631    .0486372    .5062695          0   16.08333
militaryHisp |    792,631    .0512857    .5322138          0   15.41667
  militarySq |    792,631    .1148209    .8077477          0   25.86736
      othert |    792,631    1.253436    2.061642          0   18.91667
  otherBlack |    792,631    .5497542    1.714847          0   18.91667
   otherHisp |    792,631    .2639257    .9865927          0         17
     otherSq |    792,631    .5821465    1.926186          0   35.78403
     hgcMoth |    792,631    11.55153    4.318641          0         20
   hgcMothSq |    792,631    15.20884    8.059775          0         40
   m_hgcMoth |    792,631    .0754916    .2641831          0          1
     hgcFath |    792,631    10.02113    5.815472          0         20
   hgcFathSq |    792,631    13.42428    9.889296          0         40
   m_hgcFath |    792,631    .2013724    .4010259          0          1
      famInc |    792,631     2.19934    2.644063  -3.065647   15.70899
    famIncSq |    792,631    1.182816    3.237418          0   24.67723
    m_famInc |    792,631    .2572824    .4371366          0          1
femaleHea~14 |    792,631     .273228    .4456172          0          1
liveWithM~14 |    792,631     .884819    .3192404          0          1
   numBAzero |    792,631    .1728307    .3781011          0          1
numBAperCa~a |    792,631    1.756087    4.285653          0   56.60912
tuitionFla~p |    792,631    6.712258    2.164297   2.003683   12.12082
             |
schoolOnly~n |
          1  |    792,631     .250018    .4330234          0          1
          2  |    792,631     .177775    .3823235          0          1
          3  |    792,631    .1621006    .3685433          0          1
          5  |    792,631    .1557282    .3625977          0          1
          6  |    792,631    .0567994    .2314591          0          1
          7  |    792,631    .0290879    .1680532          0          1
          8  |    792,631    .0167594    .1283687          0          1
          9  |    792,631    .0125165    .1111751          0          1
             |
  workK12Bin |
          1  |    792,631    .3193491    .4662248          0          1
          2  |    792,631    .0790986    .2698928          0          1
          4  |    792,631    .0619166    .2410041          0          1
          5  |    792,631    .0661468    .2485387          0          1
          6  |    792,631    .0793648    .2703075          0          1
          7  |    792,631    .0463785    .2103035          0          1
          8  |    792,631    .0788185    .2694555          0          1
          9  |    792,631    .1674474    .3733751          0          1
             |
workColleg~n |
          1  |    792,631     .658758    .4741268          0          1
          2  |    792,631    .0701083    .2553296          0          1
          4  |    792,631     .040874    .1979984          0          1
          5  |    792,631    .0363637    .1871936          0          1
          6  |    792,631     .028828    .1673231          0          1
          7  |    792,631    .0500965    .2181441          0          1
          8  |    792,631    .0325322    .1774087          0          1
          9  |    792,631    .0319367    .1758316          0          1
             |
workPTonly~n |
          1  |    792,631    .3752515    .4841881          0          1
          2  |    792,631    .1987659    .3990717          0          1
          3  |    792,631    .1122805    .3157114          0          1
          5  |    792,631    .0686006     .252774          0          1
          6  |    792,631    .0316793     .175145          0          1
          7  |    792,631    .0357026    .1855478          0          1
          8  |    792,631     .018185    .1336201          0          1
          9  |    792,631     .078406    .2688095          0          1
             |
workFTonly~n |
          1  |    792,631    .4513979    .4976325          0          1
          2  |    792,631     .106776    .3088285          0          1
          4  |    792,631    .0702963    .2556458          0          1
          5  |    792,631    .0605048    .2384199          0          1
          6  |    792,631    .0521226    .2222744          0          1
          7  |    792,631    .0424624    .2016417          0          1
          8  |    792,631    .0358288    .1858632          0          1
          9  |    792,631    .0936678    .2913662          0          1
             |
 militaryBin |
          1  |    792,631     .943897    .2301207          0          1
          2  |    792,631    .0074436    .0859544          0          1
          4  |    792,631    .0117848    .1079163          0          1
          5  |    792,631    .0308895    .1730185          0          1
             |
    otherBin |
          1  |    792,631    .3808027    .4855845          0          1
          2  |    792,631    .1496333    .3567118          0          1
          3  |    792,631    .1392943    .3462536          0          1
          5  |    792,631     .052414    .2228607          0          1
          6  |    792,631    .0688971    .2532793          0          1
          7  |    792,631    .0410923    .1985037          0          1
          8  |    792,631    .0263187    .1600813          0          1
          9  |    792,631    .0622408    .2415926          0          1

. 
. 
. *============================================================================
. * Logits
. *============================================================================
. mlogit  activity        `Pvars97' `Mvars' `Svars1' `Zvars1' `Evars1' `Fvars' 
> `Cvars' `Bvars1' if inrange(activity, 1, 7), base( 1) difficult constraints(1
> 01/202) vce(cluster id)

Iteration 0:   log pseudolikelihood = -362349.88  
Iteration 1:   log pseudolikelihood = -246240.21  
Iteration 2:   log pseudolikelihood = -235217.42  
Iteration 3:   log pseudolikelihood = -231784.98  
Iteration 4:   log pseudolikelihood =  -231130.9  
Iteration 5:   log pseudolikelihood = -230884.65  
Iteration 6:   log pseudolikelihood = -230855.71  
Iteration 7:   log pseudolikelihood = -230855.46  
Iteration 8:   log pseudolikelihood = -230855.45  

Multinomial logistic regression                 Number of obs     =    221,702
                                                Wald chi2(333)    =   68653.87
Log pseudolikelihood = -230855.45               Prob > chi2       =     0.0000

 ( 1)  - [2]6.workPTonlyBin + [2]7.workPTonlyBin = 0
 ( 2)  - [2]6.workPTonlyBin + [2]8.workPTonlyBin = 0
 ( 3)  - [2]6.workPTonlyBin + [2]9.workPTonlyBin = 0
 ( 4)  - [2]6.workFTonlyBin + [2]7.workFTonlyBin = 0
 ( 5)  - [2]6.workFTonlyBin + [2]8.workFTonlyBin = 0
 ( 6)  - [2]6.workFTonlyBin + [2]9.workFTonlyBin = 0
 ( 7)  - [2]8.otherBin + [2]9.otherBin = 0
 ( 8)  - [3]6.workPTonlyBin + [3]7.workPTonlyBin = 0
 ( 9)  - [3]6.workPTonlyBin + [3]8.workPTonlyBin = 0
 (10)  - [3]6.workPTonlyBin + [3]9.workPTonlyBin = 0
 (11)  - [3]6.workFTonlyBin + [3]7.workFTonlyBin = 0
 (12)  - [3]6.workFTonlyBin + [3]8.workFTonlyBin = 0
 (13)  - [3]6.workFTonlyBin + [3]9.workFTonlyBin = 0
 (14)  - [4]6.workPTonlyBin + [4]7.workPTonlyBin = 0
 (15)  - [4]6.workPTonlyBin + [4]8.workPTonlyBin = 0
 (16)  - [4]6.workPTonlyBin + [4]9.workPTonlyBin = 0
 (17)  - [4]6.workFTonlyBin + [4]7.workFTonlyBin = 0
 (18)  - [4]6.workFTonlyBin + [4]8.workFTonlyBin = 0
 (19)  - [4]6.workFTonlyBin + [4]9.workFTonlyBin = 0
 (20)  [5]1o.schoolOnlyBin = 0
 (21)  [5]2o.schoolOnlyBin = 0
 (22)  [5]3o.schoolOnlyBin = 0
 (23)  [5]5o.schoolOnlyBin = 0
 (24)  [5]6o.schoolOnlyBin = 0
 (25)  [5]7o.schoolOnlyBin = 0
 (26)  [5]8o.schoolOnlyBin = 0
 (27)  [5]1o.workK12Bin = 0
 (28)  [5]2o.workK12Bin = 0
 (29)  [5]4o.workK12Bin = 0
 (30)  [5]5o.workK12Bin = 0
 (31)  [5]6o.workK12Bin = 0
 (32)  [5]7o.workK12Bin = 0
 (33)  [5]8o.workK12Bin = 0
 (34)  [5]9o.workK12Bin = 0
 (35)  [5]o.foreignBorn = 0
 (36)  [5]o.empPct = 0
 (37)  [5]o.incPerCapita = 0
 (38)  [5]o.numBAzero = 0
 (39)  [5]o.numBAperCapita = 0
 (40)  [5]o.tuitionFlagship = 0
 (41)  [5]o.schoolOnlyBlack = 0
 (42)  [5]o.schoolOnlyHisp = 0
 (43)  [5]o.workK12Black = 0
 (44)  [5]o.workK12Hisp = 0
 (45)  [5]o.workPTBlack = 0
 (46)  [5]o.workPTHisp = 0
 (47)  [5]o.workFTBlack = 0
 (48)  [5]o.workFTHisp = 0
 (49)  [5]o.otherBlack = 0
 (50)  [5]o.otherHisp = 0
 (51)  [5]o.hgcMoth = 0
 (52)  [5]o.hgcMothSq = 0
 (53)  [5]o.m_hgcMoth = 0
 (54)  [5]o.hgcFath = 0
 (55)  [5]o.hgcFathSq = 0
 (56)  [5]o.m_hgcFath = 0
 (57)  [5]o.famInc = 0
 (58)  [5]o.famIncSq = 0
 (59)  [5]o.m_famInc = 0
 (60)  [5]o.femaleHeadHH14 = 0
 (61)  [5]o.liveWithMom14 = 0
 (62)  [5]1o.workPTonlyBin = 0
 (63)  [5]2o.workPTonlyBin = 0
 (64)  [5]3o.workPTonlyBin = 0
 (65)  [5]5o.workPTonlyBin = 0
 (66)  [5]6o.workPTonlyBin = 0
 (67)  [5]7o.workPTonlyBin = 0
 (68)  [5]8o.workPTonlyBin = 0
 (69)  [5]9o.workPTonlyBin = 0
 (70)  [5]1o.workFTonlyBin = 0
 (71)  [5]2o.workFTonlyBin = 0
 (72)  [5]4o.workFTonlyBin = 0
 (73)  [5]5o.workFTonlyBin = 0
 (74)  [5]6o.workFTonlyBin = 0
 (75)  [5]7o.workFTonlyBin = 0
 (76)  [5]8o.workFTonlyBin = 0
 (77)  [5]9o.workFTonlyBin = 0
 (78)  [5]1o.otherBin = 0
 (79)  [5]2o.otherBin = 0
 (80)  [5]3o.otherBin = 0
 (81)  [5]5o.otherBin = 0
 (82)  [5]6o.otherBin = 0
 (83)  [5]7o.otherBin = 0
 (84)  [5]8o.otherBin = 0
 (85)  [5]9o.otherBin = 0
 (86)  - [6]6.workPTonlyBin + [6]7.workPTonlyBin = 0
 (87)  - [6]6.workPTonlyBin + [6]8.workPTonlyBin = 0
 (88)  - [6]6.workPTonlyBin + [6]9.workPTonlyBin = 0
 (89)  - [6]6.workFTonlyBin + [6]7.workFTonlyBin = 0
 (90)  - [6]6.workFTonlyBin + [6]8.workFTonlyBin = 0
 (91)  - [6]6.workFTonlyBin + [6]9.workFTonlyBin = 0
 (92)  - [7]6.workPTonlyBin + [7]7.workPTonlyBin = 0
 (93)  - [7]6.workPTonlyBin + [7]8.workPTonlyBin = 0
 (94)  - [7]6.workPTonlyBin + [7]9.workPTonlyBin = 0
 (95)  - [7]6.workFTonlyBin + [7]7.workFTonlyBin = 0
 (96)  - [7]6.workFTonlyBin + [7]8.workFTonlyBin = 0
 (97)  - [7]6.workFTonlyBin + [7]9.workFTonlyBin = 0
                                 (Std. Err. adjusted for 4,430 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    activity |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |  (base outcome)
-------------+----------------------------------------------------------------
2            |
       black |  -.4505026     .07143    -6.31   0.000    -.5905028   -.3105025
    hispanic |  -.5034463   .0716977    -7.02   0.000    -.6439711   -.3629214
    born1980 |   .0425832   .0472272     0.90   0.367    -.0499805    .1351469
    born1981 |   .1021297   .0465481     2.19   0.028     .0108971    .1933622
    born1982 |   .1762955    .046724     3.77   0.000     .0847182    .2678727
    born1983 |   .1006056   .0468994     2.15   0.032     .0086844    .1925268
 foreignBorn |   .0302146   .0571445     0.53   0.597    -.0817866    .1422158
      empPct |   .2555158   .0807317     3.17   0.002     .0972846    .4137469
incPerCapita |  -.0037226   .0042752    -0.87   0.384    -.0121019    .0046568
schoo~yBlack |  -.0526981   .0657885    -0.80   0.423    -.1816412    .0762449
school~yHisp |   .1399965   .0720338     1.94   0.052    -.0011871    .2811801
workK12Black |    .174337   .1173134     1.49   0.137     -.055593    .4042669
 workK12Hisp |   .0546557   .1197402     0.46   0.648    -.1800308    .2893421
 workPTBlack |    .655907   .4278968     1.53   0.125    -.1827553    1.494569
  workPTHisp |   1.841183   .4032818     4.57   0.000     1.050765      2.6316
 workFTBlack |  -1.216129    .484642    -2.51   0.012     -2.16601   -.2662479
  workFTHisp |   1.433035   .8887026     1.61   0.107    -.3087896     3.17486
  otherBlack |   .1155345    .135729     0.85   0.395    -.1504894    .3815583
   otherHisp |  -.0301255   .1568748    -0.19   0.848    -.3375944    .2773434
     hgcMoth |   .0263395   .0275798     0.96   0.340    -.0277159     .080395
   hgcMothSq |   -.013869   .0112878    -1.23   0.219    -.0359928    .0082548
   m_hgcMoth |     .06711   .1778235     0.38   0.706    -.2814178    .4156377
     hgcFath |   .0757146   .0258248     2.93   0.003     .0250989    .1263303
   hgcFathSq |  -.0282423   .0104307    -2.71   0.007     -.048686   -.0077986
   m_hgcFath |   .4696765   .1627286     2.89   0.004     .1507343    .7886187
      famInc |   .0234011   .0166792     1.40   0.161    -.0092896    .0560917
    famIncSq |  -.0256314   .0112165    -2.29   0.022    -.0476154   -.0036475
    m_famInc |  -.0138055   .0477607    -0.29   0.773    -.1074147    .0798036
femaleHea~14 |   -.032706   .0378693    -0.86   0.388    -.1069283    .0415164
liveWithM~14 |   .1397096   .0517044     2.70   0.007     .0383709    .2410484
   numBAzero |  -.0210413   .0453229    -0.46   0.642    -.1098724    .0677899
numBAperCa~a |  -.0097832   .0051587    -1.90   0.058     -.019894    .0003276
tuitionFla~p |   .0011799   .0073395     0.16   0.872    -.0132052    .0155651
             |
schoolOnly~n |
          1  |   1.039477   .0797792    13.03   0.000     .8831124    1.195841
          2  |   .2849299    .077145     3.69   0.000     .1337285    .4361313
          3  |  -.0395715   .0772602    -0.51   0.609    -.1909987    .1118556
          5  |  -.2794975   .1244248    -2.25   0.025    -.5233657   -.0356294
          6  |  -.4062538   .3606043    -1.13   0.260    -1.113025    .3005176
          7  |  -1.315351   .7741894    -1.70   0.089    -2.832735    .2020322
          8  |  -1.716376   1.081949    -1.59   0.113    -3.836958    .4042055
             |
  workK12Bin |
          1  |  -2.200345   .0585251   -37.60   0.000    -2.315052   -2.085638
          2  |  -.4232839   .0679409    -6.23   0.000    -.5564455   -.2901222
          4  |   .2283116   .0925787     2.47   0.014     .0468608    .4097625
          5  |   .2814669   .0964725     2.92   0.004     .0923844    .4705495
          6  |    .441197    .100618     4.38   0.000     .2439892    .6384047
          7  |   .6804358   .1392505     4.89   0.000     .4075099    .9533617
          8  |   .6881291   .1386855     4.96   0.000     .4163104    .9599477
          9  |   .5846665   .1506015     3.88   0.000      .289493      .87984
             |
workPTonly~n |
          1  |   .3196963   .3812921     0.84   0.402    -.4276225    1.067015
          2  |   .5704873   .3594861     1.59   0.113    -.1340924    1.275067
          3  |  -.4177795   .6025825    -0.69   0.488    -1.598819    .7632605
          5  |   -.952269   1.036206    -0.92   0.358    -2.983195    1.078657
          6  |   .8864454   .8493988     1.04   0.297    -.7783456    2.551236
          7  |   .8864454   .8493988     1.04   0.297    -.7783456    2.551236
          8  |   .8864454   .8493988     1.04   0.297    -.7783456    2.551236
          9  |   .8864454   .8493988     1.04   0.297    -.7783456    2.551236
             |
workFTonly~n |
          1  |   .4047421   .9023351     0.45   0.654    -1.363802    2.173286
          2  |  -.4529111   1.210305    -0.37   0.708    -2.825066    1.919244
          4  |  -.1433662   1.092877    -0.13   0.896    -2.285365    1.998633
          5  |   2.835044    1.72525     1.64   0.100    -.5463842    6.216473
          6  |   2.152791   2.394644     0.90   0.369    -2.540625    6.846206
          7  |   2.152791   2.394644     0.90   0.369    -2.540625    6.846206
          8  |   2.152791   2.394644     0.90   0.369    -2.540625    6.846206
          9  |   2.152791   2.394644     0.90   0.369    -2.540625    6.846206
             |
    otherBin |
          1  |  -.4836566   .2860133    -1.69   0.091    -1.044232    .0769192
          2  |  -.5266696    .284851    -1.85   0.064    -1.084967     .031628
          3  |  -.4634898   .2904568    -1.60   0.111    -1.032775     .105795
          5  |  -1.080328   .7534646    -1.43   0.152    -2.557091    .3964356
          6  |   .7581496   1.061575     0.71   0.475      -1.3225    2.838799
          7  |   .0656072    .854419     0.08   0.939    -1.609023    1.740238
          8  |  -1.297549    .929077    -1.40   0.163    -3.118507    .5234086
          9  |  -1.297549    .929077    -1.40   0.163    -3.118507    .5234086
             |
       _cons |  -.8071047   .9921246    -0.81   0.416    -2.751633    1.137424
-------------+----------------------------------------------------------------
3            |
       black |  -.3725914   .1161591    -3.21   0.001    -.6002591   -.1449237
    hispanic |  -.5629221   .1057768    -5.32   0.000    -.7702407   -.3556035
    born1980 |   .1216062   .0636408     1.91   0.056    -.0031275    .2463398
    born1981 |   .0898891   .0645184     1.39   0.164    -.0365647    .2163429
    born1982 |    .067757   .0625058     1.08   0.278    -.0547522    .1902662
    born1983 |   .0716368   .0650343     1.10   0.271    -.0558281    .1991017
 foreignBorn |  -.1451419    .078235    -1.86   0.064    -.2984796    .0081959
      empPct |   .4698656    .110319     4.26   0.000     .2536444    .6860868
incPerCapita |  -.0180281   .0055576    -3.24   0.001    -.0289207   -.0071355
schoo~yBlack |  -.1694998   .0929066    -1.82   0.068    -.3515934    .0125938
school~yHisp |   .0607788   .0879045     0.69   0.489    -.1115109    .2330685
workK12Black |  -.1431786   .1828635    -0.78   0.434    -.5015846    .2152274
 workK12Hisp |  -.0341389   .1357567    -0.25   0.801     -.300217    .2319393
 workPTBlack |   .7868487   .4480482     1.76   0.079    -.0913097    1.665007
  workPTHisp |   1.416154   .4369001     3.24   0.001     .5598457    2.272463
 workFTBlack |  -.2180815   .3576781    -0.61   0.542    -.9191178    .4829547
  workFTHisp |   2.410782   .6797556     3.55   0.000     1.078486    3.743079
  otherBlack |   .0844521   .1058092     0.80   0.425    -.1229302    .2918345
   otherHisp |  -.0129673   .1208721    -0.11   0.915    -.2498722    .2239375
     hgcMoth |   .0371826     .03677     1.01   0.312    -.0348852    .1092505
   hgcMothSq |  -.0273892    .014915    -1.84   0.066     -.056622    .0018435
   m_hgcMoth |   .0205397   .2371786     0.09   0.931    -.4443218    .4854012
     hgcFath |     .02881   .0334719     0.86   0.389    -.0367937    .0944138
   hgcFathSq |  -.0121835   .0129863    -0.94   0.348    -.0376362    .0132692
   m_hgcFath |   .2004471   .2138441     0.94   0.349    -.2186796    .6195738
      famInc |  -.0638533   .0230299    -2.77   0.006    -.1089911   -.0187154
    famIncSq |   .0270008   .0145129     1.86   0.063     -.001444    .0554456
    m_famInc |  -.1860514   .0657337    -2.83   0.005    -.3148871   -.0572156
femaleHea~14 |   .0302019   .0516779     0.58   0.559    -.0710849    .1314886
liveWithM~14 |   .0874388   .0680054     1.29   0.199    -.0458492    .2207269
   numBAzero |   .0150458   .0586053     0.26   0.797    -.0998184      .12991
numBAperCa~a |  -.0188815    .005468    -3.45   0.001    -.0295985   -.0081645
tuitionFla~p |  -.0001114   .0098997    -0.01   0.991    -.0195145    .0192916
             |
schoolOnly~n |
          1  |   .9516479   .1022223     9.31   0.000      .751296       1.152
          2  |   .4411392   .0966739     4.56   0.000     .2516618    .6306167
          3  |   .0996359   .0929393     1.07   0.284    -.0825218    .2817936
          5  |   .0108034    .141311     0.08   0.939    -.2661611     .287768
          6  |  -.4459563   .3175629    -1.40   0.160    -1.068368    .1764555
          7  |   .4820193   .5862948     0.82   0.411    -.6670974    1.631136
          8  |  -.6906463   .5969785    -1.16   0.247    -1.860703    .4794101
             |
  workK12Bin |
          1  |  -1.076987    .079224   -13.59   0.000    -1.232263   -.9217105
          2  |   -.250696   .0907642    -2.76   0.006    -.4285906   -.0728014
          4  |   .2016478   .1243462     1.62   0.105    -.0420662    .4453619
          5  |   .5422211   .1156476     4.69   0.000      .315556    .7688863
          6  |   .3179324   .1243435     2.56   0.011     .0742236    .5616411
          7  |   .3051767   .1802413     1.69   0.090    -.0480897    .6584432
          8  |   .1978353   .1833682     1.08   0.281    -.1615597    .5572303
          9  |   .0816017   .2060174     0.40   0.692     -.322185    .4853883
             |
workPTonly~n |
          1  |  -3.287479   .5850534    -5.62   0.000    -4.434163   -2.140796
          2  |  -1.923814   .5731017    -3.36   0.001    -3.047072    -.800555
          3  |  -1.334593   .7673741    -1.74   0.082    -2.838619    .1694325
          5  |  -1.797247    1.12114    -1.60   0.109    -3.994641    .4001478
          6  |  -.4065954   .8993839    -0.45   0.651    -2.169355    1.356165
          7  |  -.4065954   .8993839    -0.45   0.651    -2.169355    1.356165
          8  |  -.4065954   .8993839    -0.45   0.651    -2.169355    1.356165
          9  |  -.4065954   .8993839    -0.45   0.651    -2.169355    1.356165
             |
workFTonly~n |
          1  |  -1.443428   .7849411    -1.84   0.066    -2.981885     .095028
          2  |  -.0281437   1.156295    -0.02   0.981     -2.29444    2.238152
          4  |    1.41495   1.431791     0.99   0.323    -1.391309    4.221208
          5  |   2.523486   1.377495     1.83   0.067    -.1763546    5.223328
          6  |   3.459651   2.079157     1.66   0.096    -.6154223    7.534725
          7  |   3.459651   2.079157     1.66   0.096    -.6154223    7.534725
          8  |   3.459651   2.079157     1.66   0.096    -.6154223    7.534725
          9  |   3.459651   2.079157     1.66   0.096    -.6154223    7.534725
             |
    otherBin |
          1  |  -3.177349   .2266182   -14.02   0.000    -3.621513   -2.733186
          2  |  -2.724584   .2343159   -11.63   0.000    -3.183835   -2.265334
          3  |  -1.625517   .2389041    -6.80   0.000     -2.09376   -1.157273
          5  |  -.1172151   .5963016    -0.20   0.844    -1.285945    1.051515
          6  |   1.926562   .5899344     3.27   0.001     .7703114    3.082812
          7  |   .5260681    .625565     0.84   0.400    -.7000168    1.752153
          8  |   .2953756   .9354148     0.32   0.752    -1.538004    2.128755
          9  |   1.315872   .7865462     1.67   0.094    -.2257306    2.857474
             |
       _cons |   5.818329   .9177582     6.34   0.000     4.019556    7.617102
-------------+----------------------------------------------------------------
4            |
       black |  -.6799938   .1530702    -4.44   0.000    -.9800058   -.3799818
    hispanic |  -.3026633   .1133356    -2.67   0.008    -.5247971   -.0805296
    born1980 |   .1706598   .0799883     2.13   0.033     .0138857     .327434
    born1981 |    .100997   .0840824     1.20   0.230    -.0638015    .2657956
    born1982 |   .1683862   .0777686     2.17   0.030     .0159626    .3208099
    born1983 |   .1716419   .0820971     2.09   0.037     .0107345    .3325493
 foreignBorn |  -.0533442   .0965563    -0.55   0.581     -.242591    .1359027
      empPct |   .3300416    .145545     2.27   0.023     .0447786    .6153046
incPerCapita |  -.0136426   .0072618    -1.88   0.060    -.0278755    .0005902
schoo~yBlack |  -.1048022   .1157668    -0.91   0.365    -.3317009    .1220965
school~yHisp |  -.0335992   .1054964    -0.32   0.750    -.2403683    .1731698
workK12Black |  -.1951388   .2126613    -0.92   0.359    -.6119473    .2216697
 workK12Hisp |  -.1483586   .1451277    -1.02   0.307    -.4328036    .1360864
 workPTBlack |   .5344805   .4539253     1.18   0.239    -.3551967    1.424158
  workPTHisp |   1.165876     .44035     2.65   0.008     .3028055    2.028946
 workFTBlack |  -.0777938   .3535967    -0.22   0.826    -.7708307     .615243
  workFTHisp |   2.404286   .6815939     3.53   0.000     1.068387    3.740186
  otherBlack |   .1620099   .1048856     1.54   0.122     -.043562    .3675819
   otherHisp |    .052019    .121687     0.43   0.669    -.1864831    .2905212
     hgcMoth |   .0978177   .0496604     1.97   0.049      .000485    .1951504
   hgcMothSq |  -.0669444   .0228214    -2.93   0.003    -.1116736   -.0222152
   m_hgcMoth |   .2066714   .2806458     0.74   0.461    -.3433843    .7567271
     hgcFath |   .0122202   .0467202     0.26   0.794    -.0793498    .1037901
   hgcFathSq |  -.0227695   .0213727    -1.07   0.287    -.0646593    .0191202
   m_hgcFath |   .0066609   .2603317     0.03   0.980    -.5035798    .5169016
      famInc |  -.0614238   .0329947    -1.86   0.063    -.1260922    .0032447
    famIncSq |   .0240984   .0247605     0.97   0.330    -.0244312    .0726281
    m_famInc |  -.2302532   .0818486    -2.81   0.005    -.3906735    -.069833
femaleHea~14 |   .1218801   .0643401     1.89   0.058    -.0042242    .2479843
liveWithM~14 |   -.123119   .0904893    -1.36   0.174    -.3004748    .0542368
   numBAzero |  -.0484624   .0746876    -0.65   0.516    -.1948474    .0979226
numBAperCa~a |  -.0087026   .0075598    -1.15   0.250    -.0235197    .0061144
tuitionFla~p |   -.035662   .0135729    -2.63   0.009    -.0622643   -.0090597
             |
schoolOnly~n |
          1  |   .6838619   .1414613     4.83   0.000     .4066029    .9611209
          2  |   .2392028   .1287975     1.86   0.063    -.0132356    .4916413
          3  |  -.0560841   .1206729    -0.46   0.642    -.2925987    .1804305
          5  |  -.2425223   .1544209    -1.57   0.116    -.5451816     .060137
          6  |  -.6773295   .3441201    -1.97   0.049    -1.351792   -.0028665
          7  |  -.8000413   .6779655    -1.18   0.238    -2.128829    .5287466
          8  |  -2.756633   .6975171    -3.95   0.000    -4.123741   -1.389525
             |
  workK12Bin |
          1  |  -.9168261    .097313    -9.42   0.000    -1.107556   -.7260961
          2  |  -.2614354   .1146641    -2.28   0.023     -.486173   -.0366979
          4  |   .1732819    .144694     1.20   0.231    -.1103132    .4568769
          5  |    .716525   .1477972     4.85   0.000     .4268478    1.006202
          6  |   .4890412   .1544892     3.17   0.002      .186248    .7918344
          7  |   .5929413   .2105077     2.82   0.005     .1803538    1.005529
          8  |   .4339838   .2014168     2.15   0.031     .0392141    .8287534
          9  |   .4502519   .2459981     1.83   0.067    -.0318955    .9323992
             |
workPTonly~n |
          1  |  -2.513152   .5964831    -4.21   0.000    -3.682237   -1.344067
          2  |  -1.439721   .5821238    -2.47   0.013    -2.580663    -.298779
          3  |   -1.16742   .7836938    -1.49   0.136    -2.703431    .3685918
          5  |    -2.1036   1.142183    -1.84   0.066    -4.342238    .1350367
          6  |  -1.120045   .8958411    -1.25   0.211    -2.875862    .6357708
          7  |  -1.120045   .8958411    -1.25   0.211    -2.875862    .6357708
          8  |  -1.120045   .8958411    -1.25   0.211    -2.875862    .6357708
          9  |  -1.120045   .8958411    -1.25   0.211    -2.875862    .6357708
             |
workFTonly~n |
          1  |  -3.416038   .7896814    -4.33   0.000    -4.963785   -1.868291
          2  |  -.3175049   1.165825    -0.27   0.785     -2.60248    1.967471
          4  |   1.814423   1.452658     1.25   0.212    -1.032733     4.66158
          5  |   2.931165   1.390956     2.11   0.035     .2049424    5.657388
          6  |   4.416207   2.091365     2.11   0.035     .3172078    8.515207
          7  |   4.416207   2.091365     2.11   0.035     .3172078    8.515207
          8  |   4.416207   2.091365     2.11   0.035     .3172078    8.515207
          9  |   4.416207   2.091365     2.11   0.035     .3172078    8.515207
             |
    otherBin |
          1  |  -3.726885   .2344012   -15.90   0.000    -4.186303   -3.267467
          2  |  -2.873147   .2422713   -11.86   0.000     -3.34799   -2.398304
          3  |  -1.711613   .2434859    -7.03   0.000    -2.188836   -1.234389
          5  |  -.4391847   .6060978    -0.72   0.469    -1.627115     .748745
          6  |   1.586289   .5919811     2.68   0.007     .4260277    2.746551
          7  |  -.0468193   .6293234    -0.07   0.941    -1.280271    1.186632
          8  |  -.3110564   .9459162    -0.33   0.742    -2.165018    1.542905
          9  |   .3280229   .7921146     0.41   0.679    -1.224493    1.880539
             |
       _cons |   8.018226   .9581052     8.37   0.000     6.140375    9.896078
-------------+----------------------------------------------------------------
5            |
       black |   2.290374   .8200081     2.79   0.005     .6831877     3.89756
    hispanic |  -.8569974    .818192    -1.05   0.295    -2.460624    .7466294
    born1980 |  -2.346593   1.091576    -2.15   0.032    -4.486043   -.2071437
    born1981 |   .3137443    1.15179     0.27   0.785    -1.943722     2.57121
    born1982 |  -3.102916   1.170589    -2.65   0.008    -5.397228   -.8086037
    born1983 |   .3683017   1.332592     0.28   0.782     -2.24353    2.980134
 foreignBorn |          0  (omitted)
      empPct |          0  (omitted)
incPerCapita |          0  (omitted)
schoo~yBlack |          0  (omitted)
school~yHisp |          0  (omitted)
workK12Black |          0  (omitted)
 workK12Hisp |          0  (omitted)
 workPTBlack |          0  (omitted)
  workPTHisp |          0  (omitted)
 workFTBlack |          0  (omitted)
  workFTHisp |          0  (omitted)
  otherBlack |          0  (omitted)
   otherHisp |          0  (omitted)
     hgcMoth |          0  (omitted)
   hgcMothSq |          0  (omitted)
   m_hgcMoth |          0  (omitted)
     hgcFath |          0  (omitted)
   hgcFathSq |          0  (omitted)
   m_hgcFath |          0  (omitted)
      famInc |          0  (omitted)
    famIncSq |          0  (omitted)
    m_famInc |          0  (omitted)
femaleHea~14 |          0  (omitted)
liveWithM~14 |          0  (omitted)
   numBAzero |          0  (omitted)
numBAperCa~a |          0  (omitted)
tuitionFla~p |          0  (omitted)
             |
schoolOnly~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
             |
  workK12Bin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
workPTonly~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
workFTonly~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
    otherBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
       _cons |  -6.469475   .9258332    -6.99   0.000    -8.284075   -4.654875
-------------+----------------------------------------------------------------
6            |
       black |   .1664279   .1073662     1.55   0.121    -.0440059    .3768618
    hispanic |  -.1997405   .0884113    -2.26   0.024    -.3730234   -.0264576
    born1980 |   .1394599   .0606588     2.30   0.022     .0205708     .258349
    born1981 |    .126731   .0608415     2.08   0.037     .0074838    .2459782
    born1982 |   .1172449   .0587218     2.00   0.046     .0021523    .2323374
    born1983 |   .0486298   .0629633     0.77   0.440     -.074776    .1720356
 foreignBorn |   .0173917   .0715277     0.24   0.808    -.1228001    .1575835
      empPct |   .1133277   .1063861     1.07   0.287    -.0951853    .3218407
incPerCapita |  -.0103041   .0058148    -1.77   0.076     -.021701    .0010927
schoo~yBlack |   -.235623    .084956    -2.77   0.006    -.4021337   -.0691123
school~yHisp |  -.0942913   .0817127    -1.15   0.249    -.2544453    .0658626
workK12Black |  -.0580912   .1985719    -0.29   0.770    -.4472849    .3311025
 workK12Hisp |  -.0341884   .1549814    -0.22   0.825    -.3379464    .2695695
 workPTBlack |   .4659047    .449127     1.04   0.300     -.414368    1.346177
  workPTHisp |   1.091511    .435445     2.51   0.012      .238054    1.944967
 workFTBlack |  -.2294308   .3559574    -0.64   0.519    -.9270945    .4682328
  workFTHisp |    2.37544   .6826376     3.48   0.001     1.037495    3.713385
  otherBlack |   .1780766   .1023998     1.74   0.082    -.0226233    .3787766
   otherHisp |   .1217884   .1167726     1.04   0.297    -.1070818    .3506586
     hgcMoth |   .0335819   .0316276     1.06   0.288    -.0284071    .0955709
   hgcMothSq |   -.029264   .0134676    -2.17   0.030    -.0556599   -.0028681
   m_hgcMoth |  -.1373224   .1958666    -0.70   0.483     -.521214    .2465692
     hgcFath |   .0256693    .031926     0.80   0.421    -.0369045     .088243
   hgcFathSq |  -.0202139   .0133897    -1.51   0.131    -.0464574    .0060295
   m_hgcFath |   .1316742   .1913324     0.69   0.491    -.2433304    .5066787
      famInc |  -.0913248   .0226377    -4.03   0.000    -.1356939   -.0469558
    famIncSq |   .0320593   .0144246     2.22   0.026     .0037876     .060331
    m_famInc |  -.1809393   .0598209    -3.02   0.002    -.2981862   -.0636924
femaleHea~14 |   .0421289   .0479867     0.88   0.380    -.0519233    .1361812
liveWithM~14 |  -.0805235   .0677877    -1.19   0.235     -.213385    .0523381
   numBAzero |  -.0612767   .0578263    -1.06   0.289    -.1746142    .0520609
numBAperCa~a |    .000957   .0059375     0.16   0.872    -.0106803    .0125944
tuitionFla~p |  -.0082889   .0099031    -0.84   0.403    -.0276986    .0111208
             |
schoolOnly~n |
          1  |   .8711845   .1071946     8.13   0.000      .661087    1.081282
          2  |   .5860789   .0977619     5.99   0.000     .3944692    .7776886
          3  |    .145498    .089711     1.62   0.105    -.0303324    .3213284
          5  |  -.0199675   .1245751    -0.16   0.873    -.2641302    .2241953
          6  |  -.1192566   .2959741    -0.40   0.687    -.6993553     .460842
          7  |   -.515763   .5806273    -0.89   0.374    -1.653772    .6222456
          8  |   .8529389    .547737     1.56   0.119    -.2206059    1.926484
             |
  workK12Bin |
          1  |  -.7102465   .0876313    -8.10   0.000    -.8820006   -.5384924
          2  |  -.2121317   .1027468    -2.06   0.039    -.4135116   -.0107517
          4  |   .0876766   .1327703     0.66   0.509    -.1725485    .3479017
          5  |   .2559315   .1446413     1.77   0.077    -.0275602    .5394231
          6  |    .268298   .1506653     1.78   0.075    -.0270006    .5635965
          7  |    .359982   .2087497     1.72   0.085    -.0491598    .7691239
          8  |   .3328078   .1806646     1.84   0.065    -.0212883    .6869039
          9  |   .0810393   .2358778     0.34   0.731    -.3812728    .5433513
             |
workPTonly~n |
          1  |  -2.071608   .5921397    -3.50   0.000     -3.23218   -.9110353
          2  |  -1.563465   .5799683    -2.70   0.007    -2.700182    -.426748
          3  |  -1.267111   .7807339    -1.62   0.105    -2.797321    .2630995
          5  |   -1.96897   1.133772    -1.74   0.082    -4.191122    .2531812
          6  |  -.8252002   .8958487    -0.92   0.357    -2.581031    .9306309
          7  |  -.8252002   .8958487    -0.92   0.357    -2.581031    .9306309
          8  |  -.8252002   .8958487    -0.92   0.357    -2.581031    .9306309
          9  |  -.8252002   .8958487    -0.92   0.357    -2.581031    .9306309
             |
workFTonly~n |
          1  |  -1.637937   .7894586    -2.07   0.038    -3.185247   -.0906262
          2  |  -.2260631   1.162466    -0.19   0.846    -2.504454    2.052328
          4  |   1.591129   1.435898     1.11   0.268     -1.22318    4.405438
          5  |   2.594449   1.388981     1.87   0.062    -.1279035    5.316802
          6  |   3.638407   2.086071     1.74   0.081    -.4502177    7.727031
          7  |   3.638407   2.086071     1.74   0.081    -.4502177    7.727031
          8  |   3.638407   2.086071     1.74   0.081    -.4502177    7.727031
          9  |   3.638407   2.086071     1.74   0.081    -.4502177    7.727031
             |
    otherBin |
          1  |  -4.604585   .2219911   -20.74   0.000    -5.039679    -4.16949
          2  |  -3.283003   .2196473   -14.95   0.000    -3.713504   -2.852503
          3  |  -1.915421   .2255814    -8.49   0.000    -2.357552   -1.473289
          5  |  -.0848847   .5773647    -0.15   0.883    -1.216499    1.046729
          6  |    2.19511   .5829244     3.77   0.000       1.0526    3.337621
          7  |   .7792968   .6173688     1.26   0.207    -.4307237    1.989317
          8  |   .8775403   .9325683     0.94   0.347      -.95026    2.705341
          9  |   2.089731   .7843521     2.66   0.008     .5524286    3.627032
             |
       _cons |   6.599021   .9142422     7.22   0.000     4.807139    8.390902
-------------+----------------------------------------------------------------
7            |
       black |   .4204776   .1768874     2.38   0.017     .0737846    .7671706
    hispanic |   .5592581   .1441923     3.88   0.000     .2766463    .8418699
    born1980 |   .0145972   .0768362     0.19   0.849    -.1359989    .1651934
    born1981 |     .03611   .0836693     0.43   0.666    -.1278789    .2000988
    born1982 |   .0419411   .0785544     0.53   0.593    -.1120227    .1959048
    born1983 |  -.0044621   .0822613    -0.05   0.957    -.1656913    .1567671
 foreignBorn |  -.1939469   .1296865    -1.50   0.135    -.4481277     .060234
      empPct |  -.0801926   .1299396    -0.62   0.537    -.3348696    .1744844
incPerCapita |   .0129637   .0057949     2.24   0.025     .0016059    .0243215
schoo~yBlack |  -.4694337    .110252    -4.26   0.000    -.6855236   -.2533439
school~yHisp |  -.3420415   .1009955    -3.39   0.001     -.539989   -.1440939
workK12Black |  -.4380435   .1665749    -2.63   0.009    -.7645243   -.1115628
 workK12Hisp |  -.5499085   .1593959    -3.45   0.001    -.8623188   -.2374982
 workPTBlack |   .5059134   .4478771     1.13   0.259    -.3719096    1.383736
  workPTHisp |   1.501271   .4314334     3.48   0.001     .6556769    2.346865
 workFTBlack |  -.0210972   .3576722    -0.06   0.953    -.7221217    .6799274
  workFTHisp |   2.331174   .6732537     3.46   0.001     1.011621    3.650727
  otherBlack |   .0219844   .1139233     0.19   0.847    -.2013013      .24527
   otherHisp |  -.2509482   .1335398    -1.88   0.060    -.5126814     .010785
     hgcMoth |   .1236124   .0500122     2.47   0.013     .0255903    .2216346
   hgcMothSq |  -.0241279   .0187591    -1.29   0.198     -.060895    .0126392
   m_hgcMoth |   1.062517   .3348678     3.17   0.002     .4061886    1.718846
     hgcFath |   .0114597   .0426495     0.27   0.788    -.0721318    .0950511
   hgcFathSq |   .0033723   .0156654     0.22   0.830    -.0273313     .034076
   m_hgcFath |   .0834769   .2832484     0.29   0.768    -.4716798    .6386336
      famInc |   .1267345   .0256602     4.94   0.000     .0764414    .1770277
    famIncSq |   -.069824   .0156641    -4.46   0.000    -.1005251    -.039123
    m_famInc |   .2475589   .0818984     3.02   0.003     .0870411    .4080767
femaleHea~14 |   .0014426   .0690008     0.02   0.983    -.1337965    .1366816
liveWithM~14 |   .1695151   .0912782     1.86   0.063    -.0093869    .3484171
   numBAzero |   .1987213    .065941     3.01   0.003     .0694792    .3279633
numBAperCa~a |   .0093541   .0037579     2.49   0.013     .0019888    .0167193
tuitionFla~p |   .0005684   .0124021     0.05   0.963    -.0237393    .0248761
             |
schoolOnly~n |
          1  |  -1.643249   .1213047   -13.55   0.000    -1.881002   -1.405496
          2  |  -1.427966   .1030354   -13.86   0.000    -1.629912   -1.226021
          3  |  -.9157722   .0938252    -9.76   0.000    -1.099666   -.7318782
          5  |   .4281653   .1208105     3.54   0.000     .1913811    .6649496
          6  |   .4900171   .2803639     1.75   0.081     -.059486     1.03952
          7  |    1.14094   .5779694     1.97   0.048     .0081404    2.273739
          8  |    1.15026   .5509283     2.09   0.037       .07046    2.230059
             |
  workK12Bin |
          1  |  -1.549634   .0810564   -19.12   0.000    -1.708502   -1.390767
          2  |  -.6036838   .0892354    -6.77   0.000    -.7785821   -.4287856
          4  |   .6765532    .109833     6.16   0.000     .4612845     .891822
          5  |   .9868362   .1129352     8.74   0.000     .7654873    1.208185
          6  |    1.28088    .123573    10.37   0.000     1.038682    1.523079
          7  |   1.842314   .1588953    11.59   0.000     1.530885    2.153743
          8  |   2.457079   .1593009    15.42   0.000     2.144855    2.769303
          9  |   2.952975   .1899053    15.55   0.000     2.580768    3.325183
             |
workPTonly~n |
          1  |  -1.399246   .6190108    -2.26   0.024    -2.612485   -.1860075
          2  |  -.9739811   .6075236    -1.60   0.109    -2.164705    .2167433
          3  |  -1.199692   .8183674    -1.47   0.143    -2.803663    .4042782
          5  |  -1.767878   1.139526    -1.55   0.121    -4.001308    .4655508
          6  |   -.864851   .9327788    -0.93   0.354    -2.693064    .9633619
          7  |   -.864851   .9327788    -0.93   0.354    -2.693064    .9633619
          8  |   -.864851   .9327788    -0.93   0.354    -2.693064    .9633619
          9  |   -.864851   .9327788    -0.93   0.354    -2.693064    .9633619
             |
workFTonly~n |
          1  |   .0184603   .8484333     0.02   0.983    -1.644438    1.681359
          2  |    .142934   1.189217     0.12   0.904    -2.187888    2.473756
          4  |   1.401878   1.563355     0.90   0.370    -1.662241    4.465997
          5  |    2.25447   1.452882     1.55   0.121    -.5931265    5.102066
          6  |   3.424947   2.130679     1.61   0.108    -.7511072       7.601
          7  |   3.424947   2.130679     1.61   0.108    -.7511072       7.601
          8  |   3.424947   2.130679     1.61   0.108    -.7511072       7.601
          9  |   3.424947   2.130679     1.61   0.108    -.7511072       7.601
             |
    otherBin |
          1  |  -2.002901   .2478649    -8.08   0.000    -2.488708   -1.517095
          2  |  -1.616854   .2363876    -6.84   0.000    -2.080165   -1.153543
          3  |  -1.501811   .2549896    -5.89   0.000    -2.001581    -1.00204
          5  |  -.1866354   .6006061    -0.31   0.756    -1.363802     .990531
          6  |   2.330829   .5895792     3.95   0.000     1.175275    3.486383
          7  |   .8124006   .6396632     1.27   0.204    -.4413162    2.066117
          8  |   .9011015   .9657127     0.93   0.351    -.9916607    2.793864
          9  |   1.714236   .8140096     2.11   0.035     .1188061    3.309665
             |
       _cons |  -.1814443   1.009277    -0.18   0.857     -2.15959    1.796701
------------------------------------------------------------------------------

. predict p1risk1 p1risk2 p1risk3 p1risk4 p1risk5 p1risk6 p1risk7 if e(sample),
>  pr
(570929 missing values generated)

. estimates store logit1

. qui outreg2 using y97_logits_all_binned_t0_16, excel replace bdec(4) sdec(4)
 : 
. 
. mlogit  activity        `Pvars97' `Mvars' `Svars2' `Zvars2' `Evars2' `Fvars' 
> `Cvars' `Bvars2' if inrange(activity,11,17), base(11) difficult constraints(2
> 21/240) vce(cluster id)

Iteration 0:   log pseudolikelihood =    -720865  
Iteration 1:   log pseudolikelihood = -623802.78  
Iteration 2:   log pseudolikelihood = -596454.69  
Iteration 3:   log pseudolikelihood = -565005.89  
Iteration 4:   log pseudolikelihood = -530164.67  
Iteration 5:   log pseudolikelihood = -516436.17  
Iteration 6:   log pseudolikelihood = -502470.03  
Iteration 7:   log pseudolikelihood = -489585.14  
Iteration 8:   log pseudolikelihood = -483780.12  
Iteration 9:   log pseudolikelihood = -481672.98  
Iteration 10:  log pseudolikelihood = -479439.77  
Iteration 11:  log pseudolikelihood = -478326.18  
Iteration 12:  log pseudolikelihood = -478273.21  
Iteration 13:  log pseudolikelihood = -478272.69  
Iteration 14:  log pseudolikelihood = -478272.69  

Multinomial logistic regression                 Number of obs     =    478,785
                                                Wald chi2(514)    =   45464.04
Log pseudolikelihood = -478272.69               Prob > chi2       =     0.0000

 ( 1)  - [15]8.workCollegeBin + [15]9.workCollegeBin = 0
 ( 2)  - [15]7.workPTonlyBin + [15]8.workPTonlyBin = 0
 ( 3)  - [15]7.workPTonlyBin + [15]9.workPTonlyBin = 0
 ( 4)  - [15]6.workFTonlyBin + [15]7.workFTonlyBin = 0
 ( 5)  - [15]6.workFTonlyBin + [15]8.workFTonlyBin = 0
 ( 6)  - [15]6.workFTonlyBin + [15]9.workFTonlyBin = 0
 ( 7)  - [15]8.otherBin + [15]9.otherBin = 0
 ( 8)  - [17]4.workFTonlyBin + [17]5.workFTonlyBin = 0
 ( 9)  - [17]4.workFTonlyBin + [17]6.workFTonlyBin = 0
 (10)  - [17]4.workFTonlyBin + [17]7.workFTonlyBin = 0
 (11)  - [17]4.workFTonlyBin + [17]8.workFTonlyBin = 0
 (12)  - [17]4.workFTonlyBin + [17]9.workFTonlyBin = 0
 (13)  [17]1o.militaryBin = 0
 (14)  [17]2o.militaryBin = 0
 (15)  [17]4o.militaryBin = 0
 (16)  [17]5o.militaryBin = 0
 (17)  [17]o.militaryBlack = 0
 (18)  [17]o.militaryHisp = 0
 (19)  - [17]7.otherBin + [17]8.otherBin = 0
 (20)  - [17]7.otherBin + [17]9.otherBin = 0
                                 (Std. Err. adjusted for 3,729 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    activity |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
11           |  (base outcome)
-------------+----------------------------------------------------------------
12           |
       black |  -.3399332   .1833683    -1.85   0.064    -.6993285    .0194621
    hispanic |   .2992386   .2300516     1.30   0.193    -.1516542    .7501315
    born1980 |   .2152951   .0774835     2.78   0.005     .0634302    .3671601
    born1981 |   .1279388   .0740331     1.73   0.084    -.0171634     .273041
    born1982 |   .1486083   .0744232     2.00   0.046     .0027414    .2944751
    born1983 |   .0239796   .0766628     0.31   0.754    -.1262768     .174236
 foreignBorn |   .0636537   .1035454     0.61   0.539    -.1392915    .2665989
      empPct |    .137015    .132784     1.03   0.302     -.123237    .3972669
incPerCapita |  -.0040345    .005767    -0.70   0.484    -.0153376    .0072685
schoo~yBlack |  -.0435826   .0549718    -0.79   0.428    -.1513254    .0641602
school~yHisp |  -.0726147   .0622223    -1.17   0.243    -.1945682    .0493388
workK12Black |   .0313585   .1046664     0.30   0.764    -.1737838    .2365009
 workK12Hisp |  -.0562993   .1291563    -0.44   0.663    -.3094411    .1968425
workC~eBlack |   .0937582   .0674007     1.39   0.164    -.0383447    .2258611
workCo~eHisp |  -.1147057    .058449    -1.96   0.050    -.2292636   -.0001477
 workPTBlack |   .1043186   .0895997     1.16   0.244    -.0712936    .2799308
  workPTHisp |   .1463397    .103114     1.42   0.156    -.0557599    .3484394
 workFTBlack |   .0799306   .0446437     1.79   0.073    -.0075694    .1674306
  workFTHisp |   .1418376   .0551228     2.57   0.010      .033799    .2498762
militaryBl~k |    .026027    .056651     0.46   0.646    -.0850069    .1370608
militaryHisp |  -.0005347   .0536661    -0.01   0.992    -.1057184     .104649
  otherBlack |   .1135654   .0575465     1.97   0.048     .0007764    .2263544
   otherHisp |  -.1088199   .0680373    -1.60   0.110    -.2421707    .0245308
     hgcMoth |  -.0395895   .0563804    -0.70   0.483     -.150093    .0709141
   hgcMothSq |   .0049123   .0205359     0.24   0.811    -.0353374     .045162
   m_hgcMoth |  -.3933226     .39806    -0.99   0.323    -1.173506    .3868607
     hgcFath |   .0612287   .0552573     1.11   0.268    -.0470736     .169531
   hgcFathSq |  -.0278609   .0194276    -1.43   0.152    -.0659383    .0102165
   m_hgcFath |   .2678172   .3917377     0.68   0.494    -.4999745    1.035609
      famInc |  -.0577622   .0275267    -2.10   0.036    -.1117135   -.0038109
    famIncSq |   .0214298   .0156771     1.37   0.172    -.0092968    .0521565
    m_famInc |  -.1125472   .0876559    -1.28   0.199    -.2843496    .0592552
femaleHea~14 |  -.0136568   .0702319    -0.19   0.846    -.1513088    .1239952
liveWithM~14 |   .0297365   .0943474     0.32   0.753    -.1551809     .214654
   numBAzero |  -.0406921   .0713535    -0.57   0.568    -.1805424    .0991581
numBAperCa~a |  -.0031428   .0061684    -0.51   0.610    -.0152327    .0089471
tuitionFla~p |  -.0174348   .0126793    -1.38   0.169    -.0422857    .0074162
             |
schoolOnly~n |
          1  |   1.871042   .0962397    19.44   0.000     1.682415    2.059668
          2  |   .8937246   .0845074    10.58   0.000     .7280931    1.059356
          3  |   .3520843   .0756012     4.66   0.000     .2039086      .50026
          5  |   -.675769   .0706208    -9.57   0.000    -.8141832   -.5373547
          6  |  -1.252756   .0956862   -13.09   0.000    -1.440297   -1.065214
          7  |  -1.758585   .1363228   -12.90   0.000    -2.025773   -1.491397
          8  |  -1.736471   .1861661    -9.33   0.000     -2.10135   -1.371592
          9  |  -2.396985    .306764    -7.81   0.000    -2.998232   -1.795739
             |
  workK12Bin |
          1  |   .2968091   .0983663     3.02   0.003     .1040147    .4896035
          2  |   .3165649   .1128299     2.81   0.005     .0954223    .5377074
          4  |   .0262527   .1169392     0.22   0.822    -.2029438    .2554493
          5  |  -.0640251   .1189203    -0.54   0.590    -.2971045    .1690543
          6  |  -.0920191   .1214418    -0.76   0.449    -.3300407    .1460025
          7  |   -.482389   .1302181    -3.70   0.000    -.7376117   -.2271663
          8  |  -.4409153   .1160217    -3.80   0.000    -.6683137    -.213517
          9  |   -.740688   .1174653    -6.31   0.000    -.9709157   -.5104604
             |
workColleg~n |
          1  |  -1.980751   .0885218   -22.38   0.000    -2.154251   -1.807251
          2  |  -.4424783   .0982107    -4.51   0.000    -.6349677   -.2499889
          4  |   .0343772   .1175302     0.29   0.770    -.1959778    .2647321
          5  |   .1981269   .1377956     1.44   0.150    -.0719476    .4682013
          6  |    .660559   .1515895     4.36   0.000      .363449    .9576691
          7  |   .7165967   .1652282     4.34   0.000     .3927553    1.040438
          8  |    .753739   .2312049     3.26   0.001     .3005857    1.206892
          9  |   .9444199   .3145156     3.00   0.003     .3279807    1.560859
             |
workPTonly~n |
          1  |  -.0549877   .1556576    -0.35   0.724     -.360071    .2500956
          2  |  -.1067583   .1585091    -0.67   0.501    -.4174304    .2039139
          3  |   .2655138   .1813486     1.46   0.143     -.089923    .6209506
          5  |   .1040335   .2215438     0.47   0.639    -.3301844    .5382514
          6  |  -.1320182    .267268    -0.49   0.621    -.6558538    .3918174
          7  |   -.190053   .2563572    -0.74   0.458    -.6925038    .3123978
          8  |   .3319261    .374214     0.89   0.375    -.4015199    1.065372
          9  |  -.0148916   .2671258    -0.06   0.956    -.5384485    .5086654
             |
workFTonly~n |
          1  |  -.0282995   .1399928    -0.20   0.840    -.3026804    .2460813
          2  |   .0950874   .1773289     0.54   0.592     -.252471    .4426457
          4  |   .1818072   .2190732     0.83   0.407    -.2475684    .6111827
          5  |  -.0648453   .2298838    -0.28   0.778    -.5154091    .3857186
          6  |  -.1208792   .3062882    -0.39   0.693    -.7211932    .4794347
          7  |  -.0791104   .4273896    -0.19   0.853    -.9167785    .7585578
          8  |  -.4424042   .4618623    -0.96   0.338    -1.347638    .4628292
          9  |   .3745421   .3845141     0.97   0.330    -.3790916    1.128176
             |
 militaryBin |
          1  |   .8142794   .2996704     2.72   0.007     .2269362    1.401623
          2  |   .2342736   .4303419     0.54   0.586    -.6091809    1.077728
          4  |   .9971004   .3921734     2.54   0.011     .2284547    1.765746
          5  |   .0839079   .3188844     0.26   0.792    -.5410941    .7089099
             |
    otherBin |
          1  |   .0132574    .126958     0.10   0.917    -.2355757    .2620904
          2  |   .0799196   .1275571     0.63   0.531    -.1700878     .329927
          3  |   .0245892   .1381876     0.18   0.859    -.2462536    .2954319
          5  |   .0213691   .2321287     0.09   0.927    -.4335948    .4763329
          6  |   .0556139   .2135268     0.26   0.795     -.362891    .4741188
          7  |  -.1847596   .2844827    -0.65   0.516    -.7423353    .3728162
          8  |  -.1833926   .4523852    -0.41   0.685    -1.070051    .7032662
          9  |   -1.05215   .3386458    -3.11   0.002    -1.715883   -.3884161
             |
       _cons |   1.164472   .6615089     1.76   0.078    -.1320618    2.461006
-------------+----------------------------------------------------------------
13           |
       black |   .0864715   .1990029     0.43   0.664    -.3035669      .47651
    hispanic |   .4083799   .2622668     1.56   0.119    -.1056537    .9224134
    born1980 |   .1550058   .0904279     1.71   0.087    -.0222297    .3322413
    born1981 |   .0489744   .0877813     0.56   0.577    -.1230739    .2210227
    born1982 |   .2684021   .0883964     3.04   0.002     .0951483    .4416558
    born1983 |   .0088761   .0885487     0.10   0.920    -.1646762    .1824284
 foreignBorn |  -.1763147   .1246172    -1.41   0.157      -.42056    .0679305
      empPct |   .0652327   .1543026     0.42   0.672    -.2371948    .3676602
incPerCapita |   .0016953   .0068841     0.25   0.805    -.0117973    .0151879
schoo~yBlack |   .0050961    .058369     0.09   0.930    -.1093051    .1194972
school~yHisp |   -.032871   .0761235    -0.43   0.666    -.1820703    .1163283
workK12Black |   .0430932   .1148932     0.38   0.708    -.1820933    .2682798
 workK12Hisp |  -.1270644   .1470271    -0.86   0.387    -.4152322    .1611033
workC~eBlack |  -.1110737   .0788044    -1.41   0.159    -.2655275    .0433802
workCo~eHisp |  -.2385461   .0777045    -3.07   0.002    -.3908442   -.0862481
 workPTBlack |   .1851184   .0952027     1.94   0.052    -.0014756    .3717123
  workPTHisp |   .2141001   .0966564     2.22   0.027      .024657    .4035432
 workFTBlack |    .015673   .0460038     0.34   0.733    -.0744929    .1058388
  workFTHisp |   .0734836   .0560949     1.31   0.190    -.0364603    .1834275
militaryBl~k |  -.1608345   .0673247    -2.39   0.017    -.2927885   -.0288805
militaryHisp |  -.1515405   .0694724    -2.18   0.029    -.2877039    -.015377
  otherBlack |   .0388203   .0539187     0.72   0.472    -.0668585    .1444991
   otherHisp |  -.1904334   .0555668    -3.43   0.001    -.2993422   -.0815245
     hgcMoth |  -.1077336     .06333    -1.70   0.089    -.2318582     .016391
   hgcMothSq |   .0160903    .023872     0.67   0.500     -.030698    .0628786
   m_hgcMoth |  -1.210662   .4365036    -2.77   0.006    -2.066193   -.3551302
     hgcFath |   .0922377   .0602027     1.53   0.125    -.0257575    .2102329
   hgcFathSq |  -.0603336   .0220855    -2.73   0.006    -.1036203   -.0170468
   m_hgcFath |    .197901    .415309     0.48   0.634    -.6160898    1.011892
      famInc |  -.0928286   .0340309    -2.73   0.006     -.159528   -.0261292
    famIncSq |   .0416385   .0214859     1.94   0.053    -.0004732    .0837502
    m_famInc |  -.3309277   .1010622    -3.27   0.001     -.529006   -.1328494
femaleHea~14 |  -.0179853   .0794399    -0.23   0.821    -.1736847    .1377142
liveWithM~14 |  -.1674678   .1085409    -1.54   0.123     -.380204    .0452685
   numBAzero |   .0095204   .0827227     0.12   0.908    -.1526131    .1716538
numBAperCa~a |   .0013418   .0074664     0.18   0.857    -.0132921    .0159757
tuitionFla~p |  -.0075627   .0146862    -0.51   0.607    -.0363471    .0212217
             |
schoolOnly~n |
          1  |     2.0511   .1054915    19.44   0.000     1.844341     2.25786
          2  |   1.014187   .0951281    10.66   0.000     .8277395    1.200635
          3  |   .4940414    .084213     5.87   0.000     .3289869    .6590959
          5  |  -.6413025   .0810242    -7.91   0.000    -.8001069    -.482498
          6  |  -1.359326   .1233617   -11.02   0.000     -1.60111   -1.117541
          7  |   -1.63239   .1883896    -8.66   0.000    -2.001627   -1.263153
          8  |  -1.603502   .2410734    -6.65   0.000    -2.075997   -1.131006
          9  |  -1.654772   .3568616    -4.64   0.000    -2.354208   -.9553361
             |
  workK12Bin |
          1  |   .3032997   .1145371     2.65   0.008     .0788112    .5277883
          2  |    .429978   .1353084     3.18   0.001     .1647784    .6951776
          4  |  -.0680928   .1447702    -0.47   0.638    -.3518372    .2156517
          5  |  -.0817488   .1424744    -0.57   0.566    -.3609935     .197496
          6  |   -.191671   .1408506    -1.36   0.174    -.4677331     .084391
          7  |  -.4201304   .1599408    -2.63   0.009    -.7336086   -.1066522
          8  |  -.5792617   .1431474    -4.05   0.000    -.8598255    -.298698
          9  |  -.8570824   .1361487    -6.30   0.000    -1.123929   -.5902359
             |
workColleg~n |
          1  |    .242841   .1254331     1.94   0.053    -.0030035    .4886854
          2  |  -.1389522   .1441508    -0.96   0.335    -.4214825    .1435781
          4  |   .0705679   .1761775     0.40   0.689    -.2747336    .4158694
          5  |  -.0572579   .1914737    -0.30   0.765    -.4325394    .3180236
          6  |   .0134366   .2333217     0.06   0.954    -.4438655    .4707387
          7  |    .238516   .2267047     1.05   0.293    -.2058171    .6828491
          8  |   .3840553   .3109502     1.24   0.217    -.2253959    .9935064
          9  |   .2873776   .4035815     0.71   0.476    -.5036275    1.078383
             |
workPTonly~n |
          1  |  -2.029074   .1574413   -12.89   0.000    -2.337653   -1.720494
          2  |  -1.058047   .1616034    -6.55   0.000    -1.374784   -.7413101
          3  |  -.1124439   .1799033    -0.63   0.532    -.4650479    .2401601
          5  |    .261619   .2152772     1.22   0.224    -.1603166    .6835547
          6  |   .0348662   .2553718     0.14   0.891    -.4656533    .5353858
          7  |  -.0110324   .2405247    -0.05   0.963    -.4824521    .4603874
          8  |   .5270573   .3627655     1.45   0.146    -.1839501    1.238065
          9  |   .8638511   .2753589     3.14   0.002     .3241577    1.403545
             |
workFTonly~n |
          1  |  -.8049572   .1483934    -5.42   0.000    -1.095803   -.5141114
          2  |   .0234113   .1850646     0.13   0.899    -.3393086    .3861312
          4  |   .0111785   .2209004     0.05   0.960    -.4217783    .4441352
          5  |  -.2137847   .2425823    -0.88   0.378    -.6892373    .2616678
          6  |   .1579392   .2986589     0.53   0.597    -.4274214    .7432998
          7  |   .4754258   .4161172     1.14   0.253    -.3401489       1.291
          8  |  -.0408343   .4364426    -0.09   0.925    -.8962462    .8145775
          9  |    .817933   .3715695     2.20   0.028     .0896703    1.546196
             |
 militaryBin |
          1  |   1.734406   .3180453     5.45   0.000     1.111049    2.357763
          2  |   1.521247   .4575835     3.32   0.001     .6243995    2.418094
          4  |   1.520348   .4115497     3.69   0.000     .7137252     2.32697
          5  |   .7550015   .3580398     2.11   0.035     .0532565    1.456747
             |
    otherBin |
          1  |  -.5299188   .1378516    -3.84   0.000    -.8001029   -.2597347
          2  |  -.1205213   .1402078    -0.86   0.390    -.3953235    .1542809
          3  |   .0604658   .1444649     0.42   0.676    -.2226802    .3436118
          5  |   .3898326   .2280467     1.71   0.087    -.0571307     .836796
          6  |   .1721554   .2135906     0.81   0.420    -.2464746    .5907853
          7  |   .3705247   .2573306     1.44   0.150    -.1338339    .8748833
          8  |   .1474591   .3424967     0.43   0.667    -.5238221    .8187404
          9  |  -.3709679   .3080084    -1.20   0.228    -.9746533    .2327175
             |
       _cons |   1.475996   .7068641     2.09   0.037     .0905683    2.861425
-------------+----------------------------------------------------------------
14           |
       black |   .0554875   .1958668     0.28   0.777    -.3284044    .4393795
    hispanic |   .5285124   .2671023     1.98   0.048     .0050015    1.052023
    born1980 |   .1550509    .088794     1.75   0.081    -.0189821     .329084
    born1981 |   .0416364   .0872293     0.48   0.633    -.1293298    .2126026
    born1982 |   .2008575   .0862345     2.33   0.020     .0318409    .3698741
    born1983 |   .0254527   .0868549     0.29   0.769    -.1447797    .1956851
 foreignBorn |   -.162828   .1228228    -1.33   0.185    -.4035563    .0779002
      empPct |   .1178925   .1527798     0.77   0.440    -.1815505    .4173354
incPerCapita |   .0055827   .0067805     0.82   0.410    -.0077068    .0188723
schoo~yBlack |   .0014284   .0573241     0.02   0.980    -.1109248    .1137817
school~yHisp |   .0050975   .0738637     0.07   0.945    -.1396726    .1498676
workK12Black |  -.0304741   .1149323    -0.27   0.791    -.2557372    .1947891
 workK12Hisp |  -.1445424   .1508598    -0.96   0.338    -.4402222    .1511375
workC~eBlack |  -.0658593   .0720385    -0.91   0.361    -.2070522    .0753336
workCo~eHisp |  -.2299241   .0688948    -3.34   0.001    -.3649554   -.0948928
 workPTBlack |   .1239737    .096665     1.28   0.200    -.0654863    .3134337
  workPTHisp |   .0990787   .0990115     1.00   0.317    -.0949803    .2931377
 workFTBlack |   .0450339   .0440725     1.02   0.307    -.0413465    .1314144
  workFTHisp |   .0819728   .0542956     1.51   0.131    -.0244445    .1883902
militaryBl~k |  -.1390131   .0596598    -2.33   0.020    -.2559442    -.022082
militaryHisp |  -.0709289   .0629052    -1.13   0.260    -.1942208     .052363
  otherBlack |   .0794706   .0530675     1.50   0.134    -.0245397    .1834809
   otherHisp |   -.154388   .0536528    -2.88   0.004    -.2595456   -.0492304
     hgcMoth |    .005207   .0613913     0.08   0.932    -.1151178    .1255318
   hgcMothSq |  -.0288248   .0230208    -1.25   0.211    -.0739448    .0162952
   m_hgcMoth |  -.4810585    .426572    -1.13   0.259    -1.317124    .3550074
     hgcFath |   .0644316   .0598751     1.08   0.282    -.0529215    .1817847
   hgcFathSq |  -.0551029   .0220228    -2.50   0.012    -.0982668    -.011939
   m_hgcFath |  -.0935722   .4114795    -0.23   0.820    -.9000571    .7129127
      famInc |   -.087754   .0333333    -2.63   0.008    -.1530861   -.0224219
    famIncSq |   .0387277   .0218577     1.77   0.076    -.0041127     .081568
    m_famInc |  -.2785959   .0991517    -2.81   0.005    -.4729297    -.084262
femaleHea~14 |  -.0621063     .07848    -0.79   0.429    -.2159244    .0917117
liveWithM~14 |  -.0614968     .10485    -0.59   0.558    -.2669991    .1440055
   numBAzero |    .067811   .0802875     0.84   0.398    -.0895496    .2251716
numBAperCa~a |   .0060195    .007697     0.78   0.434    -.0090663    .0211053
tuitionFla~p |  -.0214165   .0144457    -1.48   0.138    -.0497296    .0068965
             |
schoolOnly~n |
          1  |   2.114009   .1022442    20.68   0.000     1.913614    2.314404
          2  |   1.092003   .0902135    12.10   0.000      .915188    1.268818
          3  |   .5817649   .0790484     7.36   0.000     .4268329    .7366969
          5  |  -.5997204   .0763148    -7.86   0.000    -.7492946   -.4501462
          6  |  -1.309736    .116236   -11.27   0.000    -1.537555   -1.081918
          7  |  -1.483443   .1702419    -8.71   0.000    -1.817111   -1.149775
          8  |  -1.544361   .2238355    -6.90   0.000    -1.983071   -1.105652
          9  |  -1.777941    .389858    -4.56   0.000    -2.542048   -1.013833
             |
  workK12Bin |
          1  |   .2293038   .1106217     2.07   0.038     .0124892    .4461184
          2  |   .4275531    .131572     3.25   0.001     .1696768    .6854295
          4  |  -.1649454   .1348321    -1.22   0.221    -.4292115    .0993207
          5  |  -.1594416   .1350504    -1.18   0.238    -.4241355    .1052522
          6  |   -.265433   .1362445    -1.95   0.051    -.5324674    .0016014
          7  |  -.5606952   .1575521    -3.56   0.000    -.8694916   -.2518988
          8  |  -.6176394   .1392962    -4.43   0.000    -.8906549    -.344624
          9  |   -.791184   .1328349    -5.96   0.000    -1.051536   -.5308324
             |
workColleg~n |
          1  |   .0965542   .1111046     0.87   0.385    -.1212068    .3143151
          2  |  -.1809923     .13031    -1.39   0.165    -.4363953    .0744107
          4  |  -.0802051   .1543041    -0.52   0.603    -.3826356    .2222253
          5  |   .0670122   .1733657     0.39   0.699    -.2727784    .4068028
          6  |   .3057198   .2009808     1.52   0.128    -.0881953    .6996349
          7  |   .4599291   .2063681     2.23   0.026      .055455    .8644031
          8  |   .4286829   .2802158     1.53   0.126    -.1205301    .9778958
          9  |   .3864857    .350277     1.10   0.270    -.3000445    1.073016
             |
workPTonly~n |
          1  |  -.6966489   .1651601    -4.22   0.000    -1.020357   -.3729411
          2  |  -.3678942   .1690399    -2.18   0.030    -.6992063   -.0365821
          3  |   .0533764   .1878766     0.28   0.776    -.3148549    .4216076
          5  |  -.0388617   .2219014    -0.18   0.861    -.4737804     .396057
          6  |  -.3504224   .2653414    -1.32   0.187     -.870482    .1696372
          7  |  -.7061206   .2471397    -2.86   0.004    -1.190506   -.2217356
          8  |  -.1343223   .3774312    -0.36   0.722     -.874074    .6054293
          9  |  -.3622777   .2772896    -1.31   0.191    -.9057553       .1812
             |
workFTonly~n |
          1  |  -2.767101   .1393093   -19.86   0.000    -3.040142    -2.49406
          2  |  -.3550301   .1752926    -2.03   0.043    -.6985973    -.011463
          4  |   .2962345   .2094601     1.41   0.157    -.1142997    .7067688
          5  |   .3502974   .2318924     1.51   0.131    -.1042034    .8047982
          6  |   .7349629    .291297     2.52   0.012     .1640313    1.305895
          7  |   1.272502   .4105563     3.10   0.002     .4678259    2.077177
          8  |   1.001311   .4246765     2.36   0.018     .1689606    1.833662
          9  |   2.164256   .3621906     5.98   0.000     1.454375    2.874136
             |
 militaryBin |
          1  |   1.438451   .3552488     4.05   0.000     .7421766    2.134726
          2  |   .9488699   .4664949     2.03   0.042     .0345567    1.863183
          4  |   1.218359   .4346542     2.80   0.005     .3664526    2.070266
          5  |   .4520442   .3766018     1.20   0.230    -.2860818     1.19017
             |
    otherBin |
          1  |  -.3278405   .1335121    -2.46   0.014    -.5895194   -.0661616
          2  |  -.0664953   .1354351    -0.49   0.623    -.3319431    .1989526
          3  |   .0575017   .1426518     0.40   0.687    -.2220907    .3370941
          5  |   .1697975   .2289977     0.74   0.458    -.2790298    .6186247
          6  |   .0002365   .2121363     0.00   0.999    -.4155431     .416016
          7  |  -.0919466   .2511593    -0.37   0.714    -.5842097    .4003165
          8  |  -.2265997   .3398988    -0.67   0.505    -.8927891    .4395898
          9  |  -.9194071   .3069945    -2.99   0.003    -1.521105   -.3177088
             |
       _cons |   2.809681   .7062364     3.98   0.000     1.425483    4.193879
-------------+----------------------------------------------------------------
15           |
       black |   .3720849   .3592696     1.04   0.300    -.3320706     1.07624
    hispanic |   .1516982   .3899839     0.39   0.697    -.6126562    .9160526
    born1980 |   .3245546   .1698736     1.91   0.056    -.0083916    .6575007
    born1981 |   .3449056   .1560066     2.21   0.027     .0391382    .6506729
    born1982 |   .2324108   .1550445     1.50   0.134    -.0714707    .5362924
    born1983 |   .1784391   .1669641     1.07   0.285    -.1488045    .5056828
 foreignBorn |  -.0924986   .2568315    -0.36   0.719     -.595879    .4108818
      empPct |   .3236222   .2912755     1.11   0.267    -.2472673    .8945118
incPerCapita |  -.0339403   .0136515    -2.49   0.013    -.0606967   -.0071838
schoo~yBlack |  -.1847352   .1028265    -1.80   0.072    -.3862714     .016801
school~yHisp |   .0916183   .1213825     0.75   0.450     -.146287    .3295237
workK12Black |  -.0117041   .1957422    -0.06   0.952    -.3953517    .3719434
 workK12Hisp |  -.0362323   .2154274    -0.17   0.866    -.4584623    .3859976
workC~eBlack |  -.1029106   .2408552    -0.43   0.669    -.5749782     .369157
workCo~eHisp |  -.2506051   .1713807    -1.46   0.144    -.5865051    .0852949
 workPTBlack |  -.0108818   .2903202    -0.04   0.970    -.5798989    .5581354
  workPTHisp |   .3068684   .1264247     2.43   0.015     .0590805    .5546563
 workFTBlack |   -.168427   .1173904    -1.43   0.151    -.3985079    .0616539
  workFTHisp |  -.1134955   .1004494    -1.13   0.259    -.3103726    .0833817
militaryBl~k |   .0775467   .0471279     1.65   0.100    -.0148224    .1699157
militaryHisp |    .073826   .0430891     1.71   0.087    -.0106271     .158279
  otherBlack |  -.3058936   .2447403    -1.25   0.211    -.7855757    .1737886
   otherHisp |  -.1179937    .199229    -0.59   0.554    -.5084754     .272488
     hgcMoth |  -.1093557   .1141826    -0.96   0.338    -.3331495    .1144382
   hgcMothSq |    .010367   .0438005     0.24   0.813    -.0754804    .0962145
   m_hgcMoth |   -1.48349   .7712588    -1.92   0.054     -2.99513    .0281492
     hgcFath |   .1640238   .0951155     1.72   0.085    -.0223992    .3504468
   hgcFathSq |  -.0698165   .0382151    -1.83   0.068    -.1447167    .0050837
   m_hgcFath |   .7401776    .610637     1.21   0.225     -.456649    1.937004
      famInc |  -.0468433   .0652769    -0.72   0.473    -.1747837    .0810971
    famIncSq |   .0089643   .0430953     0.21   0.835    -.0755009    .0934295
    m_famInc |  -.1621069   .1916307    -0.85   0.398    -.5376963    .2134824
femaleHea~14 |   .0818995   .1366898     0.60   0.549    -.1860075    .3498066
liveWithM~14 |  -.5666303   .1896731    -2.99   0.003    -.9383828   -.1948778
   numBAzero |  -.0655802   .1367122    -0.48   0.631    -.3335312    .2023708
numBAperCa~a |  -.0220546   .0179969    -1.23   0.220    -.0573279    .0132188
tuitionFla~p |  -.0460896   .0265979    -1.73   0.083    -.0982205    .0060413
             |
schoolOnly~n |
          1  |    2.10747   .2039388    10.33   0.000     1.707757    2.507182
          2  |   1.009979   .2101049     4.81   0.000     .5981811    1.421777
          3  |   .3431594   .1820834     1.88   0.059    -.0137175    .7000363
          5  |  -.9398001   .1784262    -5.27   0.000    -1.289509   -.5900911
          6  |  -2.043452   .2562327    -7.97   0.000    -2.545658   -1.541245
          7  |  -3.153508   .4053488    -7.78   0.000    -3.947977   -2.359039
          8  |  -1.407811   .4774278    -2.95   0.003    -2.343553   -.4720698
          9  |     -2.283   .4946863    -4.62   0.000    -3.252568   -1.313433
             |
  workK12Bin |
          1  |    .189483   .1861986     1.02   0.309    -.1754595    .5544255
          2  |   .5715565   .2275149     2.51   0.012     .1256354    1.017478
          4  |  -.4312127   .2570325    -1.68   0.093    -.9349871    .0725617
          5  |  -.3957361   .2908374    -1.36   0.174    -.9657669    .1742947
          6  |  -.4662659    .231257    -2.02   0.044    -.9195213   -.0130105
          7  |  -.4309009   .2883937    -1.49   0.135    -.9961421    .1343403
          8  |  -.6229237   .2668338    -2.33   0.020    -1.145908   -.0999392
          9  |  -.8641713   .2405418    -3.59   0.000    -1.335625    -.392718
             |
workColleg~n |
          1  |   .4651792   .3088113     1.51   0.132    -.1400798    1.070438
          2  |    .091986   .3580587     0.26   0.797    -.6097962    .7937682
          4  |  -.1311099   .3844554    -0.34   0.733    -.8846286    .6224087
          5  |  -1.001589   .5228577    -1.92   0.055    -2.026372    .0231929
          6  |  -1.134478   .7482923    -1.52   0.129    -2.601104    .3321484
          7  |  -.8232056    .704191    -1.17   0.242    -2.203395    .5569833
          8  |  -.5583127   .7125969    -0.78   0.433    -1.954977    .8383516
          9  |  -.5583127   .7125969    -0.78   0.433    -1.954977    .8383516
             |
workPTonly~n |
          1  |  -.0698834   .2663438    -0.26   0.793    -.5919076    .4521408
          2  |   -.051016   .2718747    -0.19   0.851    -.5838806    .4818487
          3  |   .2225568   .3146877     0.71   0.479    -.3942198    .8393334
          5  |   .2419923   .3795065     0.64   0.524    -.5018268    .9858114
          6  |  -.2803077   .5396681    -0.52   0.603    -1.338038    .7774223
          7  |   -.746098   .4261563    -1.75   0.080    -1.581349     .089153
          8  |   -.746098   .4261563    -1.75   0.080    -1.581349     .089153
          9  |   -.746098   .4261563    -1.75   0.080    -1.581349     .089153
             |
workFTonly~n |
          1  |  -.6201984   .2373029    -2.61   0.009    -1.085303   -.1550933
          2  |   .3828546   .2772904     1.38   0.167    -.1606245    .9263337
          4  |  -.4283275   .3417014    -1.25   0.210     -1.09805     .241395
          5  |  -.5550065   .4513088    -1.23   0.219    -1.439555    .3295424
          6  |  -.3326943   .4667578    -0.71   0.476    -1.247523    .5821341
          7  |  -.3326943   .4667578    -0.71   0.476    -1.247523    .5821341
          8  |  -.3326943   .4667578    -0.71   0.476    -1.247523    .5821341
          9  |  -.3326943   .4667578    -0.71   0.476    -1.247523    .5821341
             |
 militaryBin |
          1  |  -3.175965   .2729775   -11.63   0.000    -3.710991   -2.640939
          2  |   .5423043   .3922887     1.38   0.167    -.2265675    1.311176
          4  |   .6674653   .3501881     1.91   0.057    -.0188907    1.353821
          5  |  -.2193336   .2943412    -0.75   0.456    -.7962319    .3575646
             |
    otherBin |
          1  |  -.5887723   .2422922    -2.43   0.015    -1.063656   -.1138883
          2  |  -.4098412   .2493819    -1.64   0.100    -.8986207    .0789384
          3  |  -.0656634    .253127    -0.26   0.795    -.5617832    .4304564
          5  |  -.8434864   .4410316    -1.91   0.056    -1.707892    .0209197
          6  |  -.9337554   .4388313    -2.13   0.033    -1.793849   -.0736619
          7  |  -1.447723    .791395    -1.83   0.067    -2.998829    .1033823
          8  |  -2.917995   1.410553    -2.07   0.039    -5.682629   -.1533615
          9  |  -2.917995   1.410553    -2.07   0.039    -5.682629   -.1533615
             |
       _cons |   3.770295   1.085935     3.47   0.001     1.641902    5.898689
-------------+----------------------------------------------------------------
16           |
       black |   .5328849   .1987027     2.68   0.007     .1434347     .922335
    hispanic |   .4501251   .2698409     1.67   0.095    -.0787534    .9790035
    born1980 |  -.0605772   .0950168    -0.64   0.524    -.2468066    .1256523
    born1981 |  -.0427906   .0922458    -0.46   0.643    -.2235891    .1380078
    born1982 |   .1591644   .0923524     1.72   0.085    -.0218431    .3401718
    born1983 |  -.0544041   .0935784    -0.58   0.561    -.2378143    .1290062
 foreignBorn |   -.234712   .1279748    -1.83   0.067    -.4855381    .0161141
      empPct |  -.1926389   .1600708    -1.20   0.229     -.506372    .1210942
incPerCapita |  -.0005048   .0071295    -0.07   0.944    -.0144784    .0134687
schoo~yBlack |  -.0012343    .057055    -0.02   0.983    -.1130601    .1105915
school~yHisp |  -.0238523   .0754339    -0.32   0.752    -.1717001    .1239955
workK12Black |  -.0582105   .1217298    -0.48   0.633    -.2967966    .1803756
 workK12Hisp |  -.2112466   .1552837    -1.36   0.174     -.515597    .0931038
workC~eBlack |  -.1111406   .0716089    -1.55   0.121    -.2514915    .0292103
workCo~eHisp |  -.1542863   .0751761    -2.05   0.040    -.3016289   -.0069438
 workPTBlack |   .0785853   .0934102     0.84   0.400    -.1044954     .261666
  workPTHisp |   .0866255   .0974481     0.89   0.374    -.1043694    .2776203
 workFTBlack |  -.0425564   .0462965    -0.92   0.358    -.1332959    .0481831
  workFTHisp |   .0485634   .0555082     0.87   0.382    -.0602306    .1573575
militaryBl~k |  -.1313916   .0657606    -2.00   0.046    -.2602801   -.0025032
militaryHisp |  -.0267687   .0673285    -0.40   0.691    -.1587302    .1051928
  otherBlack |   .0528668   .0517277     1.02   0.307    -.0485176    .1542512
   otherHisp |  -.1328591   .0529271    -2.51   0.012    -.2365943   -.0291239
     hgcMoth |   -.081865   .0639381    -1.28   0.200    -.2071813    .0434513
   hgcMothSq |   .0048946   .0244021     0.20   0.841    -.0429326    .0527219
   m_hgcMoth |  -1.010863   .4380569    -2.31   0.021    -1.869439   -.1522875
     hgcFath |   .1026237   .0629294     1.63   0.103    -.0207157    .2259632
   hgcFathSq |  -.0645363    .023471    -2.75   0.006    -.1105386    -.018534
   m_hgcFath |   .2969169   .4265239     0.70   0.486    -.5390546    1.132888
      famInc |  -.0712454    .034337    -2.07   0.038    -.1385447   -.0039462
    famIncSq |   .0397361   .0233633     1.70   0.089     -.006055    .0855272
    m_famInc |  -.2446896   .1016987    -2.41   0.016    -.4440154   -.0453638
femaleHea~14 |  -.1394762   .0807153    -1.73   0.084    -.2976753    .0187228
liveWithM~14 |  -.1147087    .108809    -1.05   0.292    -.3279705     .098553
   numBAzero |  -.0912936   .0874617    -1.04   0.297    -.2627154    .0801282
numBAperCa~a |  -.0052055   .0067898    -0.77   0.443    -.0185133    .0081023
tuitionFla~p |  -.0170884   .0155749    -1.10   0.273    -.0476147    .0134379
             |
schoolOnly~n |
          1  |   2.084075   .1103222    18.89   0.000     1.867848    2.300302
          2  |   .9437932   .1012241     9.32   0.000     .7453976    1.142189
          3  |   .4361362   .0885686     4.92   0.000     .2625448    .6097275
          5  |   -.697281   .0825844    -8.44   0.000    -.8591435   -.5354186
          6  |  -1.338556     .12466   -10.74   0.000    -1.582885   -1.094227
          7  |   -1.55001   .1872037    -8.28   0.000    -1.916922   -1.183097
          8  |  -1.254008    .226201    -5.54   0.000    -1.697354   -.8106623
          9  |  -1.420474   .3309075    -4.29   0.000     -2.06904   -.7719069
             |
  workK12Bin |
          1  |   .1154766   .1155618     1.00   0.318    -.1110203    .3419735
          2  |    .335048   .1357109     2.47   0.014     .0690595    .6010366
          4  |   .0278262   .1437078     0.19   0.846     -.253836    .3094884
          5  |   .1551197   .1495226     1.04   0.300    -.1379391    .4481785
          6  |    .059477    .143687     0.41   0.679    -.2221443    .3410982
          7  |  -.0712782   .1595649    -0.45   0.655    -.3840197    .2414632
          8  |  -.3457351   .1502954    -2.30   0.021    -.6403087   -.0511614
          9  |  -.4860056    .141532    -3.43   0.001    -.7634032   -.2086081
             |
workColleg~n |
          1  |   .0502015   .1254076     0.40   0.689    -.1955929    .2959959
          2  |  -.4046973   .1455677    -2.78   0.005    -.6900047   -.1193898
          4  |  -.1423299    .169775    -0.84   0.402    -.4750828    .1904231
          5  |  -.2099048   .2109385    -1.00   0.320    -.6233366     .203527
          6  |   -.066152   .2637499    -0.25   0.802    -.5830922    .4507882
          7  |   .2220819    .234544     0.95   0.344    -.2376159    .6817796
          8  |   .2419847   .3084268     0.78   0.433    -.3625207      .84649
          9  |    .395143   .3876652     1.02   0.308    -.3646669    1.154953
             |
workPTonly~n |
          1  |  -.4790732   .1701317    -2.82   0.005    -.8125253   -.1456211
          2  |   -.274586   .1738954    -1.58   0.114    -.6154148    .0662428
          3  |   .0039631   .1899389     0.02   0.983    -.3683104    .3762365
          5  |  -.0601547    .224968    -0.27   0.789    -.5010839    .3807745
          6  |  -.4326075   .2652146    -1.63   0.103    -.9524185    .0872036
          7  |  -.6859468   .2473226    -2.77   0.006     -1.17069   -.2012035
          8  |  -.2218037   .3806567    -0.58   0.560    -.9678771    .5242698
          9  |  -.2209956   .2763045    -0.80   0.424    -.7625425    .3205512
             |
workFTonly~n |
          1  |  -.8867951   .1472993    -6.02   0.000    -1.175497   -.5980937
          2  |   .0714509   .1801176     0.40   0.692    -.2815731    .4244749
          4  |   .0567546   .2158086     0.26   0.793    -.3662225    .4797316
          5  |   .0623821   .2391464     0.26   0.794    -.4063362    .5311004
          6  |   .5965396   .2954422     2.02   0.043     .0174836    1.175596
          7  |   .8196095   .4221439     1.94   0.052    -.0077775    1.646996
          8  |    .714214    .434579     1.64   0.100    -.1375453    1.565973
          9  |   1.856905    .369286     5.03   0.000     1.133118    2.580693
             |
 militaryBin |
          1  |   2.105463   .3042617     6.92   0.000     1.509121    2.701805
          2  |   1.478964    .463695     3.19   0.001     .5701389     2.38779
          4  |   1.852998   .4040713     4.59   0.000     1.061033    2.644963
          5  |     1.4712   .3307457     4.45   0.000     .8229502     2.11945
             |
    otherBin |
          1  |  -3.010533   .1291801   -23.30   0.000    -3.263721   -2.757345
          2  |  -1.465384   .1286904   -11.39   0.000    -1.717612   -1.213155
          3  |  -.5201538   .1350928    -3.85   0.000    -.7849307   -.2553769
          5  |   .5523811   .2195089     2.52   0.012     .1221517    .9826106
          6  |   .7512687   .2043402     3.68   0.000     .3507693    1.151768
          7  |   1.253058   .2387147     5.25   0.000      .785186     1.72093
          8  |   1.519337   .3222916     4.71   0.000     .8876575    2.151017
          9  |   1.525796   .2923629     5.22   0.000     .9527748    2.098816
             |
       _cons |    1.50526   .7104311     2.12   0.034     .1128401    2.897679
-------------+----------------------------------------------------------------
17           |
       black |  -1.689471   .4724902    -3.58   0.000    -2.615535   -.7634072
    hispanic |  -.2127286    .383101    -0.56   0.579    -.9635928    .5381356
    born1980 |    .334963   .1584312     2.11   0.034     .0244435    .6454825
    born1981 |   .1244264   .1421449     0.88   0.381    -.1541726    .4030253
    born1982 |     .04913   .1383296     0.36   0.722    -.2219911    .3202511
    born1983 |   .1059054   .1469884     0.72   0.471    -.1821865    .3939974
 foreignBorn |   .0472945   .1868049     0.25   0.800    -.3188364    .4134254
      empPct |   .2579179   .2464002     1.05   0.295    -.2250176    .7408533
incPerCapita |    .009091   .0099167     0.92   0.359    -.0103453    .0285274
schoo~yBlack |   .3102047   .0887799     3.49   0.000     .1361994      .48421
school~yHisp |  -.1041498   .0834892    -1.25   0.212    -.2677857    .0594861
workK12Black |   .2101965   .1862132     1.13   0.259    -.1547747    .5751676
 workK12Hisp |   .1107454   .2115078     0.52   0.601    -.3038022     .525293
workC~eBlack |   .1273021   .1246091     1.02   0.307    -.1169272    .3715314
workCo~eHisp |   -.197354   .0909738    -2.17   0.030    -.3756594   -.0190486
 workPTBlack |  -.2800305    .287164    -0.98   0.329    -.8428615    .2828006
  workPTHisp |   .2740079   .1234226     2.22   0.026     .0321041    .5159117
 workFTBlack |   .2116248   .0719474     2.94   0.003     .0706105     .352639
  workFTHisp |   .1035334   .0884408     1.17   0.242    -.0698075    .2768742
militaryBl~k |          0  (omitted)
militaryHisp |          0  (omitted)
  otherBlack |  -.1753245   .2357161    -0.74   0.457    -.6373197    .2866706
   otherHisp |   .0860056   .1823412     0.47   0.637    -.2713765    .4433877
     hgcMoth |   .0288616   .1092689     0.26   0.792    -.1853016    .2430248
   hgcMothSq |  -.0028406   .0391868    -0.07   0.942    -.0796453    .0739641
   m_hgcMoth |   .1939596   .7849638     0.25   0.805    -1.344541     1.73246
     hgcFath |   .0213764   .1037378     0.21   0.837     -.181946    .2246988
   hgcFathSq |  -.0085588   .0361251    -0.24   0.813    -.0793627    .0622451
   m_hgcFath |   .3143212    .742683     0.42   0.672    -1.141311    1.769953
      famInc |   .0114857   .0520967     0.22   0.826    -.0906219    .1135933
    famIncSq |  -.0159636   .0302042    -0.53   0.597    -.0751629    .0432356
    m_famInc |   .1394687   .1693042     0.82   0.410    -.1923613    .4712988
femaleHea~14 |  -.1374098   .1251473    -1.10   0.272     -.382694    .1078744
liveWithM~14 |    .065564   .1728213     0.38   0.704    -.2731596    .4042876
   numBAzero |  -.1377824   .1331988    -1.03   0.301    -.3988473    .1232825
numBAperCa~a |   .0007631   .0080049     0.10   0.924    -.0149263    .0164525
tuitionFla~p |  -.0221637   .0242162    -0.92   0.360    -.0696266    .0252992
             |
schoolOnly~n |
          1  |   .3531373   .1854123     1.90   0.057    -.0102641    .7165388
          2  |  -.1537335   .1769581    -0.87   0.385     -.500565     .193098
          3  |   .0106291   .1566744     0.07   0.946    -.2964471    .3177052
          5  |  -.1569112   .1422679    -1.10   0.270    -.4357511    .1219288
          6  |   .0123002     .16927     0.07   0.942    -.3194629    .3440634
          7  |   .2045804   .2108035     0.97   0.332    -.2085869    .6177477
          8  |   .7945815   .2671773     2.97   0.003     .2709235    1.318239
          9  |   .4579945   .3446451     1.33   0.184    -.2174975    1.133486
             |
  workK12Bin |
          1  |  -.0220584   .1869212    -0.12   0.906    -.3884172    .3443003
          2  |   .1504166   .2351699     0.64   0.522    -.3105079     .611341
          4  |   .2307819   .2323904     0.99   0.321     -.224695    .6862588
          5  |  -.2192309   .3114962    -0.70   0.482    -.8297521    .3912904
          6  |  -.0639621   .2386158    -0.27   0.789    -.5316406    .4037164
          7  |   .0603847    .257966     0.23   0.815    -.4452194    .5659889
          8  |   .2863416    .195629     1.46   0.143    -.0970841    .6697674
          9  |   .2324119   .2017846     1.15   0.249    -.1630786    .6279024
             |
workColleg~n |
          1  |  -2.282909   .1833177   -12.45   0.000    -2.642205   -1.923613
          2  |  -.8642242   .1828079    -4.73   0.000    -1.222521   -.5059274
          4  |        .16   .1847344     0.87   0.386    -.2020728    .5220728
          5  |   .8251606   .1911563     4.32   0.000     .4505012     1.19982
          6  |    1.67168   .2045703     8.17   0.000      1.27073     2.07263
          7  |   2.558904    .196006    13.06   0.000     2.174739    2.943069
          8  |   3.034027   .2563303    11.84   0.000     2.531629    3.536426
          9  |    3.12514   .3419665     9.14   0.000     2.454898    3.795383
             |
workPTonly~n |
          1  |    .553891   .2380333     2.33   0.020     .0873542    1.020428
          2  |   .4174485   .2433284     1.72   0.086    -.0594664    .8943635
          3  |   .2767618   .3086824     0.90   0.370    -.3282446    .8817683
          5  |  -.1888824   .3627747    -0.52   0.603    -.8999078     .522143
          6  |  -.0594765   .4287409    -0.14   0.890    -.8997932    .7808402
          7  |   .0020601   .3965802     0.01   0.996    -.7752228     .779343
          8  |   .7944107   .4872298     1.63   0.103    -.1605421    1.749364
          9  |  -.0271395   .3852916    -0.07   0.944    -.7822972    .7280183
             |
workFTonly~n |
          1  |     .49654   .2263468     2.19   0.028     .0529084    .9401717
          2  |  -.3156134   .2761782    -1.14   0.253    -.8569127    .2256858
          4  |  -.5387047   .2836719    -1.90   0.058    -1.094691     .017282
          5  |  -.5387047   .2836719    -1.90   0.058    -1.094691     .017282
          6  |  -.5387047   .2836719    -1.90   0.058    -1.094691     .017282
          7  |  -.5387047   .2836719    -1.90   0.058    -1.094691     .017282
          8  |  -.5387047   .2836719    -1.90   0.058    -1.094691     .017282
          9  |  -.5387047   .2836719    -1.90   0.058    -1.094691     .017282
             |
 militaryBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
             |
    otherBin |
          1  |   .2098911   .2261256     0.93   0.353     -.233307    .6530891
          2  |   .1069713   .2270134     0.47   0.637    -.3379668    .5519094
          3  |   .0103236   .2258784     0.05   0.964      -.43239    .4530372
          5  |   .1857095   .3247305     0.57   0.567    -.4507506    .8221697
          6  |   .0740396   .3748574     0.20   0.843    -.6606675    .8087467
          7  |  -1.446331   .5814324    -2.49   0.013    -2.585917   -.3067441
          8  |  -1.446331   .5814324    -2.49   0.013    -2.585917   -.3067441
          9  |  -1.446331   .5814324    -2.49   0.013    -2.585917   -.3067441
             |
       _cons |  -5.597695   .8692369    -6.44   0.000    -7.301368   -3.894023
------------------------------------------------------------------------------

. predict p2risk11 p2risk12 p2risk13 p2risk14 p2risk15 p2risk16 p2risk17 if e(s
> ample), pr
(313846 missing values generated)

. estimates store logit2

. qui outreg2 using y97_logits_all_binned_t0_16, excel append  bdec(4) sdec(4)
 : 
. 
. mlogit  activity        `Pvars97' `Mvars' `Svars3' `Zvars3' `Evars3' `Fvars' 
> `Cvars' `Bvars3' if inrange(activity,21,26), base(21) difficult constraints(3
> 01/441) vce(cluster id)

Iteration 0:   log pseudolikelihood = -96936.975  
Iteration 1:   log pseudolikelihood = -83367.187  
Iteration 2:   log pseudolikelihood = -81006.234  
Iteration 3:   log pseudolikelihood = -75096.811  
Iteration 4:   log pseudolikelihood = -73404.028  
Iteration 5:   log pseudolikelihood = -72344.085  
Iteration 6:   log pseudolikelihood = -72275.359  
Iteration 7:   log pseudolikelihood = -72273.862  
Iteration 8:   log pseudolikelihood =  -72273.86  

Multinomial logistic regression                 Number of obs     =     92,144
                                                Wald chi2(310)    =    6029.25
Log pseudolikelihood =  -72273.86               Prob > chi2       =     0.0000

 ( 1)  [22]o.militaryBlack = 0
 ( 2)  [22]o.militaryHisp = 0
 ( 3)  - [22]5.workFTonlyBin + [22]6.workFTonlyBin = 0
 ( 4)  - [22]5.workFTonlyBin + [22]7.workFTonlyBin = 0
 ( 5)  - [22]5.workFTonlyBin + [22]8.workFTonlyBin = 0
 ( 6)  - [22]5.workFTonlyBin + [22]9.workFTonlyBin = 0
 ( 7)  [22]1o.militaryBin = 0
 ( 8)  [22]2o.militaryBin = 0
 ( 9)  [22]4o.militaryBin = 0
 (10)  [22]5o.militaryBin = 0
 (11)  - [22]6.otherBin + [22]7.otherBin = 0
 (12)  - [22]6.otherBin + [22]8.otherBin = 0
 (13)  - [22]6.otherBin + [22]9.otherBin = 0
 (14)  [23]o.militaryBlack = 0
 (15)  [23]o.militaryHisp = 0
 (16)  - [23]7.workFTonlyBin + [23]8.workFTonlyBin = 0
 (17)  - [23]7.workFTonlyBin + [23]9.workFTonlyBin = 0
 (18)  [23]1o.militaryBin = 0
 (19)  [23]2o.militaryBin = 0
 (20)  [23]4o.militaryBin = 0
 (21)  [23]5o.militaryBin = 0
 (22)  - [23]5.otherBin + [23]6.otherBin = 0
 (23)  - [23]6.otherBin + [23]7.otherBin = 0
 (24)  - [23]6.otherBin + [23]8.otherBin = 0
 (25)  - [23]6.otherBin + [23]9.otherBin = 0
 (26)  [24]o.militaryBlack = 0
 (27)  [24]o.militaryHisp = 0
 (28)  - [24]5.workFTonlyBin + [24]6.workFTonlyBin = 0
 (29)  - [24]5.workFTonlyBin + [24]7.workFTonlyBin = 0
 (30)  - [24]5.workFTonlyBin + [24]8.workFTonlyBin = 0
 (31)  - [24]5.workFTonlyBin + [24]9.workFTonlyBin = 0
 (32)  [24]1o.militaryBin = 0
 (33)  [24]2o.militaryBin = 0
 (34)  [24]4o.militaryBin = 0
 (35)  [24]5o.militaryBin = 0
 (36)  - [24]6.otherBin + [24]7.otherBin = 0
 (37)  - [24]6.otherBin + [24]8.otherBin = 0
 (38)  - [24]6.otherBin + [24]9.otherBin = 0
 (39)  [25]1o.schoolOnlyBin = 0
 (40)  [25]2o.schoolOnlyBin = 0
 (41)  [25]3o.schoolOnlyBin = 0
 (42)  [25]5o.schoolOnlyBin = 0
 (43)  [25]6o.schoolOnlyBin = 0
 (44)  [25]7o.schoolOnlyBin = 0
 (45)  [25]8o.schoolOnlyBin = 0
 (46)  [25]9o.schoolOnlyBin = 0
 (47)  [25]1o.workK12Bin = 0
 (48)  [25]2o.workK12Bin = 0
 (49)  [25]4o.workK12Bin = 0
 (50)  [25]5o.workK12Bin = 0
 (51)  [25]6o.workK12Bin = 0
 (52)  [25]7o.workK12Bin = 0
 (53)  [25]8o.workK12Bin = 0
 (54)  [25]9o.workK12Bin = 0
 (55)  [25]1o.workCollegeBin = 0
 (56)  [25]2o.workCollegeBin = 0
 (57)  [25]4o.workCollegeBin = 0
 (58)  [25]5o.workCollegeBin = 0
 (59)  [25]6o.workCollegeBin = 0
 (60)  [25]7o.workCollegeBin = 0
 (61)  [25]8o.workCollegeBin = 0
 (62)  [25]9o.workCollegeBin = 0
 (63)  [25]o.hispanic = 0
 (64)  [25]o.foreignBorn = 0
 (65)  [25]o.empPct = 0
 (66)  [25]o.incPerCapita = 0
 (67)  [25]o.numBAzero = 0
 (68)  [25]o.numBAperCapita = 0
 (69)  [25]o.tuitionFlagship = 0
 (70)  [25]o.schoolOnlyBlack = 0
 (71)  [25]o.schoolOnlyHisp = 0
 (72)  [25]o.workK12Black = 0
 (73)  [25]o.workK12Hisp = 0
 (74)  [25]o.workCollegeBlack = 0
 (75)  [25]o.workCollegeHisp = 0
 (76)  [25]o.workPTBlack = 0
 (77)  [25]o.workPTHisp = 0
 (78)  [25]o.workFTBlack = 0
 (79)  [25]o.workFTHisp = 0
 (80)  [25]o.militaryBlack = 0
 (81)  [25]o.militaryHisp = 0
 (82)  [25]o.otherBlack = 0
 (83)  [25]o.otherHisp = 0
 (84)  [25]o.hgcMoth = 0
 (85)  [25]o.hgcMothSq = 0
 (86)  [25]o.m_hgcMoth = 0
 (87)  [25]o.hgcFath = 0
 (88)  [25]o.hgcFathSq = 0
 (89)  [25]o.m_hgcFath = 0
 (90)  [25]o.famInc = 0
 (91)  [25]o.famIncSq = 0
 (92)  [25]o.m_famInc = 0
 (93)  [25]o.femaleHeadHH14 = 0
 (94)  [25]o.liveWithMom14 = 0
 (95)  [25]1o.workPTonlyBin = 0
 (96)  [25]2o.workPTonlyBin = 0
 (97)  [25]3o.workPTonlyBin = 0
 (98)  [25]5o.workPTonlyBin = 0
 (99)  [25]6o.workPTonlyBin = 0
 (100)  [25]7o.workPTonlyBin = 0
 (101)  [25]8o.workPTonlyBin = 0
 (102)  [25]9o.workPTonlyBin = 0
 (103)  [25]1o.workFTonlyBin = 0
 (104)  [25]2o.workFTonlyBin = 0
 (105)  [25]4o.workFTonlyBin = 0
 (106)  [25]5o.workFTonlyBin = 0
 (107)  [25]6o.workFTonlyBin = 0
 (108)  [25]7o.workFTonlyBin = 0
 (109)  [25]8o.workFTonlyBin = 0
 (110)  [25]9o.workFTonlyBin = 0
 (111)  [25]1o.militaryBin = 0
 (112)  [25]2o.militaryBin = 0
 (113)  [25]4o.militaryBin = 0
 (114)  [25]5o.militaryBin = 0
 (115)  [25]1o.otherBin = 0
 (116)  [25]2o.otherBin = 0
 (117)  [25]3o.otherBin = 0
 (118)  [25]5o.otherBin = 0
 (119)  [25]6o.otherBin = 0
 (120)  [25]7o.otherBin = 0
 (121)  [25]8o.otherBin = 0
 (122)  [25]9o.otherBin = 0
 (123)  [26]o.militaryBlack = 0
 (124)  [26]o.militaryHisp = 0
 (125)  - [26]5.workFTonlyBin + [26]6.workFTonlyBin = 0
 (126)  - [26]5.workFTonlyBin + [26]7.workFTonlyBin = 0
 (127)  - [26]5.workFTonlyBin + [26]8.workFTonlyBin = 0
 (128)  - [26]5.workFTonlyBin + [26]9.workFTonlyBin = 0
 (129)  [26]1o.militaryBin = 0
 (130)  [26]2o.militaryBin = 0
 (131)  [26]4o.militaryBin = 0
 (132)  [26]5o.militaryBin = 0
 (133)  - [26]6.otherBin + [26]7.otherBin = 0
 (134)  - [26]6.otherBin + [26]8.otherBin = 0
 (135)  - [26]6.otherBin + [26]9.otherBin = 0
                                   (Std. Err. adjusted for 895 clusters in id)
------------------------------------------------------------------------------
             |               Robust
    activity |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
21           |  (base outcome)
-------------+----------------------------------------------------------------
22           |
       black |   1.072397   1.366728     0.78   0.433     -1.60634    3.751134
    hispanic |   1.161542   1.283034     0.91   0.365    -1.353159    3.676242
    born1980 |   .0563313   .3469164     0.16   0.871    -.6236124     .736275
    born1981 |   .0495157   .3618599     0.14   0.891    -.6597167    .7587481
    born1982 |  -.4643964   .3700421    -1.25   0.209    -1.189666    .2608728
    born1983 |  -.3522576   .3426143    -1.03   0.304    -1.023769    .3192541
 foreignBorn |  -.1116535   .3935339    -0.28   0.777    -.8829658    .6596588
      empPct |  -.5117861    .552521    -0.93   0.354    -1.594707    .5711352
incPerCapita |   .0424056   .0218411     1.94   0.052    -.0004022    .0852133
schoo~yBlack |  -.2519876   .1658982    -1.52   0.129    -.5771422    .0731669
school~yHisp |  -.0507496   .1985623    -0.26   0.798    -.4399245    .3384253
workK12Black |   .6933801   .5019666     1.38   0.167    -.2904564    1.677217
 workK12Hisp |  -.5136686    .472986    -1.09   0.277    -1.440704    .4133669
workC~eBlack |    .005519     .18445     0.03   0.976    -.3559964    .3670344
workCo~eHisp |   .0098169   .1326839     0.07   0.941    -.2502389    .2698726
 workPTBlack |  -.3030828   .5934196    -0.51   0.610    -1.466164    .8599983
  workPTHisp |  -.0166185   .3441586    -0.05   0.961     -.691157    .6579201
 workFTBlack |   .0509434   .2536809     0.20   0.841    -.4462621    .5481489
  workFTHisp |  -.4310607   .1680104    -2.57   0.010     -.760355   -.1017665
militaryBl~k |          0  (omitted)
militaryHisp |          0  (omitted)
  otherBlack |   .3156032   .4233229     0.75   0.456    -.5140944    1.145301
   otherHisp |   .2576188   .5585739     0.46   0.645    -.8371659    1.352403
     hgcMoth |   .2472191   .3441686     0.72   0.473    -.4273389    .9217771
   hgcMothSq |  -.0353479   .1244952    -0.28   0.776     -.279354    .2086582
   m_hgcMoth |   4.044539   2.362275     1.71   0.087     -.585435    8.674513
     hgcFath |  -.3769827   .2524133    -1.49   0.135    -.8717037    .1177383
   hgcFathSq |   .1027975    .088247     1.16   0.244    -.0701635    .2757584
   m_hgcFath |  -4.058433   1.794613    -2.26   0.024     -7.57581   -.5410554
      famInc |   .0815851   .1136655     0.72   0.473    -.1411952    .3043654
    famIncSq |  -.0723539   .0613386    -1.18   0.238    -.1925753    .0478674
    m_famInc |   .0053117   .4618621     0.01   0.991    -.8999214    .9105448
femaleHea~14 |   .6259253   .3640545     1.72   0.086    -.0876084    1.339459
liveWithM~14 |   .1407926    .459002     0.31   0.759    -.7588347     1.04042
   numBAzero |   .4289143   .3233702     1.33   0.185    -.2048796    1.062708
numBAperCa~a |   .0263284   .0289342     0.91   0.363    -.0303815    .0830384
tuitionFla~p |   .0668456    .061223     1.09   0.275    -.0531493    .1868405
             |
schoolOnly~n |
          1  |   1.830152    .547462     3.34   0.001     .7571466    2.903158
          2  |  -.0993016   .6413909    -0.15   0.877    -1.356405    1.157802
          3  |   .0319047    .405491     0.08   0.937    -.7628431    .8266525
          5  |  -.4908912   .3471302    -1.41   0.157    -1.171254    .1894715
          6  |  -1.072902   .3841866    -2.79   0.005    -1.825894   -.3199106
          7  |  -.9072467    .415064    -2.19   0.029    -1.720757   -.0937362
          8  |  -1.530386   .4757773    -3.22   0.001    -2.462892   -.5978793
          9  |  -1.757959   .5578965    -3.15   0.002    -2.851416   -.6645019
             |
  workK12Bin |
          1  |  -.1221451     .35894    -0.34   0.734    -.8256545    .5813643
          2  |  -.1885127   .5220966    -0.36   0.718    -1.211803    .8347779
          4  |   .3191642   .4432293     0.72   0.471    -.5495494    1.187878
          5  |  -.9192379   .4691906    -1.96   0.050    -1.838835    .0003589
          6  |  -1.291557   .4493161    -2.87   0.004    -2.172201   -.4109137
          7  |   -.217399   .5892014    -0.37   0.712    -1.372213    .9374145
          8  |  -.5693432   .4752282    -1.20   0.231    -1.500773     .362087
          9  |  -.8102373   .4950231    -1.64   0.102    -1.780465    .1599902
             |
workColleg~n |
          1  |  -1.290699   .4210913    -3.07   0.002    -2.116022   -.4653747
          2  |   .3423155   .3883821     0.88   0.378    -.4188994     1.10353
          4  |     .42509   .4472906     0.95   0.342    -.4515835    1.301764
          5  |   .8971385   .3554196     2.52   0.012     .2005289    1.593748
          6  |   .3801085   .4205274     0.90   0.366    -.4441102    1.204327
          7  |   1.083754    .366794     2.95   0.003     .3648504    1.802657
          8  |   1.628669   .4096962     3.98   0.000     .8256794    2.431659
          9  |     2.2643   .5021396     4.51   0.000     1.280125    3.248476
             |
workPTonly~n |
          1  |   .7621908   .4779798     1.59   0.111    -.1746323    1.699014
          2  |   .5274507   .4734565     1.11   0.265    -.4005071    1.455408
          3  |   .6197885   .5035904     1.23   0.218    -.3672305    1.606808
          5  |   .0839634   .6738995     0.12   0.901    -1.236855    1.404782
          6  |   .9154798   .7004565     1.31   0.191    -.4573897    2.288349
          7  |  -.0598401   .6326132    -0.09   0.925    -1.299739    1.180059
          8  |   .4258112   .6669542     0.64   0.523    -.8813951    1.733017
          9  |   .1595528   .6627661     0.24   0.810    -1.139445    1.458551
             |
workFTonly~n |
          1  |  -1.187318   .3230259    -3.68   0.000    -1.820437    -.554199
          2  |   -.564923    .384538    -1.47   0.142    -1.318604    .1887576
          4  |   .7076072   .5110443     1.38   0.166    -.2940212    1.709236
          5  |   .5541416   .4226652     1.31   0.190    -.2742669     1.38255
          6  |   .5541416   .4226652     1.31   0.190    -.2742669     1.38255
          7  |   .5541416   .4226652     1.31   0.190    -.2742669     1.38255
          8  |   .5541416   .4226652     1.31   0.190    -.2742669     1.38255
          9  |   .5541416   .4226652     1.31   0.190    -.2742669     1.38255
             |
 militaryBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
             |
    otherBin |
          1  |   1.003035   .4117584     2.44   0.015     .1960036    1.810067
          2  |   .7370815   .4036487     1.83   0.068    -.0540554    1.528218
          3  |   .7362422   .4020033     1.83   0.067    -.0516698    1.524154
          5  |   .0587296    .565971     0.10   0.917    -1.050553    1.168012
          6  |   .9225136   .5233075     1.76   0.078    -.1031503    1.948178
          7  |   .9225136   .5233075     1.76   0.078    -.1031503    1.948178
          8  |   .9225136   .5233075     1.76   0.078    -.1031503    1.948178
          9  |   .9225136   .5233075     1.76   0.078    -.1031503    1.948178
             |
       _cons |  -.3085563   2.107259    -0.15   0.884    -4.438708    3.821596
-------------+----------------------------------------------------------------
23           |
       black |   1.557597   1.188077     1.31   0.190    -.7709908    3.886186
    hispanic |   .8631926   1.370562     0.63   0.529     -1.82306    3.549445
    born1980 |  -.5231459   .3199653    -1.64   0.102    -1.150266    .1039745
    born1981 |  -.5697971   .3383137    -1.68   0.092     -1.23288    .0932856
    born1982 |  -.8526526   .3523817    -2.42   0.016    -1.543308   -.1619972
    born1983 |  -.6860342   .3248324    -2.11   0.035    -1.322694   -.0493744
 foreignBorn |   .1490876   .3879976     0.38   0.701    -.6113738     .909549
      empPct |  -.1700962   .5157275    -0.33   0.742    -1.180904    .8407112
incPerCapita |   .0331951   .0209025     1.59   0.112     -.007773    .0741632
schoo~yBlack |  -.3417667   .1541408    -2.22   0.027     -.643877   -.0396563
school~yHisp |  -.1939256   .1982965    -0.98   0.328    -.5825795    .1947284
workK12Black |   .4095483    .444164     0.92   0.356     -.460997    1.280094
 workK12Hisp |  -.8436936   .5004009    -1.69   0.092    -1.824461    .1370743
workC~eBlack |  -.0297395   .1664307    -0.18   0.858    -.3559377    .2964587
workCo~eHisp |   -.025932   .1415868    -0.18   0.855    -.3034371    .2515731
 workPTBlack |   .2926863   .2940966     1.00   0.320    -.2837326    .8691051
  workPTHisp |   .3365817   .2843829     1.18   0.237    -.2207986     .893962
 workFTBlack |  -.0308474    .251121    -0.12   0.902    -.5230356    .4613408
  workFTHisp |  -.1078316   .1771621    -0.61   0.543     -.455063    .2393998
militaryBl~k |          0  (omitted)
militaryHisp |          0  (omitted)
  otherBlack |   .5220758    .257305     2.03   0.042     .0177672    1.026384
   otherHisp |   .6339927   .6413596     0.99   0.323    -.6230491    1.891035
     hgcMoth |   .2684051   .3332856     0.81   0.421    -.3848227    .9216329
   hgcMothSq |  -.0783091   .1222982    -0.64   0.522    -.3180092    .1613909
   m_hgcMoth |   3.166916    2.27617     1.39   0.164    -1.294295    7.628126
     hgcFath |  -.2607455    .244397    -1.07   0.286    -.7397548    .2182639
   hgcFathSq |   .0730471   .0856589     0.85   0.394    -.0948413    .2409354
   m_hgcFath |  -2.636416   1.740611    -1.51   0.130     -6.04795     .775118
      famInc |   .0891336   .1081383     0.82   0.410    -.1228135    .3010807
    famIncSq |  -.0808151   .0586551    -1.38   0.168     -.195777    .0341467
    m_famInc |  -.0127454   .4302963    -0.03   0.976    -.8561107    .8306199
femaleHea~14 |   .7055741   .3439611     2.05   0.040     .0314227    1.379726
liveWithM~14 |   .2667617   .4054003     0.66   0.511    -.5278083    1.061332
   numBAzero |   .0937039   .3033611     0.31   0.757     -.500873    .6882807
numBAperCa~a |   .0525505   .0278331     1.89   0.059    -.0020013    .1071023
tuitionFla~p |  -.0078431   .0600961    -0.13   0.896    -.1256294    .1099431
             |
schoolOnly~n |
          1  |   1.741606   .5393652     3.23   0.001     .6844695    2.798742
          2  |  -.0605317   .6241642    -0.10   0.923    -1.283871    1.162808
          3  |   .2460626   .3997128     0.62   0.538      -.53736    1.029485
          5  |  -.6422498   .3258397    -1.97   0.049    -1.280884   -.0036156
          6  |  -1.118489   .3643797    -3.07   0.002     -1.83266   -.4043181
          7  |  -1.644284   .3829932    -4.29   0.000    -2.394937   -.8936309
          8  |  -2.139914   .4016704    -5.33   0.000    -2.927174   -1.352654
          9  |  -2.391177   .4573342    -5.23   0.000    -3.287536   -1.494818
             |
  workK12Bin |
          1  |   .1005178   .3326732     0.30   0.763    -.5515097    .7525454
          2  |   -.024611   .4858204    -0.05   0.960    -.9768015    .9275794
          4  |   .1822858   .4025473     0.45   0.651    -.6066923     .971264
          5  |  -1.065683   .3982912    -2.68   0.007     -1.84632   -.2850471
          6  |  -.7195607   .3910162    -1.84   0.066    -1.485938    .0468169
          7  |  -.6010047    .577611    -1.04   0.298    -1.733101     .531092
          8  |  -.8312924   .4350462    -1.91   0.056    -1.683967    .0213825
          9  |  -.9126587   .4567109    -2.00   0.046    -1.807796   -.0175219
             |
workColleg~n |
          1  |  -.2517546   .4488069    -0.56   0.575      -1.1314    .6278908
          2  |   .5883561   .4263957     1.38   0.168    -.2473642    1.424076
          4  |  -.2139385   .4861033    -0.44   0.660    -1.166683    .7388065
          5  |   .3730955   .3789424     0.98   0.325     -.369618    1.115809
          6  |   -.421906   .4455353    -0.95   0.344    -1.295139    .4513272
          7  |  -.1448249    .381243    -0.38   0.704    -.8920475    .6023977
          8  |  -.0790647   .4344202    -0.18   0.856    -.9305126    .7723832
          9  |  -.4458821   .4976194    -0.90   0.370    -1.421198    .5294341
             |
workPTonly~n |
          1  |  -1.424326   .3901639    -3.65   0.000    -2.189033   -.6596187
          2  |  -.9084384   .3818049    -2.38   0.017    -1.656762   -.1601145
          3  |  -.3636031   .3984241    -0.91   0.361      -1.1445    .4172938
          5  |   .6275644   .5984995     1.05   0.294     -.545473    1.800602
          6  |    .770436   .6070683     1.27   0.204     -.419396    1.960268
          7  |   .6806551   .5881477     1.16   0.247    -.4720932    1.833403
          8  |   .2367095   .6436284     0.37   0.713    -1.024779    1.498198
          9  |   1.397907   .5503716     2.54   0.011     .3191988    2.476616
             |
workFTonly~n |
          1  |  -.2612047   .3004082    -0.87   0.385     -.849994    .3275845
          2  |   .1674266   .3611276     0.46   0.643    -.5403705    .8752237
          4  |   1.389861   .4958033     2.80   0.005     .4181045    2.361618
          5  |   1.123008   .4124623     2.72   0.006     .3145967    1.931419
          6  |   .8910965   .4519291     1.97   0.049     .0053317    1.776861
          7  |   .8329053   .4414714     1.89   0.059    -.0323628    1.698173
          8  |   .8329053   .4414714     1.89   0.059    -.0323628    1.698173
          9  |   .8329053   .4414714     1.89   0.059    -.0323628    1.698173
             |
 militaryBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
             |
    otherBin |
          1  |   1.133844   .3807897     2.98   0.003     .3875102    1.880178
          2  |   .7915603   .3757364     2.11   0.035     .0551304     1.52799
          3  |   .7536214   .3619087     2.08   0.037     .0442934    1.462949
          5  |   .7276114   .4632895     1.57   0.116    -.1804193    1.635642
          6  |   .7276114   .4632895     1.57   0.116    -.1804193    1.635642
          7  |   .7276114   .4632895     1.57   0.116    -.1804193    1.635642
          8  |   .7276114   .4632895     1.57   0.116    -.1804193    1.635642
          9  |   .7276114   .4632895     1.57   0.116    -.1804193    1.635642
             |
       _cons |   1.496673   2.033133     0.74   0.462    -2.488194    5.481539
-------------+----------------------------------------------------------------
24           |
       black |    1.49434   1.139613     1.31   0.190    -.7392602     3.72794
    hispanic |   2.200533   1.287438     1.71   0.087    -.3227997    4.723865
    born1980 |  -.4681539   .3139692    -1.49   0.136    -1.083522    .1472144
    born1981 |  -.4857388   .3304466    -1.47   0.142    -1.133402    .1619247
    born1982 |  -.6714125   .3333421    -2.01   0.044    -1.324751   -.0180741
    born1983 |  -.7826262   .3109445    -2.52   0.012    -1.392066   -.1731862
 foreignBorn |  -.1228991   .3567376    -0.34   0.730    -.8220919    .5762936
      empPct |  -.3325801   .4972784    -0.67   0.504    -1.307228    .6420678
incPerCapita |   .0353394   .0197619     1.79   0.074    -.0033932     .074072
schoo~yBlack |  -.3368552    .138036    -2.44   0.015    -.6074007   -.0663096
school~yHisp |  -.3883835   .1900685    -2.04   0.041    -.7609109   -.0158561
workK12Black |   .2064873    .447162     0.46   0.644    -.6699342    1.082909
 workK12Hisp |  -1.146835   .3897525    -2.94   0.003    -1.910736   -.3829345
workC~eBlack |  -.0433974   .1695572    -0.26   0.798    -.3757233    .2889286
workCo~eHisp |  -.1298339   .1382216    -0.94   0.348    -.4007432    .1410754
 workPTBlack |   .2204877   .3199656     0.69   0.491    -.4066332    .8476087
  workPTHisp |   .1339194   .2788972     0.48   0.631    -.4127091    .6805478
 workFTBlack |    .114964    .245102     0.47   0.639    -.3654271    .5953552
  workFTHisp |  -.0573363   .1571546    -0.36   0.715    -.3653537     .250681
militaryBl~k |          0  (omitted)
militaryHisp |          0  (omitted)
  otherBlack |   .3164748     .23801     1.33   0.184    -.1500162    .7829658
   otherHisp |   .6680654   .6081898     1.10   0.272    -.5239647    1.860096
     hgcMoth |   .1062544   .3127057     0.34   0.734    -.5066376    .7191463
   hgcMothSq |  -.0236306   .1155623    -0.20   0.838    -.2501285    .2028673
   m_hgcMoth |    2.18427   2.096288     1.04   0.297    -1.924379     6.29292
     hgcFath |  -.0883162   .2352109    -0.38   0.707     -.549321    .3726887
   hgcFathSq |   .0035665   .0829889     0.04   0.966    -.1590888    .1662217
   m_hgcFath |  -2.016731   1.655072    -1.22   0.223    -5.260612    1.227149
      famInc |  -.0207713   .0993708    -0.21   0.834    -.2155345    .1739918
    famIncSq |  -.0254788   .0537677    -0.47   0.636    -.1308615    .0799039
    m_famInc |  -.4195752   .4097098    -1.02   0.306    -1.222592    .3834413
femaleHea~14 |   .6691067   .3249452     2.06   0.039     .0322258    1.305988
liveWithM~14 |   .2918873   .3937203     0.74   0.458    -.4797904    1.063565
   numBAzero |    .188039   .2869652     0.66   0.512    -.3744024    .7504804
numBAperCa~a |    .055209    .026717     2.07   0.039     .0028447    .1075733
tuitionFla~p |   .0147244   .0570525     0.26   0.796    -.0970964    .1265453
             |
schoolOnly~n |
          1  |   1.733407   .5200137     3.33   0.001     .7141984    2.752615
          2  |  -.1362703   .5957925    -0.23   0.819    -1.304002    1.031462
          3  |   .1843337   .3614349     0.51   0.610    -.5240657     .892733
          5  |  -.5705633   .2999634    -1.90   0.057    -1.158481    .0173541
          6  |  -1.117221   .3235511    -3.45   0.001    -1.751369   -.4830724
          7  |   -1.42415   .3576543    -3.98   0.000    -2.125139   -.7231602
          8  |  -1.820904   .3692219    -4.93   0.000    -2.544565   -1.097242
          9  |  -1.730803   .3898261    -4.44   0.000    -2.494849   -.9667583
             |
  workK12Bin |
          1  |  -.1245305   .3198121    -0.39   0.697    -.7513506    .5022897
          2  |   .2503522   .4429498     0.57   0.572    -.6178135    1.118518
          4  |   .3923305   .3643894     1.08   0.282    -.3218595    1.106521
          5  |  -.9800722   .3826135    -2.56   0.010    -1.729981   -.2301635
          6  |  -.9282355   .3796205    -2.45   0.014    -1.672278    -.184193
          7  |  -.5050354   .5734281    -0.88   0.378    -1.628934     .618863
          8  |  -.7177049   .4183647    -1.72   0.086    -1.537685    .1022749
          9  |  -.7065337   .4433749    -1.59   0.111    -1.575533    .1624651
             |
workColleg~n |
          1  |   -.433985   .4129318    -1.05   0.293    -1.243317    .3753465
          2  |   .6906891   .4083892     1.69   0.091    -.1097391    1.491117
          4  |  -.0738402   .4548084    -0.16   0.871    -.9652483    .8175679
          5  |   .6012315   .3600155     1.67   0.095     -.104386    1.306849
          6  |  -.1140618   .4160909    -0.27   0.784    -.9295849    .7014614
          7  |   .2758259   .3600095     0.77   0.444    -.4297798    .9814316
          8  |    .274998   .4086781     0.67   0.501    -.5259964    1.075992
          9  |   .1794427   .4718273     0.38   0.704    -.7453218    1.104207
             |
workPTonly~n |
          1  |   .4351189   .4003335     1.09   0.277    -.3495203    1.219758
          2  |   .3810728   .3932639     0.97   0.333    -.3897104    1.151856
          3  |   .1822526   .4124432     0.44   0.659    -.6261213    .9906264
          5  |   .4660807   .6040469     0.77   0.440    -.7178295    1.649991
          6  |   .5709161    .605361     0.94   0.346    -.6155697    1.757402
          7  |  -.3217966   .6086259    -0.53   0.597    -1.514681    .8710883
          8  |  -.1861556   .6608274    -0.28   0.778    -1.481354    1.109042
          9  |  -.1395845    .559444    -0.25   0.803    -1.236075    .9569056
             |
workFTonly~n |
          1  |   -2.01332   .2906619    -6.93   0.000    -2.583007   -1.443633
          2  |  -.1292159   .3474666    -0.37   0.710    -.8102378     .551806
          4  |    1.61116   .4752408     3.39   0.001     .6797049    2.542615
          5  |   1.848357   .4019365     4.60   0.000     1.060576    2.636138
          6  |   1.848357   .4019365     4.60   0.000     1.060576    2.636138
          7  |   1.848357   .4019365     4.60   0.000     1.060576    2.636138
          8  |   1.848357   .4019365     4.60   0.000     1.060576    2.636138
          9  |   1.848357   .4019365     4.60   0.000     1.060576    2.636138
             |
 militaryBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
             |
    otherBin |
          1  |   1.424378   .3657269     3.89   0.000     .7075664     2.14119
          2  |   .9069081   .3566389     2.54   0.011     .2079086    1.605907
          3  |   .9439314   .3551426     2.66   0.008     .2478646    1.639998
          5  |   .7530943    .471513     1.60   0.110    -.1710541    1.677243
          6  |    .739183   .4345652     1.70   0.089     -.112549    1.590915
          7  |    .739183   .4345652     1.70   0.089     -.112549    1.590915
          8  |    .739183   .4345652     1.70   0.089     -.112549    1.590915
          9  |    .739183   .4345652     1.70   0.089     -.112549    1.590915
             |
       _cons |   3.185941   1.829305     1.74   0.082    -.3994313    6.771313
-------------+----------------------------------------------------------------
25           |
       black |  -.0100585   .6259798    -0.02   0.987    -1.236956    1.216839
    hispanic |          0  (omitted)
    born1980 |  -.2534877   .8561141    -0.30   0.767    -1.931441    1.424465
    born1981 |   .3433077   .7831445     0.44   0.661    -1.191627    1.878243
    born1982 |  -.4547789   .8606046    -0.53   0.597    -2.141533    1.231975
    born1983 |  -.0859431   .7813182    -0.11   0.912    -1.617299    1.445413
 foreignBorn |          0  (omitted)
      empPct |          0  (omitted)
incPerCapita |          0  (omitted)
schoo~yBlack |          0  (omitted)
school~yHisp |          0  (omitted)
workK12Black |          0  (omitted)
 workK12Hisp |          0  (omitted)
workC~eBlack |          0  (omitted)
workCo~eHisp |          0  (omitted)
 workPTBlack |          0  (omitted)
  workPTHisp |          0  (omitted)
 workFTBlack |          0  (omitted)
  workFTHisp |          0  (omitted)
militaryBl~k |          0  (omitted)
militaryHisp |          0  (omitted)
  otherBlack |          0  (omitted)
   otherHisp |          0  (omitted)
     hgcMoth |          0  (omitted)
   hgcMothSq |          0  (omitted)
   m_hgcMoth |          0  (omitted)
     hgcFath |          0  (omitted)
   hgcFathSq |          0  (omitted)
   m_hgcFath |          0  (omitted)
      famInc |          0  (omitted)
    famIncSq |          0  (omitted)
    m_famInc |          0  (omitted)
femaleHea~14 |          0  (omitted)
liveWithM~14 |          0  (omitted)
   numBAzero |          0  (omitted)
numBAperCa~a |          0  (omitted)
tuitionFla~p |          0  (omitted)
             |
schoolOnly~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
  workK12Bin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
workColleg~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
workPTonly~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
workFTonly~n |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
 militaryBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
             |
    otherBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          3  |          0  (omitted)
          5  |          0  (omitted)
          6  |          0  (omitted)
          7  |          0  (omitted)
          8  |          0  (omitted)
          9  |          0  (omitted)
             |
       _cons |  -.6382933   .6790169    -0.94   0.347    -1.969142    .6925553
-------------+----------------------------------------------------------------
26           |
       black |   1.808985   1.509295     1.20   0.231    -1.149178    4.767148
    hispanic |   2.216727   1.473078     1.50   0.132    -.6704538    5.103908
    born1980 |  -1.069389   .3255285    -3.29   0.001    -1.707413   -.4313644
    born1981 |  -1.063235   .3605761    -2.95   0.003    -1.769951   -.3565184
    born1982 |  -.8213145   .3506049    -2.34   0.019    -1.508487   -.1341416
    born1983 |  -.8521915   .3227068    -2.64   0.008    -1.484685   -.2196979
 foreignBorn |  -.1566087   .3884522    -0.40   0.687     -.917961    .6047436
      empPct |  -.0422251   .5455864    -0.08   0.938    -1.111555    1.027105
incPerCapita |   .0353769   .0214594     1.65   0.099    -.0066828    .0774367
schoo~yBlack |  -.4951529   .2100731    -2.36   0.018    -.9068886   -.0834172
school~yHisp |  -.4483959   .2018586    -2.22   0.026    -.8440314   -.0527603
workK12Black |   .5931384   .4605149     1.29   0.198    -.3094543    1.495731
 workK12Hisp |  -.6919236   .4870032    -1.42   0.155    -1.646432    .2625851
workC~eBlack |  -.0712712   .1910203    -0.37   0.709    -.4456641    .3031217
workCo~eHisp |    -.09187   .1591116    -0.58   0.564     -.403723     .219983
 workPTBlack |   .3776673   .3086369     1.22   0.221    -.2272498    .9825845
  workPTHisp |    .407736   .3011216     1.35   0.176    -.1824514    .9979234
 workFTBlack |    .033392   .2540255     0.13   0.895    -.4644888    .5312729
  workFTHisp |  -.3116754   .1716621    -1.82   0.069    -.6481269    .0247761
militaryBl~k |          0  (omitted)
militaryHisp |          0  (omitted)
  otherBlack |   .3674894   .2295444     1.60   0.109    -.0824095    .8173882
   otherHisp |   .3670798   .6318064     0.58   0.561    -.8712381    1.605398
     hgcMoth |   .0269724   .3283196     0.08   0.935    -.6165222    .6704671
   hgcMothSq |   .0196078   .1193906     0.16   0.870    -.2143935     .253609
   m_hgcMoth |   1.891045   2.238349     0.84   0.398    -2.496038    6.278128
     hgcFath |  -.0617744   .2410266    -0.26   0.798    -.5341778    .4106291
   hgcFathSq |  -.0319406   .0852937    -0.37   0.708    -.1991133    .1352321
   m_hgcFath |  -2.225371   1.701894    -1.31   0.191    -5.561022     1.11028
      famInc |  -.0029937   .1151469    -0.03   0.979    -.2286774      .22269
    famIncSq |   .0118211   .0628415     0.19   0.851     -.111346    .1349881
    m_famInc |  -.2357567   .4534192    -0.52   0.603    -1.124442    .6529287
femaleHea~14 |   .7646899   .3565045     2.14   0.032     .0659539    1.463426
liveWithM~14 |  -.3628466   .4211103    -0.86   0.389    -1.188208    .4625144
   numBAzero |    .520226   .3102354     1.68   0.094    -.0878241    1.128276
numBAperCa~a |   .0801482   .0294033     2.73   0.006     .0225188    .1377775
tuitionFla~p |   .0527126   .0626527     0.84   0.400    -.0700845    .1755097
             |
schoolOnly~n |
          1  |   1.933733    .606628     3.19   0.001     .7447641    3.122702
          2  |  -.0622534   .6470351    -0.10   0.923    -1.330419    1.205912
          3  |     .14708   .4694961     0.31   0.754    -.7731155    1.067276
          5  |  -.8643089   .3756129    -2.30   0.021    -1.600497   -.1281211
          6  |  -1.224461   .3950093    -3.10   0.002    -1.998665   -.4502573
          7  |  -1.814805   .4392696    -4.13   0.000    -2.675757   -.9538521
          8  |  -1.992013   .4477836    -4.45   0.000    -2.869653   -1.114373
          9  |   -1.97858   .4653894    -4.25   0.000    -2.890727   -1.066434
             |
  workK12Bin |
          1  |   .2832949   .3834882     0.74   0.460     -.468328    1.034918
          2  |   .7282799   .5001294     1.46   0.145    -.2519558    1.708516
          4  |   .8376777   .4623439     1.81   0.070    -.0684998    1.743855
          5  |  -.5386481   .4686624    -1.15   0.250     -1.45721    .3799133
          6  |  -.3132356   .4858419    -0.64   0.519    -1.265468     .638997
          7  |  -.7995606   .7423308    -1.08   0.281    -2.254502     .655381
          8  |   .2306422   .4836852     0.48   0.633    -.7173635    1.178648
          9  |   .1789198    .512689     0.35   0.727    -.8259321    1.183772
             |
workColleg~n |
          1  |   -.033277   .4328311    -0.08   0.939    -.8816104    .8150563
          2  |   .2712702   .4406805     0.62   0.538    -.5924477    1.134988
          4  |  -.4014389   .4812094    -0.83   0.404    -1.344592    .5417142
          5  |   .3208648   .3977285     0.81   0.420    -.4586687    1.100398
          6  |  -.7245998   .4445368    -1.63   0.103    -1.595876    .1466763
          7  |  -.2587997   .4002475    -0.65   0.518    -1.043271     .525671
          8  |   .3248871   .4448418     0.73   0.465    -.5469868    1.196761
          9  |  -.1642967   .4983117    -0.33   0.742     -1.14097    .8123763
             |
workPTonly~n |
          1  |   .5799585   .4799718     1.21   0.227    -.3607688    1.520686
          2  |   .4790647   .4707342     1.02   0.309    -.4435574    1.401687
          3  |   .4983122   .4935307     1.01   0.313    -.4689901    1.465614
          5  |   .1731213   .6700316     0.26   0.796    -1.140117    1.486359
          6  |   .2815903   .7018991     0.40   0.688    -1.094107    1.657287
          7  |   .1737471   .7009274     0.25   0.804    -1.200045     1.54754
          8  |  -.3459995   .7575385    -0.46   0.648    -1.830748    1.138749
          9  |  -.0632981   .6525914    -0.10   0.923    -1.342354    1.215758
             |
workFTonly~n |
          1  |  -.3320298   .3202392    -1.04   0.300    -.9596871    .2956275
          2  |   .0046142    .373744     0.01   0.990    -.7279105     .737139
          4  |   1.756505   .4933449     3.56   0.000     .7895669    2.723443
          5  |   1.711635   .4276091     4.00   0.000     .8735369    2.549734
          6  |   1.711635   .4276091     4.00   0.000     .8735369    2.549734
          7  |   1.711635   .4276091     4.00   0.000     .8735369    2.549734
          8  |   1.711635   .4276091     4.00   0.000     .8735369    2.549734
          9  |   1.711635   .4276091     4.00   0.000     .8735369    2.549734
             |
 militaryBin |
          1  |          0  (omitted)
          2  |          0  (omitted)
          4  |          0  (omitted)
          5  |          0  (omitted)
             |
    otherBin |
          1  |  -1.719561   .3727522    -4.61   0.000    -2.450142   -.9889804
          2  |  -.7369594    .344088    -2.14   0.032    -1.411359   -.0625593
          3  |  -.0176075    .336349    -0.05   0.958    -.6768394    .6416244
          5  |    1.13883    .472501     2.41   0.016     .2127453    2.064915
          6  |   2.510195   .4315141     5.82   0.000     1.664443    3.355947
          7  |   2.510195   .4315141     5.82   0.000     1.664443    3.355947
          8  |   2.510195   .4315141     5.82   0.000     1.664443    3.355947
          9  |   2.510195   .4315141     5.82   0.000     1.664443    3.355947
             |
       _cons |    1.98394   1.995006     0.99   0.320      -1.9262     5.89408
------------------------------------------------------------------------------

. predict p3risk21 p3risk22 p3risk23 p3risk24 p3risk25 p3risk26 if e(sample), p
> r
(700487 missing values generated)

. estimates store logit3

. qui outreg2 using y97_logits_all_binned_t0_16, excel append  bdec(4) sdec(4)
 : 
. 
. *============================================================================
. * Model Fit of Logits
. *============================================================================
. tab activity if inrange(activity, 1, 7)

   activity |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     56,953       25.69       25.69
          2 |     45,415       20.48       46.17
          3 |     21,876        9.87       56.04
          4 |     44,009       19.85       75.89
          5 |        251        0.11       76.00
          6 |     49,478       22.32       98.32
          7 |      3,720        1.68      100.00
------------+-----------------------------------
      Total |    221,702      100.00

. sum p1risk*  if inrange(activity, 1, 7), sep(0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     p1risk1 |    221,702    .2568899    .2741549   4.00e-23   .8945049
     p1risk2 |    221,702     .204847     .243137   1.38e-12     .84601
     p1risk3 |    221,702     .098673    .0856009   .0048244   .8796447
     p1risk4 |    221,702    .1985052    .2542126   .0014229   .9665022
     p1risk5 |    221,702    .0011322    .0030802   1.98e-26   .0190903
     p1risk6 |    221,702    .2231734    .2419016   .0107489   .9750739
     p1risk7 |    221,702    .0167793    .0306226   7.20e-06   .6423633

. tab activity if inrange(activity,11,17)

   activity |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |     34,075        7.12        7.12
         12 |     66,632       13.92       21.03
         13 |     56,795       11.86       32.90
         14 |    223,560       46.69       79.59
         15 |     18,823        3.93       83.52
         16 |     78,004       16.29       99.81
         17 |        896        0.19      100.00
------------+-----------------------------------
      Total |    478,785      100.00

. sum p2risk*  if inrange(activity,11,17), sep(0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p2risk11 |    478,785    .0711697    .1214979   .0000196   .8931696
    p2risk12 |    478,785    .1391689     .201434   .0005792   .9146715
    p2risk13 |    478,785    .1186232    .1108066   .0015284   .8793083
    p2risk14 |    478,785    .4669319    .2942864   .0039652   .9741337
    p2risk15 |    478,785    .0393141    .1294211   2.60e-07    .930725
    p2risk16 |    478,785    .1629207    .1948472   .0010632   .9481239
    p2risk17 |    478,785    .0018714    .0083564   6.78e-10   .3226544

. tab activity if inrange(activity,21,26)

   activity |      Freq.     Percent        Cum.
------------+-----------------------------------
         21 |      3,302        3.58        3.58
         22 |      7,912        8.59       12.17
         23 |      7,758        8.42       20.59
         24 |     64,669       70.18       90.77
         25 |      1,636        1.78       92.55
         26 |      6,867        7.45      100.00
------------+-----------------------------------
      Total |     92,144      100.00

. sum p3risk*  if inrange(activity,21,26), sep(0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    p3risk21 |     92,144    .0358352    .0708818   .0000104   .6374255
    p3risk22 |     92,144    .0858656    .0964778   .0000252   .7458744
    p3risk23 |     92,144    .0841943    .1155706   .0008488   .8349422
    p3risk24 |     92,144    .7018254    .2377152   .0169986    .996319
    p3risk25 |     92,144    .0177548    .0365488   5.69e-06    .380684
    p3risk26 |     92,144    .0745247    .1270963   .0003176   .9266997

. 
. *============================================================================
. * Model Fit of Graduation probabilities by schooling bins
. *============================================================================
. tab schoolOnlyBin          if inrange(activity, 1, 7), sum(p1risk7)

schoolOnlyB |     Summary of Pr(activity==7)
         in |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          1 |   .01137057    .0184792      88,474
          2 |   .01308986   .02339902      55,310
          3 |   .02019621   .03476249      36,492
          4 |   .02978705   .04511237      23,433
          5 |   .03128967   .05131856      15,756
          6 |   .03030303   .03920944       1,716
          7 |     .021875   .01739247         320
          8 |   .01492537   .01080868         201
------------+------------------------------------
      Total |   .01677928   .03062265     221,702

. tab schoolOnlyBin activity if inrange(activity, 1, 7), cell

+-----------------+
| Key             |
|-----------------|
|    frequency    |
| cell percentage |
+-----------------+

schoolOnly |                        activity
       Bin |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |    21,246     27,386      8,658     14,548         30 |    88,474 
           |      9.58      12.35       3.91       6.56       0.01 |     39.91 
-----------+-------------------------------------------------------+----------
         2 |    15,956      9,915      5,089     10,241         59 |    55,310 
           |      7.20       4.47       2.30       4.62       0.03 |     24.95 
-----------+-------------------------------------------------------+----------
         3 |    10,779      4,801      3,665      7,574         71 |    36,492 
           |      4.86       2.17       1.65       3.42       0.03 |     16.46 
-----------+-------------------------------------------------------+----------
         4 |     5,645      2,306      2,275      6,658          3 |    23,433 
           |      2.55       1.04       1.03       3.00       0.00 |     10.57 
-----------+-------------------------------------------------------+----------
         5 |     2,873        897      1,918      4,645         88 |    15,756 
           |      1.30       0.40       0.87       2.10       0.04 |      7.11 
-----------+-------------------------------------------------------+----------
         6 |       350        104        158        324          0 |     1,716 
           |      0.16       0.05       0.07       0.15       0.00 |      0.77 
-----------+-------------------------------------------------------+----------
         7 |        88          5        105         18          0 |       320 
           |      0.04       0.00       0.05       0.01       0.00 |      0.14 
-----------+-------------------------------------------------------+----------
         8 |        16          1          8          1          0 |       201 
           |      0.01       0.00       0.00       0.00       0.00 |      0.09 
-----------+-------------------------------------------------------+----------
     Total |    56,953     45,415     21,876     44,009        251 |   221,702 
           |     25.69      20.48       9.87      19.85       0.11 |    100.00 


schoolOnly |       activity
       Bin |         6          7 |     Total
-----------+----------------------+----------
         1 |    15,600      1,006 |    88,474 
           |      7.04       0.45 |     39.91 
-----------+----------------------+----------
         2 |    13,326        724 |    55,310 
           |      6.01       0.33 |     24.95 
-----------+----------------------+----------
         3 |     8,865        737 |    36,492 
           |      4.00       0.33 |     16.46 
-----------+----------------------+----------
         4 |     5,848        698 |    23,433 
           |      2.64       0.31 |     10.57 
-----------+----------------------+----------
         5 |     4,842        493 |    15,756 
           |      2.18       0.22 |      7.11 
-----------+----------------------+----------
         6 |       728         52 |     1,716 
           |      0.33       0.02 |      0.77 
-----------+----------------------+----------
         7 |        97          7 |       320 
           |      0.04       0.00 |      0.14 
-----------+----------------------+----------
         8 |       172          3 |       201 
           |      0.08       0.00 |      0.09 
-----------+----------------------+----------
     Total |    49,478      3,720 |   221,702 
           |     22.32       1.68 |    100.00 


. tab schoolOnlyBin          if inrange(activity,11,17), sum(p2risk17)

schoolOnlyB |     Summary of Pr(activity==17)
         in |        Mean   Std. Dev.       Freq.
------------+------------------------------------
          1 |   .00066918   .00264322     103,112
          2 |   .00098915   .00364277      77,845
          3 |   .00123696   .00493496      82,460
          4 |    .0014253   .00602171      76,475
          5 |   .00191423   .00658835      89,331
          6 |   .00479496   .01327257      29,823
          7 |   .01090431   .02651611      10,638
          8 |   .01151401   .02962725       5,819
          9 |   .01279709   .02956568       3,282
------------+------------------------------------
      Total |    .0018714   .00835641     478,785

. tab schoolOnlyBin activity if inrange(activity,11,17), cell

+-----------------+
| Key             |
|-----------------|
|    frequency    |
| cell percentage |
+-----------------+

schoolOnly |                        activity
       Bin |        11         12         13         14         15 |     Total
-----------+-------------------------------------------------------+----------
         1 |     1,591     13,588     11,879     57,623      4,948 |   103,112 
           |      0.33       2.84       2.48      12.04       1.03 |     21.54 
-----------+-------------------------------------------------------+----------
         2 |     2,800     11,677      9,620     40,085      2,925 |    77,845 
           |      0.58       2.44       2.01       8.37       0.61 |     16.26 
-----------+-------------------------------------------------------+----------
         3 |     3,827     10,811     10,101     40,547      3,384 |    82,460 
           |      0.80       2.26       2.11       8.47       0.71 |     17.22 
-----------+-------------------------------------------------------+----------
         4 |     4,896     10,670     10,065     32,962      3,285 |    76,475 
           |      1.02       2.23       2.10       6.88       0.69 |     15.97 
-----------+-------------------------------------------------------+----------
         5 |     9,331     12,080     10,373     38,447      2,859 |    89,331 
           |      1.95       2.52       2.17       8.03       0.60 |     18.66 
-----------+-------------------------------------------------------+----------
         6 |     5,938      5,140      3,058      9,095        683 |    29,823 
           |      1.24       1.07       0.64       1.90       0.14 |      6.23 
-----------+-------------------------------------------------------+----------
         7 |     3,117      1,675        895      2,850        192 |    10,638 
           |      0.65       0.35       0.19       0.60       0.04 |      2.22 
-----------+-------------------------------------------------------+----------
         8 |     1,436        701        491      1,401        338 |     5,819 
           |      0.30       0.15       0.10       0.29       0.07 |      1.22 
-----------+-------------------------------------------------------+----------
         9 |     1,139        290        313        550        209 |     3,282 
           |      0.24       0.06       0.07       0.11       0.04 |      0.69 
-----------+-------------------------------------------------------+----------
     Total |    34,075     66,632     56,795    223,560     18,823 |   478,785 
           |      7.12      13.92      11.86      46.69       3.93 |    100.00 


schoolOnly |       activity
       Bin |        16         17 |     Total
-----------+----------------------+----------
         1 |    13,414         69 |   103,112 
           |      2.80       0.01 |     21.54 
-----------+----------------------+----------
         2 |    10,661         77 |    77,845 
           |      2.23       0.02 |     16.26 
-----------+----------------------+----------
         3 |    13,688        102 |    82,460 
           |      2.86       0.02 |     17.22 
-----------+----------------------+----------
         4 |    14,488        109 |    76,475 
           |      3.03       0.02 |     15.97 
-----------+----------------------+----------
         5 |    16,070        171 |    89,331 
           |      3.36       0.04 |     18.66 
-----------+----------------------+----------
         6 |     5,766        143 |    29,823 
           |      1.20       0.03 |      6.23 
-----------+----------------------+----------
         7 |     1,793        116 |    10,638 
           |      0.37       0.02 |      2.22 
-----------+----------------------+----------
         8 |     1,385         67 |     5,819 
           |      0.29       0.01 |      1.22 
-----------+----------------------+----------
         9 |       739         42 |     3,282 
           |      0.15       0.01 |      0.69 
-----------+----------------------+----------
     Total |    78,004        896 |   478,785 
           |     16.29       0.19 |    100.00 


. 
. *============================================================================
. * Create output for starting values for V++
. *============================================================================
. estimates restore logit1
(results logit1 are active now)

. matrix  log1   = e(b)'

. matrix  log1v  = vecdiag(e(V))'

. matmap  log1v  log1se, map(sqrt(@))

. scalar  start1 = rowsof(log1) - e(k) + 1

. scalar  end1   = rowsof(log1)

. matrix  log1   = log1[start1..end1, 1]

. matrix  log1se = log1se[start1..end1, 1]

. 
. estimates restore logit2
(results logit2 are active now)

. matrix  log2   = e(b)'

. matrix  log2v  = vecdiag(e(V))'

. matmap  log2v  log2se, map(sqrt(@))

. scalar  start2 = rowsof(log2) - e(k) + 1

. scalar  end2   = rowsof(log2)

. matrix  log2   = log2[start2..end2, 1]

. matrix  log2se = log2se[start2..end2, 1]

. 
. estimates restore logit3
(results logit3 are active now)

. matrix  log3   = e(b)'

. matrix  log3v  = vecdiag(e(V))'

. matmap  log3v  log3se, map(sqrt(@))

. scalar  start3 = rowsof(log3) - e(k) + 1

. scalar  end3   = rowsof(log3)

. matrix  log3   = log3[start3..end3, 1]

. matrix  log3se = log3se[start3..end3, 1]

. 
. matrix logit_coef = [log1 \ log2 \ log3]

. svmat  logit_coef

. 
. matrix logit_se = [log1se \ log2se \ log3se]

. svmat  logit_se

. 
. preserve

.         keep logit_coef

.         drop if logit_coef==.
(791,096 observations deleted)

.         outsheet logit_coef using y97_logits_all_binned_t0_16_coef.csv, comma
>  replace

. restore

. 
. preserve

.         keep logit_se

.         drop if logit_se==.
(791,096 observations deleted)

.         outsheet logit_se using y97_logits_all_binned_t0_16_se.csv, comma rep
> lace

. restore

. 
. log close
      name:  <unnamed>
       log:  /home/jared/WageReturnsRepo/Analysis/y97_logits_all_binned_t0_16.l
> og
  log type:  text
 closed on:  18 Mar 2019, 12:19:07
-------------------------------------------------------------------------------
